{
  "searchQuery": "chennai murders",
  "length": 100,
  "result": [
    {
      "title": "Nine brutal murders in a house at Chennai’s Valasaravakkam 40 years ago\nPremium",
      "content": "In the morning of February 27, 1984, nine persons, eight of them belonging to a family, were found dead in mysterious circumstances at a house at Palaniappa Nagar, off Virugambakkam. The highly decomposed bodies were found lying in a heap in one of the rooms that was locked from outside. The dead included three brothers, the wives of two of them, and their three children. The ninth was an employee of a small-scale plastic factory, owned by the brothers at Virugambakkam. Though the cause of death was not immediately known, the police suspected that they should have been poisoned and murdered, a few days ago, presumably on a Friday.  The tragedy came to light around 5.15 a.m. on a Monday when the father in-law of one of the brothers arrived from Dharmapuri to visit his daughter. Seeing the doors locked and blood stains outside, he called out to the neighbours for help. The police broke open the door and found the corpses. Initially, the police suspected that the deaths could have been caused by poisoning, followed by stabbing and cutting. Some plates containing half-eaten food were found in the room. A couple of the bodies had ropes tied to the necks. Forensic experts were busy until the evening, taking the fingerprints and searching for other clues. Some injection needles were recovered from the vicinity. A police dog led them to a butcher shop nearby.  Neighbours told the investigators that no noise came from the house. The deceased were last seen on Friday. Jayaprakash, the brother-in-law of the eldest of the brothers, who was staying with the family, had told them on Saturday morning that everyone had gone to Tirupati on Friday night in a van. He himself was last seen on Sunday afternoon, when he went off in a motorcycle with two suitcases. The police began a search for him. Initial interrogation of a labourer at Valasaravakkam, close to the scene of crime, revealed that Jayaprakash had sought his help in digging a pit for a septic tank in the house on Saturday. The plan had, however, fallen through as the labourer felt that it was not feasible to scoop up the earth near the locked room for a septic tank. Enquiries were also made at a karate school at Mambalam where Jayaprakash had learnt the martial art.  Post-mortem revealed that of the nine killed, four men and two women had been hit from behind with a weapon similar to the butcher’s long knife which had sharp and blunt edges, as was evident from the uniform skull fractures and incised wounds on the chest, the neck and the hips. Strangulation with a rope had also been resorted to. Two girls, aged six and one, and a six-month-old infant had been killed by strangulation.  Jayaprakash, who was wanted for the murders, had sneaked into a students’ hostel at Triplicane, but escaped before a police team arrived. An associate of Jayaprakash at the hostel told the police that his friend was on his way to Tirupati. A police team went there. On March 1, the special team arrested Jayaprakash, 21, in Tirupati. He was brought to the city and remanded in judicial custody. He confessed to the murders. The victims included his sister, brother-in-law and their six-month-old baby. They were killed one after another between 3 p.m. and 10.30 p.m. on Friday because he was unable to bear with the humiliating treatment meted out to him by the family, he told the police.  The prosecution’s case was that between 3.30 p.m. and 10 p.m. on February 24, 1984, Jayaprakash caused the death of Narasimhan, his wife, their six-month-old male child, his brother Mani and his wife and their two female children aged six and two, another brother Arumugham, and Sekar, the employee in their factory at Palaniappa Nagar. He had beaten some of them with casuarina sticks and throttled them, and attacked some others with a knife and strangulated them with a rope. He pushed down a few and throttled them. A uniform pattern of attack was evident in all these murders, the prosecution said.  On May 26, the charge sheet was filed and the trial was conducted before the District Sessions Court, Chengalpattu. From his confession, Jayaprakash seemed to have had no peace of mind and he saw a Tamil film, Nooravadu Naal, directed by Manivannan. The theme of the film was the murder of two persons and the attack on the third, who did not succumb to injuries. The prosecution said it was probable that to ensure that the victims should not be alive, Jayaprakash not only attacked them in the back of the head to make them unconscious but also resorted to strangulation by tying the necks with jute ropes.  The defence argued that the murders might have been committed by ruthless masked dacoits who were frequenting that locality and it was impossible for a single person to commit nine murders. The court dismissed the contention as being devoid of merit.  The court awarded the death sentence to Jayaprakash because of the magnitude of the crime and the brutal and inhuman manner in which the nine persons were murdered. On April 9, 1985, the Madras High Court confirmed the sentence. However, the execution was delayed.  G. Ramasubramanian, retired DIG, Prisons, said, “Then he was kept in the condemned prisoners’ cell, which was kept locked round the clock. The cell would be opened only by the jailer and not by any other officer. A guard would always be on duty in front of the cell. His lawyer appealed against the verdict before the higher courts. Subsequently, the death sentence was commuted to life imprisonment.”  In 1989, a Bench of the High Court commuted the death sentence to life imprisonment on the ground that there was a long delay on the part of the executive in disposing of his mercy petition. Subsequently, Jayaprakash was released from prison under an amnesty scheme and led a reformed life, prison sources said.  Published - February 04, 2024 10:34 pm IST  crime / murder "
    },
    {
      "title": "Six arrested for murder of history-sheeter in Chennai",
      "content": "The Ambattur police in Chennai have arrested six persons on charges of murdering a 24-year-old history-sheeter over a previous enmity. On Monday (December 30, 2024) evening, the police received information that a youngster was battling for his life after being brutally attacked by a gang at Muthamizh Nagar, Kallikuppam, Ambattur. The police arrived at the crime scene and shifted the injured man to Government Stanley Hospital for treatment.  The police then identified the man as ‘Lota’ Naveen, 24, who had criminal cases against him at Villivakkam police station. He died without responding to treatment on Tuesday (December 31, 2024).  During the course of the investigation, the Ambattur police found that at 5.30 p.m. on Monday, when Naveen was riding his two-wheeler towards his house in Tambaram, a group of men followed him on bikes at Kallikuppam, waylaid him, and attacked him with knives.  The police arrested six men, who have been identified as N. Ashok Kumar, 24, of Aminjikarai, R. Rajesh Kumar, 21, of Villivakkam, T. Albert, 23, of Redhills, A. Vijay Solomon, 21, of ICF, P. Iman, 20, of T.P. Chatram, and M. Vinodh Kumar, 21, of Pulianthope. They were remanded to judicial custody.  Naveen was allegedly murdered by the gang owing to a past rivalry over his involvement in two murders – of a person named Karunakaran, who was murdered in ICF in 2021, and that of Udayakumar, who was murdered in Villivakkam last year.   Published - January 02, 2025 03:11 pm IST  crime / police / Chennai "
    },
    {
      "title": "In Chennai and its surroundings, a long tale of police encounters: 14 deaths, 10 encounters since 2019",
      "content": "From 2019 onwards, Chennai and its surrounding areas witnessed 10 extra-judicial killings by the police, involving 14 men, including history-sheeters.  On June 15, 2019, S. Vallarasu, 21, of Vysarpadi was gunned down by the police in Madhavaram. The police said he was a notorious history-sheeter and they were forced to shoot him because he had injured at least three police personnel. Vallarasu is said to have been involved in cases of murder, attempt to murder, and other criminal activities. The previous night, a resident of M.M. Garden, Vyasarpadi, called the police to complain that a few youth were causing a ruckus in the area. Two constables, S. Paunraj and Ramesh, went to the spot. They found Vallarasu drinking with his associates. On seeing the police, he whipped out a long knife and attacked Mr. Paunraj. Special teams were constituted to trace him, and he was traced to a truck terminal near the Madhavaram bus stand. There, he attacked two sub inspectors, Premkumar and Deepan, of the Vyasarpadi station. Sources said the police were left with little choice but to open fire at him.  On August, 21, 2020, the city police gunned down a 48 year-old history-sheeter, Shankar, when he allegedly attacked a police constable with a knife on New Avadi Road. Shankar had been detained under the Goondas Act on nine occasions. He was acquitted in a few cases. He had been involved in the attack on a Congress functionary and the owner of a supermarket. The previous night, Ayanavaram Police Inspector had detained Shankar in connection with cases related to murder and possession of ganja. At 6.30 a.m., he was taken to recover contraband, which was concealed in the debris dumped on a vacant plot near the Ayanavaram RTO on New Avadi Road. At the time, he allegedly whipped a knife from the place and allegedly attacked the police.  On October 10, 2021, a 28-year-old robbery suspect who was roaming with a weapon was shot dead in an encounter with police in Mevalurkuppam village near Sriperumbudur. The victim Murthaza, 28, a robbery suspect from Jharkhand was staying in a nearby village. He along with another associate allegedly indulged in at least three snatchings in Sriperumbudur previous night. The duo allegedly attacked a 55-year-old woman who was walking towards a bus stand and robbed her chain despite her resistance. On hearing her cries, the villagers launched a search to nab the duo who hid in a lake surrounded by forest area with thick bushes. Police also joined them and secured a suspect named Naem Akthar, 39, and another suspect was found in touch with him. A team went inside the adjoining area of a lake and the suspect Murthaza attacked one of our head constables using a knife. When the suspect went for a second attack, the inspector of the team opened fire on him in retaliation. The two men had been involved in the stabbing of a Tasmac staff member in the previous week.  Two history-sheeters, who were reportedly involved in a double murder, were gunned down by the police near Mamandur in Chengalpattu district on January 7, 2022. The dead were identified as Deena alias Dinesh, 24, and Biscuit alias Mohammed Moideen, 20, of Chengalpattu. Deena and Moideen were part of a six-member armed gang which murdered two rowdies — Appu alias Karthik, 30, of K.K. Street and Mahesh, 24, of Mettu Street — in the previous night in Chengalpattu. When a special team of police which went in search of him tried to round up the suspects at a forest adjoining the Palar at Irunkundrampalli, they threw bombs and attacked it with knives. An inspector opened fire in self-defence, said police.  At around 3 a.m. on August 1, 2023, police personnel who were conducting the checks on Karanai-Puducherry-Arungal Salai attempted to stop a speeding car. It came to a halt after bumping into a stationary police jeep. When police personnel tried to nab them, they attempted to use weapons. Police said the situation forced them to open fire on them. Vinodh alias Chotta Vinodh, 35, and Ramesh, 32, were shot dead by the police. Vinoth had a history-sheet on him at the Otteri police station and was an A+ category history-sheeter. He was involved in more than 50 offences — 10 murders, 15 attempt-to-murder cases, 10 robberies and 15 assault and extortion cases. Ramesh was an ‘A’ category history-sheeter at the Otteri station, and had more than 20 criminal cases pending against him.  On September 16, 2023, a 34-year-old history-sheeter namely A. Viswanathan alias ‘Kulla’ Vishwa was gunned down by the police on Saturday at Sogandy village near Sunguvarchatram as he allegedly tried to escape after attacking a police team that went to nab him in connection with a criminal case. He was from Kiloy village in Sriperumbudur taluk and was categorised as an A+ criminal in police records and had at least 25 cases for offences, including murders and attempt to murder, pending against him in Sriperumbudur, Oragadam, Sunguvarchatram and surrounding areas The police said he had indulged in extortion from the scrap businessmen and used to hold kangaroo courts in and around Sriperumbudur. Two murder suspects — Ragu alias Raguvaran, 38, and Hassan alias ‘Karuppu’ Hassan alias Batcha, 30 — who were involved in the murder of a history-sheeter in public were shot dead by police in Kancheepuram in the early hours of December, 27, 2023 when they reportedly attacked a police team who attempted to nab them. The special team who were searching for the suspects reached Indira Nagar following information that two of suspects were hiding there. When our personnel surrounded them at 5.30 a.m., they asked the duo to surrender. “Instead of surrendering, they attacked two of our personnel using knives. A sub-inspector in the team had to open fire in self-defence and to protect others,” said a police officer.  On October 12, 2023, Muthu Saravanan, 27, of Edapalayam and ‘Sunday’ Sathish of Gnayiru village near Redhills were gunned down by a special team of police personnel while they were hiding in a dilapidated house at Marambedu Kandigai on the Minjur-Vandalur Outer Ring Road. Both had been involved in murders and attempt to murders in the city and suburban areas..Muthu Saravanan and Sathish were hiding after they were involved in the murder of one Parthiban. Following receipt of information about the whereabouts of the duo, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects, said police.  On 14th July 2024, K. Thiruvenkadam, 33, a history-sheeter, one of the suspects who were arrested for the murder of Bahujan Samaj party (BSP) leader K. Armstrong was killed in the Puzhal Police station limits. Thiruvengadam had been involved in at least five criminal cases for offences including murder and robbery. Police said based on their confession, they took Thiruvenkadam with adequate security in a government vehicle to a house in Manali on Sunday morning to recover the weapons used for the murder. Then, he escaped from the police custody after getting down from the vehicle on the pretext of attending nature’s call and ran, pushing police personnel near Retteri. When a police team surrounded Thiruvenkadam who holed up at a place called Vegetarian village in Puzhal Police station limits early Sunday, he opened fire from an unlicensed weapon towards police personnel. Immediately, the police inspector opened fire from his service weapon towards Thiruvenkadam for self-defence.  On September 18, 2024, notorious history-sheeter Kakkathoppu Balaji was gunned down by police at a secluded place in Vyasarpadi. Police said Balaji had more than 50 criminal cases and was also wanted in a murder case. When he was surrounded, he opened fire at a police vehicle, and a police inspector retaliated by opening fire at him.  Human rights activists and advocates have condemned the series of encounters and said it should be prevented. People’s Union for Civil Liberties(PUCL) General Secretary V.Suresh said Tamil Nadu has always been a police state, irrespective of who is ruling the State. “If the police want to stop the crime it is not rocket science to bring it under control. Except, in Tamil Nadu, the nexus between the police force, politicians and various crime syndicates is too thick,” said Mr. Suresh.  Human Rights Advocate M. Pugazhendhi said in the last five years, a dozen cases of encounter deaths were reported in Chennai and suburbs. He said police personnel are continuing human rights violations. All these years, no police officers were properly prosecuted and sentenced for gunning down the accused. It is clear extra judicial killing.” “Self defence can be only proven in the court based on criminal laws until it is proven the police officer should be the murderer,” said Mr. Pugazhendhi.  I. Aseer, State coordinator of the Joint Action against Custodial Torture, said, “As per our calculation, from 1998 onwards, approximately 100 encounters were reported in the state. Wish to know whether the crime rate has decreased because of this.”  Henri Tiphagne of executive director of People’s Watch said, “I want rowdyism to be controlled; there is no second opinion about that. This is a very sad state of affairs. I want the people who break the law to be handled, but within the parameters of the law.”  Published - September 18, 2024 08:35 pm IST  Tamil Nadu / Chennai / encounters "
    },
    {
      "title": "Out in the open: Chennai sees a spurt in daylight murders",
      "content": "At a time when the police are planning to bring the city under a web of CCTV cameras by September, goons seem to be undeterred by the possibility of getting caught in the act. In brazen attacks carried out in broad daylight, armed gangs — mostly hired goons — have started murdering people, history-sheeters, in particular, on roads in full public glare. Thirty-eight year-old Suresh was the latest victim. On Thursday morning, he was attacked and murdered by a gang near a school where he had dropped his children in the morning. School students and parents were witness to the brutal murder. “It was chilling. It happened at our doorstep. We may not be able to sleep for a week,” an eyewitness said. The daylight attacks are premeditated and usually carried out to settle scores due to previous enmity among anti-socials, police said. T.C.S. Raja Chockalingam, a former district judge, said, “Although the crime rate has drastically reduced over the years, the pattern of murders is changing. The offenders now plan and commit murders in public places and in broad daylight without any qualms.”   One such instance was the murder of J. Vijayakumar by a gang on a busy road in Mannady last November. The gang chased him when he came out of the George Town court. CCTV footage showed him running for his life in a narrow pathway and falling down. The gang took just 30 seconds to kill him and escape. Kandhan, a 43-year-old real estate businessman, was hacked to death in broad daylight by four persons, even as his college-going daughter watched helplessly in West Mambalam on the morning of January 9. On April 1, Harikrishnan, a murder suspect, was killed in the Vyasarpadi police station limits on a busy morning by a four-member gang. The incident was caught on camera and went viral on social media. The next day, ‘Muttai’ Gopi, a former gangster, stopped at a roadside tea stall at Moolakadai only to be hacked to death by a gang of six. Till June, 81 murders have been recorded in the city. Last year, 145 persons were murdered. Analysing the pattern of crime, M. Karunanidhi, a former police officer, said that several judicial interventions restrict police from functioning effectively. “These days, anti-social elements have no fear of police. Moreover, there is less interaction between the police and the public to identify criminals and detain them.” Asked about the increasing frequency of day-time murders, a police officer said that the movements of rowdies were restricted at night due to patrolling.  Published - July 14, 2018 01:09 am IST"
    },
    {
      "title": "Chennai college student murders mother, brother",
      "content": "The Thiruvottriyur Police on Saturday, June 22, 2024, arrested a 20-year-old for allegedly murdering his mother and his brother at their house on Wednesday.  The double murder only came to light only after two days, following the receipt of a WhatsApp message sent by the suspected murderer to a relative of the deceased.  The deceased have been identified as M. Padma, 45, who was an acupuncture therapist and her younger son M. Sanjay, 14, who was a class 10 student. Padma’s elder son M. Nithesh was studying at a city college. Her husband Murugan, worked as a crane operator in Oman while Padma stayed with her sons in Thirunagar First Street, Thiruvottriyur. Police sources said Padma’s niece Mahalakshmi received a WhatsApp message from her cousin Nithesh at 12.30 am on Saturday, stating that he had left his home after leaving his mobile phone and the key of the house in a bag near the house. She then went to his house and opened the door using the key. A foul smell emanated from the house, and she found the bodies of her aunt Padma and her other cousin Sanjay, their heads severed, and covered in plastic bags.  Mahalakshmi alerted the police control room. On receipt of information, police personnel from Thiruvottriyur station rushed to the spot and recovered the bodies and severed heads. Nithesh could not be traced. After sending the bodies to the Government Stanley Hospital for post-mortems, the police began an investigation.  Police quickly found and nabbed Nithesh who was sleeping on the beach in Thiruvottriyur on Saturday. He was taken to the police station and subjected to an interrogation. During the interrogation, police came to know that Nithesh had 14 arrears in his semester examinations and his mother had repeatedly scolded him for this.  At one point he had left home angry, but later, his friends had reunited him with his family. He reportedly told the police that his mother used to say his father’s earnings were not adequate to support the family and so, since he was constantly stressed, he was not able to perform well in college. He had believed that he would have to shoulder the responsibility of the family if his father’s earnings dwindled further. There was also other complications in the family and all of this, finally led him to murder his mother and his brother, he claimed. He had also decided to end his life later, he told police.  Police said that after the murders, he went with his friends to watch a film at a nearby theatre. He decided not to go ahead with his earlier plan to end his life out of to fear, and was just wandering around the beach, before he fell asleep and was found.  (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050)  Published - June 22, 2024 01:26 pm IST  Chennai / murder / family / police / crime "
    },
    {
      "title": "16-year-old domestic help found murdered at employer’s house in Chennai; police nabs six",
      "content": "A 16-year-old girl, who was engaged as a domestic aid by a businessman’s family was found dead at their house in Aminjikarai. After initial investigation, the police said it was a murder and that the girl had been tortured. Further investigation is on to establish who all are involved. The girl from Thanjavur was working at the rented house of Mohammed Nishad, 35, a businessman on Sadasivam Metha Street in Aminjikarai. She was under the care of her mother at her native after the demise of her father. She was brought to the city by two persons to be engaged in domestic work one and half years ago. On Friday, the house owner who came to know about the suspicious death alerted the police, who broke open the locked door of the house. The girl was found dead in the bathroom. The inmates of the house, including Mohammed Nishad, went missing. Aminjikarai Police registered a case and began an investigation after sending the body to Government Kilpauk Medical College Hospital for post-mortem. After intensifying the investigation, police picked up six persons including Nishad, his wife Nivetha alias Nasiya, 30, another couple who are their friends and frequently visited the house, and two others - a woman and her brother who helped the family engage the girl as domestic aid. Police said the body of the girl bore burn and strangulation marks. They said that on Deepavali day, she was tortured and beaten up by one of the suspects. She went into the bathroom and was lying motionless despite the family members’ repeated calls. On learning that she was dead, they locked the house and fled without informing anyone. One of them contacted a lawyer who, in turn, alerted the police.  They were staying at friends’ house from where the police nabbed them. Police said their probe ruled out any sexual assault on the girl. The National Federation of Indian Women condemned the alleged killing of the girl. It alleged that the girl collapsed due to the beating despite doing domestic chores properly on Deepavali day. It also wanted the police to conduct a thorough probe and get suitable punishment for the culprits.  Published - November 03, 2024 12:27 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Woman murders senior citizen in Perungudi railway station, arrested",
      "content": " The Thoraipakkam police arrested a 50-year-old woman for the murder of a 60-year-old resident of Kallukuttai on Saturday (August 17, 2024) night.  A senior officer of the city police said the victim C. Shankar, a construction worker residing in Thiruvalluvar nagar of Kallukuttai near Perungudi, used to sleep outside the Perungudi railway station. On Friday (August 16, 2024) night he had consumed liquor along with Muniyammal who also lived near the railway station.  On Saturday (August 17, 2024) morning, Muniyammal told the railway staff at the station that Shankar was not breathing and had left the place. Later, Thiruvanmiyur Government Railway police personnel visited the spot and found Shankar dead. After they sent his body to the Government Royapettah Hospital for post mortem it was found that he had been murdered.  After an investigation, police arrested Muniyammal on charges of killing the man. Police said she had been previously booked in a few cases of theft.  Published - August 18, 2024 02:58 pm IST  crime, law and justice / Chennai "
    },
    {
      "title": "Six-member gang arrested for murder of history-sheeter in Chennai",
      "content": "A six-member gang allegedly murdered a 33-year-old resident of New Washermenpet on Tuesday (January 14, 2025) night to avenge the killing of a history-sheeter.  The Fishing Harbour police, after registering a case, arrested the six people on Wednesday (January 15, 2025).  A senior official from the City Police said the deceased R. Ulaganathan lived with his wife Malathi at Thideer Nagar in New Washermenpet. He has several cases pending against him at the local police station on charges of smuggling narcotics, assault, and causing public nuisance.  The gang in question, led by Vallarasu, the son of another history-sheeter Desi alias Desingu, had a past enmity with Ulaganathan. Desi was murdered by a 10-member gang on April 24 last year, and Ulaganathan had given shelter to a few of the accused persons in Desi’s murder, including Gopi, Abhishek, and Venkatesh.  On Tuesday night, Vallarasu, along with five others, murdered Ulaganathan using deadly weapons, the police said. When his wife Malathi tried to stop the attack, she too was assaulted by the gang, inflicting serious injuries on her. The couple’s neighbours rushed them to the Government Stanley Hospital for treatment, but Ulaganathan died on the way. Malathi has been admitted to the intensive care unit (ICU) of the hospital.  The Washermanpet Police Deputy Commissioner formed a special task force to investigate the crime, and arrested the six persons, including Vallarasu. The others have been identified as: Anthony (who has a criminal record at Kasimedu police station), Ebenezer, Ezhilarasan, Manoj, and Gunasekar.   Published - January 15, 2025 11:51 am IST  crime / Chennai / murder "
    },
    {
      "title": "The toxic trail of syringe murders in Chennai",
      "content": "On April 27, Stephen (41), a Chennai-based businessman, was arrested on charges of murdering three persons in 2015 in three separate operations. According to police sources, what was striking about these murders was that he had administered a deadly injection to all three victims, with the help of his aides, through a novel method that made their deaths appear natural. It took the confession of his three aides, while they were being questioned by the police in connection with a burglary at Stephen’s house, to bring these murders to light. Stephen had removed the tip of an umbrella and made a provision for a syringe to be fitted in its place. He would fill the syringe with a deadly chemical, suspected to be potassium cyanide. Using this umbrella with a poisoned tip, his aides would gently inject the poison into a target. Nobody would know what was going on, not even the victim, who would die in ten minutes, after suffering a heart attack, police sources said. In this manner, Stephen had murdered two men, whose wives he was in relationships with, and also his brother-in-law. A recall While the report of these sensational murders was received with surprise by most of the city residents, for some, the case brought to mind a spate of Visha Oosi (poison injection) murders that rocked the city in the 1970s. These cases in the 1970s proved a challenge to the police; after they were cracked, these cases were established as case studies in the police academy. Seven people are said to have been murdered between December 1970 and October 1972, using poisoned syringes by a gang that included a drug store owner, T.V. Vaitheeswaran. According to the State Crime Branch, CID, which filed the chargesheet, Vaitheeswaran and his seven accomplices targeted persons coming into the city with large amounts of cash for business purposes. The victims included Vadivullan Chettlar of Karaikudi who was carrying Rs. 1.5 lakh, Shahul Hamll of Malaysia (Rs. 55,000), Buhan Thambi of Tirunellvelli district (Rs. 50,000), Siddique of Kayalpatnam (Rs. 60 000) and Mohammed Salai of Karaikal (Rs. 19.900). Thaika Thambi, the last victim, was murdered in October 1972. He was carrying 23 gold bits valued at Rs. 75.000. The eight, including Vaitheeswaran, were arrested and charged with conspiracy, abduction, robbery, drugging and murder. They gang members would posed as customs officers and under the pretext of interrogation, took them in a car to far-off places, drugged and murdered them on the way and took away their valuables. Their bodies were disposed of on the Tamil Nadu-Andhra border. The men are said to have injected pethedine into the victims after telling them it was a ‘truth serum’ used for investigation. The investigation was conducted under the supervision of Mr. S. Krishnaraj, Deputy Inspector-General of Police, CID and Mr. K. V. Gnanasambandam, Superintendent of Police, Crime Branch, CID. No connection However, police say Stephen, who committed the three murders with the umbrella fitted with a poisoned syringe, is unlikely to have been influenced by the cases from the 1970s. It is believed he chose the modus operandi after carrying out research on the internet. “He had tried different methods including using darts. Finally, he decided on using syringes,” said a senior police officer.  Published - April 30, 2016 08:46 am IST"
    },
    {
      "title": "Four murders reported in the suburbs of Chennai on Monday night",
      "content": "At least four murders and one more death suspected to be a murder were reported from the city’s suburbs on Monday night. The list of victims, included an autorickshaw driver in Tambaram, a lorry owner in Chromepet, a daily wager in Kundrathur, an elderly woman in Walajabad and a textile shop owner in Thirumullaivoyal. In Tambaram police limits, a 26-year-old history-sheeter driving an autorickshaw was hacked to death in Tambaram bus stand by five men, including an auto-stand union leader over rivalry in getting rides. Police sources said the deceased has been identified as Kathik Raja, 26, of Erikarai street, Irumbuliyur who was a history-sheeter. After 2018, he was not involved in any offence. He led a reformed life, married a woman and drove an autorickshaw for a living.  He had a running quarrel with one Anand who is an auto-union leader and a DMK functionary. Anand invited him for talks near the Tambaram bus stand. At 11.30 p.m., Karthik Raja and Anand reached the spot with their friends. While they were holding talks, things went south, a physical quarrel broke out. Anand and his associates hacked Karthik Raja to death using knives and then they fled the scene. The Tambaram Police recovered the body and arrested Anand, 40, and four others.  In Chromepet, a 50-year-old man was hacked to death following a quarrel that erupted over repayment of a loan he had given to one of his friends. The victim has been identified as Thomas, a resident of T.S.Lakshmanan Nagar, Chromepet. He owned a lorry and handled disposal of leather waste. He had lent ₹30,000 to Sabari, one of his friends, recently. As the former pestered the latter for repayment, a quarrel ensued.  On Monday night, Sabari invited Thomas near a temple on Thiruneermalai Salai, to repay the loan. When Thomas reached the spot, Sabari and others attacked him with knives even as they were talking. Thomas collapsed in a pool of blood and died on the spot. The Chromepet Police, after recovering the body, began an investigation and arrested Sabari.  A 65-year-old woman was found dead after strangulation in Kattavakkam village near Walajabad in Kancheepuram district. The victim has been identified as Suguna. She was living alone in her house after the demise of her husband while her sons lived in Tiruvallur district. Since she did not come out of the house on Tuesday and the house was locked outside, neighbours who grew suspicious, broke open the door and found her lying dead. Police suspected that unidentified persons must have entered the house on Monday night and strangled her. Gold jewellery, weighing eight sovereigns, was stolen. Police have launched an investigation to trace the suspects.  Another murder was reported from Thirumullaivoyal police limits on Monday night. A 48-year-old man, running a cloth store, was beaten to death by his brother-in-law. The victim has been identified as Gunasekaran, of Ravindran Nagar, Thirumullaivoyal, near Avadi. He visited his father-in-law’s house on Monday evening and scolded his brother-in-law Ganeshan, 52, for being unemployed. Both had a heated exchange of words. Irked over the rebuke, Ganeshan hit Gunasekaran with a wooden log. Gunasekaran, who was critically injured, died on the spot. Police arrested Ganeshan.  In Kundrathur police limits, a 30-year-old man died under suspicious circumstances, after a mild attack on Monday evening, by a bike-borne duo near Chembarambakkam lake, when they snatched his mobile phone. The victim has been identified as Rajesh, of Arcot, Villupuram district who had come with his family to work in a brick kiln in Therku Malayambakkam near Kundrathur to settle his loans. On Monday evening, when he had gone to the bank of Chembarambakkam lake to attend nature’s call, two men on a bike waylaid him and attempted to snatch his mobile phone. As he resisted their attempt, they hit him near his eyebrow, using the handle of a knife. He was treated in a private hospital. After returning home, he complained of chest pain and later died at a hospital without responding to the treatment. Police said the cause of death will be known only after receiving the post-mortem report. Police have registered a case of suspicious death and efforts are on to trace the suspects.   Published - May 28, 2024 09:29 pm IST"
    },
    {
      "title": "Chennai crime: Murder in Mylapore",
      "content": "An eerie silence envelops the duplex house, ‘Mahalakshmi’, at 19, Dwaraka Colony in Mylapore on Saturday morning, so eerie that it belies the rather tumultuous events that this house stood witness to recently. Only last week did the house witness betrayal, assault and murder, all at once, in a mystery plot that rivalled Arvind Adiga’s award-winning novel The White Tiger. The gruesome double murder of Mylapore made the headlines in the city, and while the speedy cracking of the case was impressive, the case threw up concerns of the elderly living alone in the city.  Srikanth | Photo Credit: SPECIAL ARRANGEMENT  The couple who lost their lives tragically were R. Srikanth, 58, a chartered accountant and president, corporate finance, of the Gujarat-based Infibeam Avenues Ltd, and his wife Anuradha, 53, an engineering graduate and home-maker. While this strange story of betrayal has its beginnings from a previous generation, the current sequence of events can be said to begin last November. It was then that the couple flew to California, U.S., to visit their daughter, Sunanda, 28, a postdoctoral research fellow and their son Sashwath, 25, a medical student. They continued to stay in the U.S. to assist in the delivery of their daughter, and their bungalow in Chennai remained locked.  After six months in the U.S., they returned to Chennai on May 7, Saturday. It was 3.40 a.m. when they landed at the Chennai airport. As soon as they landed, the couple sent a selfie through WhatsApp to their son informing him of arrival at the airport. Srikanth also told his son that he was waiting for customs clearance, and their part-time driver Padam Lal Krishna, or Krishna, was waiting outside with the car. That was the last the world heard from the couple, the police said. One hour later, Sashwath called his parents up on their mobile phones, but there was no response. He then called Krishna about 8.30 a.m. and asked him why his parents were not answering his calls, the latter claimed that the couple were sleeping and he had come out to have breakfast. He promised to tell Srikanth to call Sashwath when he went back home. Again when he was called at 9.15 a.m., Krishna replied that he had come out to buy vegetables. Sashwath called again at 10.15 a.m. and he responded that he had been asked to go to their farmhouse on ECR. Later, Krishna’s mobile phone was also switched off. Sunanda smelt a rat, and tried to check the CCTV feed of the house online, but found it offline, and she was also worried that her parents’ mobiles were still turned off, this was unusual for them. Not willing to wait any longer, at 10.45 a.m., Sunanda made an international call to the emergency number 112 and the call landed at the police control room.   Anuradha | Photo Credit: SPECIAL ARRANGEMENT  On receiving the alert from the control room, a mobile patrolling team reached the spot and knocked on the door and reported back that there was no response from inside. Meanwhile, Mylapore inspector M. Ravi and P. Ramesh from Zamin Pallavaram, who is a relative, also reached the spot. They broke open the main door and entered the house.  After a search, it became clear that the couple were not inside the house. The driver Krishna and their silver-coloured car (Innova) were missing. One suitcase was found in the hall and two boarding passes on the dining table. The police said the kitchen seemed to have been cleaned with a disinfectant, and another suitcase was open on the first floor. Sashwath said his parents had carried five suitcases in all, and three of them were missing. He asked his relatives to check the locker which reportedly contained gold ornaments, cash and other valuables. The locker was empty and they could not find anything inside the locker, the FIR said. The police said that at this point, suspicion fell on Krishna. Krishna was a Nepalese national who had been working for them on and off for a decade and staying at their farmhouse at Soolerikadu near Nemilichery. His father had been in the employ of the family too. Additional Commissioner (South) N. Kannan says, “We found things were disturbed in the house and cupboards were open. Our inspector informed us that the utility area seemed to be washed off and faint blood stains were visible. Initially, we suspected that it was a kidnapping and the couple might be harmed. We thought they might have been abducted and left tied up in the farmhouse.”  Immediately, special teams were formed to trace the suspect and the couple and they fanned out to several places, including the farmhouse and toll plazas in surrounding areas of the city.  The team which went to the farmhouse reported back that there was no one there. But they found the remains of a burnt mobile phone and a burnt cloth lying near what seemed like freshly dug soil. The police then started to suspect murder.  Chennai City Police Commissioner Shankar Jiwal said, “Our investigation started around noon with six special teams. Of them, one scrutinised CCTV footage and another looked at call detail records. We also checked whether the car used by the accused had a FASTag. We immediately alerted all toll gates in the State and the Andhra Pradesh police to keep a watch for Krishna. We alerted two routes up to Vijayawada and Vishakapatinam and tied with Andhra Pradesh’s Additional Director-General of Police Ravi Shankar Ayyanar. He alerted all Superintendents of Police in the State.”  Mr. Jiwal continues, “We saw some messages from FASTag that showed that the car was moving on a highway in Andhra Pradesh. Our teams rushed there. The Ongole police laid a trap at one of their toll plazas. They stopped the car and in under six hours we found the driver and the car, at around 5.40 p.m.”  Mr. Kannan says, “We nabbed the accused in a record time in Ongole, which is 300 kilometres away from the city, and brought the accused to the city. With him, was his associate Ravi Rai. Over 1,000 sovereigns and silver articles, looted from Srikanth’s house, were also brought back.”  Both Krishna and Ravi Rai, a native of Darjeeling, on being apprehended by the police, confessed to have plotted and murdered Srikanth and Anuradha. They led the police to the farmhouse and the pits they had dug to bury the bodies. The bodies were exhumed.  Further investigation disclosed a horror tale, one that began rather sedately nearly two decades ago.  Krishna’s father Padam Lal Sharma had lost his job in an amusement park 20 years ago, and Srikanth stepped in and gave Sharma’s family shelter at the farmhouse. Sharma and his four sons, Krishna among them, had worked as gardener and security guard of the farmhouse since then. Krishna also served as a part time-driver with an IIT professor, the police said, but stepped up every time Srikanth required him for tasks. From 2019, Krishna was appointed to look after Srikanth’s aged parents living at Dwaraka Colony.  As Krishna recounted the sequence of events to the police, the threads of a cold tale of pre-meditated murder for gain unravelled.  On the day of occurrence, after bringing Srikanth and Anuradha back home from the airport, Krishna on the sly opened the suitcase to check for valuables he could steal. Disappointed with that, Krishna and Ravi hit Srikanth on the head with the wooden handle of a shovel and stabbed him on the neck with a knife. This was on the ground floor. They then went over to the first floor where Anuradha fell to a similar attack.  Then, they washed off the blood that had splattered on the floor of the utility area on the ground floor and the first floor using disinfectant. They took a bunch of keys from Srikanth’s body and opened the locker. They looted the jewellery and silver articles that were kept in the locker and also used bed sheets to cover the bodies.  Then came the second part of the plot. They moved the bodies into the car, and also the loot. By dawn, they were on the way to the farmhouse on the ECR. There, they claimed they had placed the bodies in a sitting position in a pit dug a couple of days ago.  They then covered the pit with soil and placed boulders on top so as to keep away stray dogs from disturbing the area. Then they drove the car away, hoping to make it to Nepal, and safety, said the police. A senior officer said that during interrogation, Krishna said he wanted money and he had learnt that Srikanth had completed a real estate deal recently that made him richer by ₹40 crore. “My son is studying in Darjeeling and I needed the money for his education. I am 40 years old already, and have to work my entire life as a driver. I thought I should settle down once and for all,” Krishna told the police. The police later said Krishna was able to loot 1,000 sovereigns of gold and 60 kg of silver articles from the Mylapore bungalow. The accused believed that if they escaped to Nepal, they would never be caught.  The murder has created a sense of apprehension among elders living in the city all by themselves. Pennathur Subramaniam Prabakar, a long-time resident of Mylapore and correspondent of P.S. Senior Secondary School, says, “It has also made us question the basis of our support system — people who help us. Also, the lesson is that we should be careful while discussing financial matters when support staff are around. We need to store our valuables and jewellery in bank lockers, especially when we are away from home for long periods.”  Keeping to themselves, especially in upscale areas or buildings, may not be a great thing, says Edwin Babu, joint director programmes, Helpage, as this makes them more vulnerable. “There are local residents associations, or senior citizens forums that they can be part of so that the members check on each other periodically. Children who live abroad and have aged parents living by themselves in rural or urban areas should also make it a point to engage with their neighbours as well as relatives in the same city from time to time — there should be a reliable, safe network around them,” he adds. “Earlier, the policeman who used to visit our apartment, would sign a book — the senior citizens police point book — which would remain with the apartment. This ritual has been given a go-by for reasons best known to the authorities, and it would be helpful if it is brought back,” says V.S. Jayaraman, of the T.Nagar Residents Welfare Association. Mr. Jiwal explains the facilities available, “We are already running helplines for the elderly that cater to 10 to 12 people per day, on an average. Now we are planning to intensify the entire exercise with the introduction of WhatsApp numbers for three categories of people — elderly couples staying alone, single elderly persons staying alone and elderly folks staying with their children. This are numbers they can message if they want any assistance from the police like regular visit or volunteers from NGO for even small issues or medical assistance. They can register with us and we will help out depending on the need. Another service we are providing now, but is not used so much, is verification of antecedents of support staff. This year it is free, but from next year, it will be done on payment of a fee.”  Senior citizen helpline: 14567 Elders helpline: 1253  National emergency number: 112  Police control number: 100  (With inputs from S. Poorvaja)  Published - May 14, 2022 11:52 pm IST"
    },
    {
      "title": "Gang murders son of a panchayat president near Chennai",
      "content": " An unidentified gang murdered the son of a panchayat president near Sunguvarchathiram on August 5 night by throwing country-made bombs and killing him with knives.  A senior official of the Kancheepuram Police said Albert was the son of Kumudha Dominique, a Dravida Munnetra Kazhagam (DMK) leader and president of Echur village panchayat. On August 5 night, Albert was riding his two-wheeler in his locality when an unidentified gang of five persons threw a country-made bomb on him.  When Albert tried to escape, the gang chased and murdered him with deadly weapons. Albert having suffered knife injuries in the face and body, was killed on the spot. Albert was operating sewage tankers for some of the companies located in Sriperumbudur.  The Sunguvarchathiram police on being informed sent the body of Albert to Chengalpattu Government Hospital for post-mortem. The police have formed special police teams based on the direction of Kancheepuram Superintendent of Police Prabhakar to trace the culprits.   Published - August 06, 2023 11:43 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Beautician murdered by husband in Chennai",
      "content": "A 27-year-old beautician was murdered by her first husband in Medavakkam Koot Road junction on Saturday (January 11, 2025) night. The Medavakkam police have arrested the 42-year-old accused and are investigating.  A senior official of the Tambaram Police Commissionerate said K. Jyothi was married to R. Manikandan who was a resident of Triplicane and worked as a camera repair worker in 2009. The couple had three children. However due to differences of opinion Jyothi left Manikandan and started residing with her three sons in a rented house in Medavakkam. She was working in a beauty parlour in the same locality.  In this situation, she had a live-in relationship with Manikandan’s cousin Krishnamoorthy, police said. A few days ago, Manikandan contacted Jyothi on her cell phone and said he wanted to visit and see her children. Manikandan visited the children at Jyothi’s house and requested for rejoining, but Jyothi refused. Infuriated, Manikandan got into an argument, but Jyothi hit him and told him to get out of her house.  She narrated the incident to Krishnamurthy who contacted Manikandan on his cell phone and asked him to meet at the Medavakkam Koot Road junction. Manikandan came in his two-wheeler in an inebriated manner and on seeing both Krishnamurthy and Jyothi, he picked a knife kept hidden in his pocket and stabbed her. Krishnamurthy, who tried to stop him, was also stabbed. Jyothi who suffered blood injury died on the way to a nearby private hospital. Manikandan, who tried to escape after committing the crime, was caught by the public and handed over to the Medavakkam police.  The Medavakkam police sent the body to Chromepet Government Hospital for post-mortem and admitted Krishnamurthy in the Rajiv Gandhi Government General Hospital.  Published - January 12, 2025 03:42 pm IST"
    },
    {
      "title": "Murder of domestic help in Aminjikarai: Chennai Police arrest six persons",
      "content": "The Chennai city police on Sunday (November 3, 2024) said six persons, including two couples were arrested for the murder of a 16-year-old girl, who was engaged as a domestic help by a businessman’s family in Aminjikarai. She was physically tortured to death by the inmates of the house on the day of Deepavali alleging that she was not doing the work.  Police said that they received information from Sarbuddin, owner of the house located on the second floor of Eden Castle apartment in Metha Nagar, Aminjikarai, on Friday (November 1, 2024) about the suspicious death of the girl at the house owned by him.  Sarbuddin had rented out the house to Mohammed Nishad (35) and his family. Following the complaint, police recovered the body of the girl who was lying dead in the bathroom of the house under suspicious circumstances and the inmates of the house were missing from the house. Police began an investigation treating the death as suspicious and sent the body to Government Kilpauk Medical College Hospital for post-mortem.  On investigation, police identified that the girl was from Thanjavur. Her mother was not able to take care of the child at her native after the demise of her father. She was brought to the city by two persons to be engaged as the caretaker of a four-year-old child of Mohammed Nishad at the rented house in the apartment. She had been working since December 2023.  The preliminary report of post-mortem and investigation revealed that the girl’s body bore burn and injury marks indicating the physical cruelty meted out to her by the inmates of the house.  Police nabbed — Mohammed Nishad; his wife Nivetha alias Nasiya; their friends Lokesh and his wife Jayashakthi; Nishad’s sister Seema Begam (39) and Mageshwari (40); a domestic help of Lokesh — and interrogated them. “The investigation revealed that Mohammed Nishad, his wife and others had physically tortured the girl for the last three months as she was not able to do domestic chores properly,” the police said.  They attacked her on Deepavali day and it led to her death. Leaving her dead in the bathroom, they escaped from the house after locking it. One of them informed a lawyer who in turn alerted the house owner Sarbuddin and police.  After a lengthy interrogation, Aminjikarai police on Saturday night (November 2, 2024) arrested six persons — the two couples, Nishad’s sister Seema Begum and Lokesh’s domestic aid from Kovilambakkam — on charges of offences including murder. They were remanded to judicial custody.   Published - November 03, 2024 04:01 pm IST  Tamil Nadu / Chennai / murder / death "
    },
    {
      "title": "Woman’s body stuffed in suitcase, man arrested for murder in Chennai",
      "content": "The Thoraipakkam police have arrested a 22-year-old man for allegedly murdering a 35-year-old woman, whose body was found stuffed in a suitcase near a construction site in Chennai, Tamil Nadu, on Thursday (September 19, 2024).  A senior official of the City Police said the victim M. Vellaiyammal, alias Deepa, was a resident of Ponniamman Medu near Madhavaram in Chennai. She had gone missing two days ago, and her brother Veeramani had traced the location of her phone to Thoraipakkam in the city using a mobile application, the official said.  He rushed to Thoraipakkam and sought the help of a police patrol team on Wednesday (September 18, 2024) night, providing them with the details of his missing sister.  At around 6.30 a.m. on Thursday, a police patrol team came across a newly bought suitcase left unattended near a construction site at Kumaran Kudil Main Road, which branched off the Rajiv Gandhi Salai.  On closer examination, the team found blood stains on the suitcase. They then found the body of a woman in the suitcase, who was identified as Deepa.  During the investigation, the police officials found that the last call made on her phone was to M. Manikandan, a resident of Parthasarathy Nagar in Thoraipakkam.  Manikandan, who had befriended her through another person, had called Deepa over to his house. They later had a verbal altercation, after which he allegedly murdered her.  The Thoraipakkam police arrested Manikandan on Thursday. They sent Deepa’s body to the Government Royapettah Hospital for postmortem examination.   Published - September 19, 2024 04:04 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Chennai triple murder: man accused of sexually assaulting prime suspect, ends life",
      "content": " A 45-year-old man, on Tuesday ended his life, after the city police summoned him for an enquiry in connection with charges of sexual assault levelled against him by the prime accused in the Sowcarpet triple murder case .  The victim has been identified as Vijaykumar, 45, a nephew of Dileep Thalil Chand, a financier in Sowcarpet who was gunned down by a gang led by his daughter-in-law Jayamala on November 11. Police sources said Jayamala reportedly had accused her father-in-law Dileep Thalil Chand and his nephew Vijaykumar of sexually harassing her. The repeated harassment from them drove her to leave the home and later, she lived in Pune. As the family refused to meet her demands for compensation and filed a criminal case against her, she, accompanied by her two brothers and three more associates, shot Dileep Thalil Chand, his wife and his son at their house, police said.  Vijaykumar was summoned by a special team of police personnel to the Elephant Gate Station, where police have been investigating the triple murder case. On Tuesday morning, he ended his life at his apartment in R.K. Nagar. His body was recovered by police and further investigations are on.  On November 11 , Dileep Thalil Chand, 74, who ran a finance firm and his wife Pushpa Bhai, 68, and their son, Shithal Kumar, 42, natives of Rajasthan, were found dead in their house on Vinayaga Maestri Street in Sowcarpet. Police said they were shot at point blank range by the gang of suspects including a woman, who was their daughter-in-law, Jayamala. The family had an ongoing marital dispute with Jayamala who was from Pune. Jayamala had married Shithal Kumar, said to be of unsound mind, 10 years ago. The family had reportedly harassed Jayamala mentally and physically for a long time. After murdering them, the attackers escaped in two cars.  Two days later after travelling 800 km, a special team arrested three suspects -- Kalaish, 32, a brother of the prime accused Jayamala and associates -- Ravindranath Kher, 25, of Kolkata and Vijay Uttham Kamal, 28, of Pune in Solapur, Maharashtra. Kailash and another confessed to having shot the trio as Jayamala was continuously physically and mentally harassed by the members of the family. Last week, another special team which was searching for three more accused nabbed Jayamala, her brother Vikash and his associate Raju Shinde at a hideout near Agra. On Monday, police arrested Raju Dubey an ex-serviceman from Jaipur who allegedly supplied his licensed revolver and his car.  “Jayamala and others have been in judicial custody and will be taken into our custody. Further interrogations will be conducted soon,” said a senior police officer. (Those in distress may contact State’s health helpline 104 or Sneha’s suicide prevention helpline 044-24640050 for counselling)  Published - November 24, 2020 02:53 pm IST  Chennai "
    },
    {
      "title": "Masked man murders wedding hall owner in Chennai, injures other members of victim’s family",
      "content": "The Avadi City Police have launched a probe into the murder of a 65-year-old man who was the owner of a wedding hall in Annanur near Avadi.  According to police, an unidentified man wearing a mask, barged into the house of Madhavan 65, on the night of February 10, 2024, and attacked him using a knife. While he died on the spot, his wife, mother-in-law and daughter were critically injured when they attempted to fend off the attacker.  Three special teams of police have begun a search for the suspect, who is believed to have been behind other brutal attacks and murders over the past two days.  Police said Madhavan resided with his family on Thirukural Main Road, Sri Shakthi Nagar, Annanur. Madhavan retired as a mechanic from the Chennai Port Trust. He then ran a wedding hall, VSM Royal Mahal on the first floor of his house. After he became estranged with his first wife, he married Shyamala, 44. The couple had two daughters. Madhavan’s mother-in-law, Arumugammal, 75, was also staying with the family.  After the attack, the masked stranger made a quick escape through the back of the house. Arumugammal, who was bleeding, ran to the street and shouted for assistance. Neighbours alerted the police. On receipt of the information, police personnel from Thirumullaivoyal station reached the spot and sent the injured to the Government Kilpauk Medical College Hospital. The police also recovered the body of Madhavan and sent it to the hospital for a post-mortem.  Avadi Deputy Commissioner of Police Ayman Jamal, Assistant Commissioner of Police Anbalagan and other police officers conducted a preliminary investigation. A sniffer dog was pressed into service and forensics experts collected fingerprints and blood samples. Police also scrutinised the CCTV footage.  A senior police officer said, “We have certain clues and are working towards tracing the suspect.”   Published - February 12, 2024 12:53 pm IST  Chennai / crime / police / murder / investigation "
    },
    {
      "title": "24-year-old gaana singer murdered by girlfriend’s family near Chennai",
      "content": "A 24-year-old gaana singer was murdered, allegedly by the family members of a young woman with whom he was in relationship. The crime occurred in Perungalathur on Wednesday, January 31, 2024.  Police sources said the victim has been identified as Jeeva of Thiruvalluvar Street in Gundumedu village, Perungalathur. Jeeva used to sing at funerals. He belonged to a Scheduled Caste community. Jeeva had been in a relationship with a young woman from the same caste for the past two years. Her family however, did not approve of this and got her engaged to another man. Following this, Jeeva had gone to her house and picked up an argument with her family members, police said. On Thursday, village residents found Jeeva’s body near a graveyard in Gundumedu. His pet dog was also found dead, police said. An investigation revealed that the girl’s family attacked Jeeva with a machete and stones and killed him and his pet dog. The police have registered a case and are looking for those involved in the murder.  Published - February 02, 2024 11:38 am IST  Chennai / murder / police / crime, law and justice / Caste violence "
    },
    {
      "title": "Unravelling the plot behind gruesome double-murder that shook Chennai",
      "content": "More than a year has passed, but the murder of the couple who had just returned home from the U.S. is gruesome enough to linger on in public memory.  Srikanth, 58, a chartered accountant, and his wife Anuradha, 53, returned home at Mylapore on May 7, 2022, after spending six months in the U.S. In November 2021, they went to visit their daughter Sunanda, a postdoctoral research fellow in California, and their son Shaswath, 25, a medical student. They stayed on to assist in the delivery of their daughter. On May 7, they flew back and sent a picture of themselves disembarking at the Chennai airport to Shaswath, intimating him that the driver was waiting to pick them up. Thereafter, the couple went silent.  At 8.30 a.m., when Shaswath called on his father’s phone, the driver, Padam Lal Krishna, picked it up and said he had stepped out to pick up breakfast and the couple were sleeping. When he called up again at 9.15 a.m., Krishna said he had come out to buy vegetables. At 10.15 a.m., Krishna claimed Srikanth had asked him to go to their farmhouse near Mamallapuram. Later, Krishna’s mobile phone was switched off. In the U.S., Srikanth’s daughter Sunanda grew suspicious as she found the CCTV at home disconnected and the phones of her parents switched off. At 10.45 a.m., Sunanda decided that she had waited enough. She called up the police control room in Chennai.  A mobile patrol was sent to the spot, and the police entered the home by force after there was no response. One of their relatives, a prosecution witness, later deposed at the trial court, “A suitcase was found in the hall and two boarding passes were on the dining table... The kitchen seemed to have been cleaned with a disinfectant. Sashwath asked us to check the locker, which was empty. Their silver-coloured car [Innova] was missing.”  The needle of suspicion pointed to Krishna, a Nepali national working as a driver-cum-assistant for the couple on and off for a couple of years and staying at their farmhouse at Soolerikadu near Nemilichery. Initially, the police suspected that the couple could have been kidnapped from the house and kept at their farmhouse. However, the investigation took a turn, with sleuths spotting blood stains in the house and a burnt mobile phone and a burnt cloth lying near freshly dug soil at the farmhouse.  The police asked all toll plazas to watch out for the Innova. The car was spotted, and with the help of FASTag messages, the police narrowed it down to Andhra Pradesh. With the help of the Andhra Pradesh police, the car was stopped at a toll plaza near Ongole. The police arrested Krishna and his associate Ravi, a native of Darjeeling. The duo confessed to having murdered the couple for money and buried the bodies at the farmhouse. The police also recovered over 1,000 sovereigns of gold jewellery and silver articles stolen from Srikanth’s house. Krishna said he had planned the crime after overhearing Srikanth say that a lot of cash had been kept at home. The case is under trial before the IV Additional Sessions Court, which is examining the prosecution witnesses. The High Court directed the trial court to complete the trial in four months. The accused persons are in prison.   Published - August 15, 2023 11:08 pm IST"
    },
    {
      "title": "Man murdered in group clash in Chennai, six arrested within six hours",
      "content": "The Avadi City Police have arrested six men who were allegedly involved in a clash that resulted in the murder of a 24-year-old young man.  Police said that at around 10.30 p.m. on Monday, June 17, 2024, K. Ganeshan, 24, A. Karthikeyan, 19, and Vinodh, 24, of Thiruverkadu visited the mother of one of their friend in New Anna Nagar, Thirumullaivoyal, as she was unwell.  Follwoing the visit, the young men were talking to each other near the house of another person, B. Sadhasivam. Since they were creating a noise, Sadhasivam came out from his house and shouted at them, telling them not to make a noise near his house. He also asked them to disperse from there, which resulted in a heated argument. The trio threatened him by brandishing knives and left in a two-wheeler.  Angered over this, Sadhasivam decided to retaliate and called his family members to his assistance. Sadhasivam, along with his six associates, chased the trio on bikes and surrounded them. Both groups clashed and in the fight, Ganeshan, 24, of Thiruverkadu, was murdered.  Upon receipt of information, the Thirumullaivoyal police went to the scene of the clash and retrieved Ganehan’s body. After conducting an investigation, the police arrested Sadhasivam, 31, B. Selvam, 40, B. Velu, 36, A. Balakrishnan, 65, B. Anbalagan, 37, and Britto alias Peter, 44, within six hours of the murder.  Karthikeyan, 19, who was an associate of the deceased was sent to a hospital for treatment. Vinodh had fled the scene after the murder. The police have registered a case and further investigation are underway.   Published - June 18, 2024 01:29 pm IST  Chennai / murder / police / crime "
    },
    {
      "title": "Chennai crime: Murder in Mylapore",
      "content": "An eerie silence envelops the duplex house, ‘Mahalakshmi’, at 19, Dwaraka Colony in Mylapore on Saturday morning, so eerie that it belies the rather tumultuous events that this house stood witness to recently. Only last week did the house witness betrayal, assault and murder, all at once, in a mystery plot that rivalled Arvind Adiga’s award-winning novel The White Tiger. The gruesome double murder of Mylapore made the headlines in the city, and while the speedy cracking of the case was impressive, the case threw up concerns of the elderly living alone in the city.  Srikanth | Photo Credit: SPECIAL ARRANGEMENT  The couple who lost their lives tragically were R. Srikanth, 58, a chartered accountant and president, corporate finance, of the Gujarat-based Infibeam Avenues Ltd, and his wife Anuradha, 53, an engineering graduate and home-maker. While this strange story of betrayal has its beginnings from a previous generation, the current sequence of events can be said to begin last November. It was then that the couple flew to California, U.S., to visit their daughter, Sunanda, 28, a postdoctoral research fellow and their son Sashwath, 25, a medical student. They continued to stay in the U.S. to assist in the delivery of their daughter, and their bungalow in Chennai remained locked.  After six months in the U.S., they returned to Chennai on May 7, Saturday. It was 3.40 a.m. when they landed at the Chennai airport. As soon as they landed, the couple sent a selfie through WhatsApp to their son informing him of arrival at the airport. Srikanth also told his son that he was waiting for customs clearance, and their part-time driver Padam Lal Krishna, or Krishna, was waiting outside with the car. That was the last the world heard from the couple, the police said. One hour later, Sashwath called his parents up on their mobile phones, but there was no response. He then called Krishna about 8.30 a.m. and asked him why his parents were not answering his calls, the latter claimed that the couple were sleeping and he had come out to have breakfast. He promised to tell Srikanth to call Sashwath when he went back home. Again when he was called at 9.15 a.m., Krishna replied that he had come out to buy vegetables. Sashwath called again at 10.15 a.m. and he responded that he had been asked to go to their farmhouse on ECR. Later, Krishna’s mobile phone was also switched off. Sunanda smelt a rat, and tried to check the CCTV feed of the house online, but found it offline, and she was also worried that her parents’ mobiles were still turned off, this was unusual for them. Not willing to wait any longer, at 10.45 a.m., Sunanda made an international call to the emergency number 112 and the call landed at the police control room.   Anuradha | Photo Credit: SPECIAL ARRANGEMENT  On receiving the alert from the control room, a mobile patrolling team reached the spot and knocked on the door and reported back that there was no response from inside. Meanwhile, Mylapore inspector M. Ravi and P. Ramesh from Zamin Pallavaram, who is a relative, also reached the spot. They broke open the main door and entered the house.  After a search, it became clear that the couple were not inside the house. The driver Krishna and their silver-coloured car (Innova) were missing. One suitcase was found in the hall and two boarding passes on the dining table. The police said the kitchen seemed to have been cleaned with a disinfectant, and another suitcase was open on the first floor. Sashwath said his parents had carried five suitcases in all, and three of them were missing. He asked his relatives to check the locker which reportedly contained gold ornaments, cash and other valuables. The locker was empty and they could not find anything inside the locker, the FIR said. The police said that at this point, suspicion fell on Krishna. Krishna was a Nepalese national who had been working for them on and off for a decade and staying at their farmhouse at Soolerikadu near Nemilichery. His father had been in the employ of the family too. Additional Commissioner (South) N. Kannan says, “We found things were disturbed in the house and cupboards were open. Our inspector informed us that the utility area seemed to be washed off and faint blood stains were visible. Initially, we suspected that it was a kidnapping and the couple might be harmed. We thought they might have been abducted and left tied up in the farmhouse.”  Immediately, special teams were formed to trace the suspect and the couple and they fanned out to several places, including the farmhouse and toll plazas in surrounding areas of the city.  The team which went to the farmhouse reported back that there was no one there. But they found the remains of a burnt mobile phone and a burnt cloth lying near what seemed like freshly dug soil. The police then started to suspect murder.  Chennai City Police Commissioner Shankar Jiwal said, “Our investigation started around noon with six special teams. Of them, one scrutinised CCTV footage and another looked at call detail records. We also checked whether the car used by the accused had a FASTag. We immediately alerted all toll gates in the State and the Andhra Pradesh police to keep a watch for Krishna. We alerted two routes up to Vijayawada and Vishakapatinam and tied with Andhra Pradesh’s Additional Director-General of Police Ravi Shankar Ayyanar. He alerted all Superintendents of Police in the State.”  Mr. Jiwal continues, “We saw some messages from FASTag that showed that the car was moving on a highway in Andhra Pradesh. Our teams rushed there. The Ongole police laid a trap at one of their toll plazas. They stopped the car and in under six hours we found the driver and the car, at around 5.40 p.m.”  Mr. Kannan says, “We nabbed the accused in a record time in Ongole, which is 300 kilometres away from the city, and brought the accused to the city. With him, was his associate Ravi Rai. Over 1,000 sovereigns and silver articles, looted from Srikanth’s house, were also brought back.”  Both Krishna and Ravi Rai, a native of Darjeeling, on being apprehended by the police, confessed to have plotted and murdered Srikanth and Anuradha. They led the police to the farmhouse and the pits they had dug to bury the bodies. The bodies were exhumed.  Further investigation disclosed a horror tale, one that began rather sedately nearly two decades ago.  Krishna’s father Padam Lal Sharma had lost his job in an amusement park 20 years ago, and Srikanth stepped in and gave Sharma’s family shelter at the farmhouse. Sharma and his four sons, Krishna among them, had worked as gardener and security guard of the farmhouse since then. Krishna also served as a part time-driver with an IIT professor, the police said, but stepped up every time Srikanth required him for tasks. From 2019, Krishna was appointed to look after Srikanth’s aged parents living at Dwaraka Colony.  As Krishna recounted the sequence of events to the police, the threads of a cold tale of pre-meditated murder for gain unravelled.  On the day of occurrence, after bringing Srikanth and Anuradha back home from the airport, Krishna on the sly opened the suitcase to check for valuables he could steal. Disappointed with that, Krishna and Ravi hit Srikanth on the head with the wooden handle of a shovel and stabbed him on the neck with a knife. This was on the ground floor. They then went over to the first floor where Anuradha fell to a similar attack.  Then, they washed off the blood that had splattered on the floor of the utility area on the ground floor and the first floor using disinfectant. They took a bunch of keys from Srikanth’s body and opened the locker. They looted the jewellery and silver articles that were kept in the locker and also used bed sheets to cover the bodies.  Then came the second part of the plot. They moved the bodies into the car, and also the loot. By dawn, they were on the way to the farmhouse on the ECR. There, they claimed they had placed the bodies in a sitting position in a pit dug a couple of days ago.  They then covered the pit with soil and placed boulders on top so as to keep away stray dogs from disturbing the area. Then they drove the car away, hoping to make it to Nepal, and safety, said the police. A senior officer said that during interrogation, Krishna said he wanted money and he had learnt that Srikanth had completed a real estate deal recently that made him richer by ₹40 crore. “My son is studying in Darjeeling and I needed the money for his education. I am 40 years old already, and have to work my entire life as a driver. I thought I should settle down once and for all,” Krishna told the police. The police later said Krishna was able to loot 1,000 sovereigns of gold and 60 kg of silver articles from the Mylapore bungalow. The accused believed that if they escaped to Nepal, they would never be caught.  The murder has created a sense of apprehension among elders living in the city all by themselves. Pennathur Subramaniam Prabakar, a long-time resident of Mylapore and correspondent of P.S. Senior Secondary School, says, “It has also made us question the basis of our support system — people who help us. Also, the lesson is that we should be careful while discussing financial matters when support staff are around. We need to store our valuables and jewellery in bank lockers, especially when we are away from home for long periods.”  Keeping to themselves, especially in upscale areas or buildings, may not be a great thing, says Edwin Babu, joint director programmes, Helpage, as this makes them more vulnerable. “There are local residents associations, or senior citizens forums that they can be part of so that the members check on each other periodically. Children who live abroad and have aged parents living by themselves in rural or urban areas should also make it a point to engage with their neighbours as well as relatives in the same city from time to time — there should be a reliable, safe network around them,” he adds. “Earlier, the policeman who used to visit our apartment, would sign a book — the senior citizens police point book — which would remain with the apartment. This ritual has been given a go-by for reasons best known to the authorities, and it would be helpful if it is brought back,” says V.S. Jayaraman, of the T.Nagar Residents Welfare Association. Mr. Jiwal explains the facilities available, “We are already running helplines for the elderly that cater to 10 to 12 people per day, on an average. Now we are planning to intensify the entire exercise with the introduction of WhatsApp numbers for three categories of people — elderly couples staying alone, single elderly persons staying alone and elderly folks staying with their children. This are numbers they can message if they want any assistance from the police like regular visit or volunteers from NGO for even small issues or medical assistance. They can register with us and we will help out depending on the need. Another service we are providing now, but is not used so much, is verification of antecedents of support staff. This year it is free, but from next year, it will be done on payment of a fee.”  Senior citizen helpline: 14567 Elders helpline: 1253  National emergency number: 112  Police control number: 100  (With inputs from S. Poorvaja)  Published - May 14, 2022 11:52 pm IST"
    },
    {
      "title": "Gang murders son of a panchayat president near Chennai",
      "content": " An unidentified gang murdered the son of a panchayat president near Sunguvarchathiram on August 5 night by throwing country-made bombs and killing him with knives.  A senior official of the Kancheepuram Police said Albert was the son of Kumudha Dominique, a Dravida Munnetra Kazhagam (DMK) leader and president of Echur village panchayat. On August 5 night, Albert was riding his two-wheeler in his locality when an unidentified gang of five persons threw a country-made bomb on him.  When Albert tried to escape, the gang chased and murdered him with deadly weapons. Albert having suffered knife injuries in the face and body, was killed on the spot. Albert was operating sewage tankers for some of the companies located in Sriperumbudur.  The Sunguvarchathiram police on being informed sent the body of Albert to Chengalpattu Government Hospital for post-mortem. The police have formed special police teams based on the direction of Kancheepuram Superintendent of Police Prabhakar to trace the culprits.   Published - August 06, 2023 11:43 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Beautician murdered by husband in Chennai",
      "content": "A 27-year-old beautician was murdered by her first husband in Medavakkam Koot Road junction on Saturday (January 11, 2025) night. The Medavakkam police have arrested the 42-year-old accused and are investigating.  A senior official of the Tambaram Police Commissionerate said K. Jyothi was married to R. Manikandan who was a resident of Triplicane and worked as a camera repair worker in 2009. The couple had three children. However due to differences of opinion Jyothi left Manikandan and started residing with her three sons in a rented house in Medavakkam. She was working in a beauty parlour in the same locality.  In this situation, she had a live-in relationship with Manikandan’s cousin Krishnamoorthy, police said. A few days ago, Manikandan contacted Jyothi on her cell phone and said he wanted to visit and see her children. Manikandan visited the children at Jyothi’s house and requested for rejoining, but Jyothi refused. Infuriated, Manikandan got into an argument, but Jyothi hit him and told him to get out of her house.  She narrated the incident to Krishnamurthy who contacted Manikandan on his cell phone and asked him to meet at the Medavakkam Koot Road junction. Manikandan came in his two-wheeler in an inebriated manner and on seeing both Krishnamurthy and Jyothi, he picked a knife kept hidden in his pocket and stabbed her. Krishnamurthy, who tried to stop him, was also stabbed. Jyothi who suffered blood injury died on the way to a nearby private hospital. Manikandan, who tried to escape after committing the crime, was caught by the public and handed over to the Medavakkam police.  The Medavakkam police sent the body to Chromepet Government Hospital for post-mortem and admitted Krishnamurthy in the Rajiv Gandhi Government General Hospital.  Published - January 12, 2025 03:42 pm IST"
    },
    {
      "title": "Murder of domestic help in Aminjikarai: Chennai Police arrest six persons",
      "content": "The Chennai city police on Sunday (November 3, 2024) said six persons, including two couples were arrested for the murder of a 16-year-old girl, who was engaged as a domestic help by a businessman’s family in Aminjikarai. She was physically tortured to death by the inmates of the house on the day of Deepavali alleging that she was not doing the work.  Police said that they received information from Sarbuddin, owner of the house located on the second floor of Eden Castle apartment in Metha Nagar, Aminjikarai, on Friday (November 1, 2024) about the suspicious death of the girl at the house owned by him.  Sarbuddin had rented out the house to Mohammed Nishad (35) and his family. Following the complaint, police recovered the body of the girl who was lying dead in the bathroom of the house under suspicious circumstances and the inmates of the house were missing from the house. Police began an investigation treating the death as suspicious and sent the body to Government Kilpauk Medical College Hospital for post-mortem.  On investigation, police identified that the girl was from Thanjavur. Her mother was not able to take care of the child at her native after the demise of her father. She was brought to the city by two persons to be engaged as the caretaker of a four-year-old child of Mohammed Nishad at the rented house in the apartment. She had been working since December 2023.  The preliminary report of post-mortem and investigation revealed that the girl’s body bore burn and injury marks indicating the physical cruelty meted out to her by the inmates of the house.  Police nabbed — Mohammed Nishad; his wife Nivetha alias Nasiya; their friends Lokesh and his wife Jayashakthi; Nishad’s sister Seema Begam (39) and Mageshwari (40); a domestic help of Lokesh — and interrogated them. “The investigation revealed that Mohammed Nishad, his wife and others had physically tortured the girl for the last three months as she was not able to do domestic chores properly,” the police said.  They attacked her on Deepavali day and it led to her death. Leaving her dead in the bathroom, they escaped from the house after locking it. One of them informed a lawyer who in turn alerted the house owner Sarbuddin and police.  After a lengthy interrogation, Aminjikarai police on Saturday night (November 2, 2024) arrested six persons — the two couples, Nishad’s sister Seema Begum and Lokesh’s domestic aid from Kovilambakkam — on charges of offences including murder. They were remanded to judicial custody.   Published - November 03, 2024 04:01 pm IST  Tamil Nadu / Chennai / murder / death "
    },
    {
      "title": "Woman’s body stuffed in suitcase, man arrested for murder in Chennai",
      "content": "The Thoraipakkam police have arrested a 22-year-old man for allegedly murdering a 35-year-old woman, whose body was found stuffed in a suitcase near a construction site in Chennai, Tamil Nadu, on Thursday (September 19, 2024).  A senior official of the City Police said the victim M. Vellaiyammal, alias Deepa, was a resident of Ponniamman Medu near Madhavaram in Chennai. She had gone missing two days ago, and her brother Veeramani had traced the location of her phone to Thoraipakkam in the city using a mobile application, the official said.  He rushed to Thoraipakkam and sought the help of a police patrol team on Wednesday (September 18, 2024) night, providing them with the details of his missing sister.  At around 6.30 a.m. on Thursday, a police patrol team came across a newly bought suitcase left unattended near a construction site at Kumaran Kudil Main Road, which branched off the Rajiv Gandhi Salai.  On closer examination, the team found blood stains on the suitcase. They then found the body of a woman in the suitcase, who was identified as Deepa.  During the investigation, the police officials found that the last call made on her phone was to M. Manikandan, a resident of Parthasarathy Nagar in Thoraipakkam.  Manikandan, who had befriended her through another person, had called Deepa over to his house. They later had a verbal altercation, after which he allegedly murdered her.  The Thoraipakkam police arrested Manikandan on Thursday. They sent Deepa’s body to the Government Royapettah Hospital for postmortem examination.   Published - September 19, 2024 04:04 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Chennai triple murder: man accused of sexually assaulting prime suspect, ends life",
      "content": " A 45-year-old man, on Tuesday ended his life, after the city police summoned him for an enquiry in connection with charges of sexual assault levelled against him by the prime accused in the Sowcarpet triple murder case .  The victim has been identified as Vijaykumar, 45, a nephew of Dileep Thalil Chand, a financier in Sowcarpet who was gunned down by a gang led by his daughter-in-law Jayamala on November 11. Police sources said Jayamala reportedly had accused her father-in-law Dileep Thalil Chand and his nephew Vijaykumar of sexually harassing her. The repeated harassment from them drove her to leave the home and later, she lived in Pune. As the family refused to meet her demands for compensation and filed a criminal case against her, she, accompanied by her two brothers and three more associates, shot Dileep Thalil Chand, his wife and his son at their house, police said.  Vijaykumar was summoned by a special team of police personnel to the Elephant Gate Station, where police have been investigating the triple murder case. On Tuesday morning, he ended his life at his apartment in R.K. Nagar. His body was recovered by police and further investigations are on.  On November 11 , Dileep Thalil Chand, 74, who ran a finance firm and his wife Pushpa Bhai, 68, and their son, Shithal Kumar, 42, natives of Rajasthan, were found dead in their house on Vinayaga Maestri Street in Sowcarpet. Police said they were shot at point blank range by the gang of suspects including a woman, who was their daughter-in-law, Jayamala. The family had an ongoing marital dispute with Jayamala who was from Pune. Jayamala had married Shithal Kumar, said to be of unsound mind, 10 years ago. The family had reportedly harassed Jayamala mentally and physically for a long time. After murdering them, the attackers escaped in two cars.  Two days later after travelling 800 km, a special team arrested three suspects -- Kalaish, 32, a brother of the prime accused Jayamala and associates -- Ravindranath Kher, 25, of Kolkata and Vijay Uttham Kamal, 28, of Pune in Solapur, Maharashtra. Kailash and another confessed to having shot the trio as Jayamala was continuously physically and mentally harassed by the members of the family. Last week, another special team which was searching for three more accused nabbed Jayamala, her brother Vikash and his associate Raju Shinde at a hideout near Agra. On Monday, police arrested Raju Dubey an ex-serviceman from Jaipur who allegedly supplied his licensed revolver and his car.  “Jayamala and others have been in judicial custody and will be taken into our custody. Further interrogations will be conducted soon,” said a senior police officer. (Those in distress may contact State’s health helpline 104 or Sneha’s suicide prevention helpline 044-24640050 for counselling)  Published - November 24, 2020 02:53 pm IST  Chennai "
    },
    {
      "title": "Masked man murders wedding hall owner in Chennai, injures other members of victim’s family",
      "content": "The Avadi City Police have launched a probe into the murder of a 65-year-old man who was the owner of a wedding hall in Annanur near Avadi.  According to police, an unidentified man wearing a mask, barged into the house of Madhavan 65, on the night of February 10, 2024, and attacked him using a knife. While he died on the spot, his wife, mother-in-law and daughter were critically injured when they attempted to fend off the attacker.  Three special teams of police have begun a search for the suspect, who is believed to have been behind other brutal attacks and murders over the past two days.  Police said Madhavan resided with his family on Thirukural Main Road, Sri Shakthi Nagar, Annanur. Madhavan retired as a mechanic from the Chennai Port Trust. He then ran a wedding hall, VSM Royal Mahal on the first floor of his house. After he became estranged with his first wife, he married Shyamala, 44. The couple had two daughters. Madhavan’s mother-in-law, Arumugammal, 75, was also staying with the family.  After the attack, the masked stranger made a quick escape through the back of the house. Arumugammal, who was bleeding, ran to the street and shouted for assistance. Neighbours alerted the police. On receipt of the information, police personnel from Thirumullaivoyal station reached the spot and sent the injured to the Government Kilpauk Medical College Hospital. The police also recovered the body of Madhavan and sent it to the hospital for a post-mortem.  Avadi Deputy Commissioner of Police Ayman Jamal, Assistant Commissioner of Police Anbalagan and other police officers conducted a preliminary investigation. A sniffer dog was pressed into service and forensics experts collected fingerprints and blood samples. Police also scrutinised the CCTV footage.  A senior police officer said, “We have certain clues and are working towards tracing the suspect.”   Published - February 12, 2024 12:53 pm IST  Chennai / crime / police / murder / investigation "
    },
    {
      "title": "24-year-old gaana singer murdered by girlfriend’s family near Chennai",
      "content": "A 24-year-old gaana singer was murdered, allegedly by the family members of a young woman with whom he was in relationship. The crime occurred in Perungalathur on Wednesday, January 31, 2024.  Police sources said the victim has been identified as Jeeva of Thiruvalluvar Street in Gundumedu village, Perungalathur. Jeeva used to sing at funerals. He belonged to a Scheduled Caste community. Jeeva had been in a relationship with a young woman from the same caste for the past two years. Her family however, did not approve of this and got her engaged to another man. Following this, Jeeva had gone to her house and picked up an argument with her family members, police said. On Thursday, village residents found Jeeva’s body near a graveyard in Gundumedu. His pet dog was also found dead, police said. An investigation revealed that the girl’s family attacked Jeeva with a machete and stones and killed him and his pet dog. The police have registered a case and are looking for those involved in the murder.  Published - February 02, 2024 11:38 am IST  Chennai / murder / police / crime, law and justice / Caste violence "
    },
    {
      "title": "Unravelling the plot behind gruesome double-murder that shook Chennai",
      "content": "More than a year has passed, but the murder of the couple who had just returned home from the U.S. is gruesome enough to linger on in public memory.  Srikanth, 58, a chartered accountant, and his wife Anuradha, 53, returned home at Mylapore on May 7, 2022, after spending six months in the U.S. In November 2021, they went to visit their daughter Sunanda, a postdoctoral research fellow in California, and their son Shaswath, 25, a medical student. They stayed on to assist in the delivery of their daughter. On May 7, they flew back and sent a picture of themselves disembarking at the Chennai airport to Shaswath, intimating him that the driver was waiting to pick them up. Thereafter, the couple went silent.  At 8.30 a.m., when Shaswath called on his father’s phone, the driver, Padam Lal Krishna, picked it up and said he had stepped out to pick up breakfast and the couple were sleeping. When he called up again at 9.15 a.m., Krishna said he had come out to buy vegetables. At 10.15 a.m., Krishna claimed Srikanth had asked him to go to their farmhouse near Mamallapuram. Later, Krishna’s mobile phone was switched off. In the U.S., Srikanth’s daughter Sunanda grew suspicious as she found the CCTV at home disconnected and the phones of her parents switched off. At 10.45 a.m., Sunanda decided that she had waited enough. She called up the police control room in Chennai.  A mobile patrol was sent to the spot, and the police entered the home by force after there was no response. One of their relatives, a prosecution witness, later deposed at the trial court, “A suitcase was found in the hall and two boarding passes were on the dining table... The kitchen seemed to have been cleaned with a disinfectant. Sashwath asked us to check the locker, which was empty. Their silver-coloured car [Innova] was missing.”  The needle of suspicion pointed to Krishna, a Nepali national working as a driver-cum-assistant for the couple on and off for a couple of years and staying at their farmhouse at Soolerikadu near Nemilichery. Initially, the police suspected that the couple could have been kidnapped from the house and kept at their farmhouse. However, the investigation took a turn, with sleuths spotting blood stains in the house and a burnt mobile phone and a burnt cloth lying near freshly dug soil at the farmhouse.  The police asked all toll plazas to watch out for the Innova. The car was spotted, and with the help of FASTag messages, the police narrowed it down to Andhra Pradesh. With the help of the Andhra Pradesh police, the car was stopped at a toll plaza near Ongole. The police arrested Krishna and his associate Ravi, a native of Darjeeling. The duo confessed to having murdered the couple for money and buried the bodies at the farmhouse. The police also recovered over 1,000 sovereigns of gold jewellery and silver articles stolen from Srikanth’s house. Krishna said he had planned the crime after overhearing Srikanth say that a lot of cash had been kept at home. The case is under trial before the IV Additional Sessions Court, which is examining the prosecution witnesses. The High Court directed the trial court to complete the trial in four months. The accused persons are in prison.   Published - August 15, 2023 11:08 pm IST"
    },
    {
      "title": "Man murdered in group clash in Chennai, six arrested within six hours",
      "content": "The Avadi City Police have arrested six men who were allegedly involved in a clash that resulted in the murder of a 24-year-old young man.  Police said that at around 10.30 p.m. on Monday, June 17, 2024, K. Ganeshan, 24, A. Karthikeyan, 19, and Vinodh, 24, of Thiruverkadu visited the mother of one of their friend in New Anna Nagar, Thirumullaivoyal, as she was unwell.  Follwoing the visit, the young men were talking to each other near the house of another person, B. Sadhasivam. Since they were creating a noise, Sadhasivam came out from his house and shouted at them, telling them not to make a noise near his house. He also asked them to disperse from there, which resulted in a heated argument. The trio threatened him by brandishing knives and left in a two-wheeler.  Angered over this, Sadhasivam decided to retaliate and called his family members to his assistance. Sadhasivam, along with his six associates, chased the trio on bikes and surrounded them. Both groups clashed and in the fight, Ganeshan, 24, of Thiruverkadu, was murdered.  Upon receipt of information, the Thirumullaivoyal police went to the scene of the clash and retrieved Ganehan’s body. After conducting an investigation, the police arrested Sadhasivam, 31, B. Selvam, 40, B. Velu, 36, A. Balakrishnan, 65, B. Anbalagan, 37, and Britto alias Peter, 44, within six hours of the murder.  Karthikeyan, 19, who was an associate of the deceased was sent to a hospital for treatment. Vinodh had fled the scene after the murder. The police have registered a case and further investigation are underway.   Published - June 18, 2024 01:29 pm IST  Chennai / murder / police / crime "
    },
    {
      "title": "Man murders wife in north Chennai",
      "content": "A 44-year-old man murdered his wife by stabbing her with a kitchen knife at their house in Chinnamettupalayam, Kaladipet, in Tiruvottiyur of north Chennai on Tuesday. A marital dispute had led to the murder, the police said. According to the police, Ayurveda practioner Mohammad Raffiq (44), who is a native of Nagore town in Nagapattinam district, is also into witchcraft. Four months ago, Raffiq married R. Noorjahan (31), a native of Thrissur of Kerala, who he had got to know through a common friend, Akbar (34). As Raffiq was addicted to alcohol, the couple used to fight every day with Noorjahan trying to persuade him to stop drinking. He had often threatened to send her back to her native town and marry again, the police said. Recently, Raffiq told her to go back to Thrissur for some time and asked Akbar to take her there. On Monday, around 10 p.m., Raffiq had come home drunk and the couple quarrelled. Suddenly, Raffiq went to the kitchen, got a knife and stabbed her on the right side of her chest. Seeing Noorjahan lying in a pool of blood, Raffiq panicked and rushed her to Apollo Hospitals in Tondiarpet, where doctors declared her ‘brought dead’ around 1 a.m. on Tuesday. The body was sent to Government Stanley Hospital for post-mortem. A case of murder under section 302 of IPC has been registered by the Tiruvottiyur police. “Raffiq also had a case of molestation of a woman registered against him in the MKB Nagar police station in 2004,” said S. Prabu, inspector (crime), Tiruvottiyur police.  Published - September 25, 2013 10:22 am IST  Chennai / murder "
    },
    {
      "title": "Chennai youth murders girl friend, flees",
      "content": "A 22-year-old woman was murdered by her boyfriend in his apartment near Ayanavaram on Monday night. He fled when he was spotted shifting her body into a car in a bid to dump it. The chilling murder unfolded at the second floor flat of the suspect, Dinesh Kannappan (25), a bank employee, on Baraka Road in Nammalwarpet, where he is suspected to have fatally hit Aruna Srinivasan (22) of Choolai on the head using a flower vase. The victim was a Food Corporation of India employee. \"Dinesh spent the day with Aruna in the flat as his father was admitted to a private hospital with kidney problems and his family members were away. What led him to murder Aruna is uncertain,\" said an investigating officer. Around 10.30 p.m. Dinesh loaded Aruna's bedsheet-wrapped body into his hatchback and attempted to transport it but was spotted by a young resident who alerted the police. Dinesh fled the spot and abandoned the car with the body inside, minutes before police arrived. Aruna and Dinesh were in a relationship for the last three years and the reason for the murder is unknown, police sources added.  Published - March 10, 2015 11:43 am IST  Chennai / murder / investigation "
    },
    {
      "title": "Race Club official murdered in Chennai",
      "content": "Additional secretary of Madras Race Club S. Aruna was killed in a brutal attack by a former assistant security guard with a knife on the club premises at Guindy on Wednesday night. Police said the guard’s suspension from service last July and his failed attempts to get back the job provoked the killing. The 48-year-old victim, a long-serving office-bearer of the MRC, was walking towards her car after attending a committee meeting, following race day on Wednesday.  Speaking to The Hindu at the club few hours after the incident, an official said the attack took place around 7.45 p.m. near the stairs under the Bobbili Venkatagiri stand. “She was talking over her mobile phone when the ex-guard ex-guard Solamalai tripped her. He then pounced on her as she fell down and slit her throat. He continued attacking her and was muscled away by the guards on duty,” he added. He was handed over to the Guindy police and his weapon was seized.  Solamalai (33) and over 100 employees were suspended, allegedly by MRC office-bearers, including Aruna, following the murder of an Anna Nagar-based financier on last July 11, 2012 at the MRC parking lot. The guards joined the syces’ union of the club and staged protests to get back their jobs, but the management was reluctant to reinstate them. A court case on the matter is pending. Guindy Police sources said Solamalai frequented the club even after he was ousted from the staff quarters as well. On Wednesday, he had slipped into the premises and waited for Aruna and attacked her after she came out of meeting which was attended by top members of the Club, sources added.  Published - August 15, 2013 09:12 am IST  Chennai / murder / crime, law and justice "
    },
    {
      "title": "Six persons held in connection with history-sheeter’s murder in Anna Nagar",
      "content": "The police apprehended six suspects for in connection with the murder of a history-sheeter and the assault on the mother of one of his accomplices in Anna Nagar.  The victim was identified as Robert alias Chinna Robert, 28, of Annai Sathya Nagar. He had criminal cases for murder and attempt to murder. At 6.15 p.m. on Thursday, a gang of men who came on bikes attacked him with knives and fled the spot. Neighbours rushed Robert to the Government Kilpauk Hospital, where the doctors declared him brought dead. Afterwards, the gang went to the house of an accomplice of Robert and attacked his mother.  The Anna Nagar police registered a case and launched an investigation. Sources said that a couple of years ago, Robert’s associate Gokul was murdered by one Logu due to previous enmity. Police suspect that Logu is also behind the murder of Robert.  On Thursday, police apprehended Logu and five others. Investigation is on.   Published - February 27, 2025 11:00 pm IST"
    },
    {
      "title": "Three arrested for murdering man with disability in Chennai",
      "content": "The Selaiyur police in Chennai have arrested three men on charges of murdering a 21-year-old man with speech impairment following a drunken brawl. The youth’s body was found in a vacant plot in Puthur near Selaiyur on Tuesday (December 31, 2024), with his head severed from the torso and arms and legs tied with a cloth. The deceased was identified as Surya, 21, of Indira Nagar, Selaiyur, who worked as an electrician. The police sent the body to Government General Hospital in Chromepet for postmortem examination.  After their investigation, the police on Wednesday arrested three suspects — K. Sabari Ganesan, 25, of Agaram Then, D. Ayyappan, 26, of Selaiyur, and N.Vijaya Prathap, 23, of Chromepet. The trio allegedly got into a drunken brawl with Surya. They took him to one of their houses in an auto, where he was allegedly beaten to death. Subsequently, they severed his head and dumped the body in the vacant land, the police said.  Published - January 02, 2025 04:48 pm IST  crime / murder / Chennai "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Murder victim’s partner arrested in Chennai",
      "content": "A day after he brutally murdered a college student and her younger brother in Madambakkam, the 24-year-old suspect U. Mukesh was arrested on Friday afternoon at Santhoshapuram. V. Sadurshini (19) and her brother V. Yukesh (11) were found dead at their home in Denupureeswarar Nagar Second Street in Madambakkam on Thursday evening. Investigations led police to suspect Mukesh, a graduate in hotel management and catering technology. Mukesh first met Sadurshini a couple of years ago. His younger brother and she were classmates at school. Sadurshini and Mukesh got into a relationship and in July, got married secretly. They had their marriage registered at a sub-registrar’s office in the city. Sadurshini’s parents filed a ‘girl missing’ complaint at Selaiyur police station and soon, the girl was brought back to her home in Madambakkam. Later, Sadurshini told Mukesh that she had made a mistake and did not want to live with him. She joined B.Com at a private college in Pallavaram and Mukesh, who had joined M.Sc in hotel management, continued to pursue Sadurshini, who begged him to leave her alone. However, Mukesh persisted and on Thursday, he picked up a hammer and a long and heavy kitchen knife, packed it in his bag and went to her house. He created a scene and when Yukesh resisted, hit him on the head with the hammer. Sadurshini, who rushed out of her room, was hit and then slashed all over her head, face and neck with the knife. Mukesh then escaped on his motorcycle. He was planning to leave Chennai by Friday afternoon when he was arrested, said police. Mukesh was later remanded in judicial custody.  Published - September 21, 2013 08:04 am IST  Chennai / murder / police "
    },
    {
      "title": "Man murders partner in Chennai",
      "content": "A 22-year-old drunk man assaulted his partner at their home on Tuesday morning, injuring her badly in the abdomen. She died at a hospital a few hours later. Vepery police said the victim Velankanni (34) was in a live-in relationship with her partner Karthik, a loadman and a resident of Stringer Street in Vepery. The two had separated from their respective families and had been residing at Karthik’s house for the past three months. Police said Karthik was an alcoholic and often quarrelled with Velankanni, demanding she give him money to support his habit. On Tuesday morning, they had an argument following which Karthik assaulted her, hitting her head and kicking her stomach. Velankanni was badly injured and neighbours rushed her to Rajiv Gandhi Government General Hospital where she succumbed around 1 p.m. Vepery police registered a case of murder and arrested Karthik.  Published - September 11, 2013 08:45 am IST  Chennai / murder "
    },
    {
      "title": "Young boxer hacked to death in Chennai; nine persons arrested",
      "content": "A 24-year-old boxer was brutally hacked to death by a gang late Wednesday (January 30, 2025) night in Triplicane allegedly over past enmity. The boxer’s friend who attempted to intervene suffered injuries. The Ice House Police have arrested nine suspects in connection with the murder and assault. The deceased, identified as Dhanush, 24, was a resident of Rajajinagar, Krishnammal Pettai, Triplicane. The son of Rajesh and Radha, he had won several medals in boxing competitions and had been preparing for the police recruitment exam. According to sources, Dhanush had had altercations with a group of youngsters over trivial issues in the past, with cases registered against him. This had reportedly affected his chances of joining the police force. On Wednesday night, when he was walking in his neighbourhood, an armed gang ambushed him and attacked him with knives. Despite his attempts to flee, the assailants overpowered him. His friend Arun who attempted to rescue him was also attacked, sustaining a neck injury. Dhanush died on the spot, while Arun was rushed to Government Royapettah Hospital for treatment. The Ice House police recovered Dhanush’s body and launched an investigation. At least nine men have been taken into custody for questioning. Further inquiries are underway.   Published - January 30, 2025 03:00 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Armstrong murder Part 1: There’s more to it than meets the eye\nPremium",
      "content": "This is Part 1 of a three-part series on the crime that shook the State, and is based on the 5,000-page charge sheet filed by the police in October 2024, exclusively accessed by R. Sivaraman. You can read Parts 2 and 3 here and here.  Dusk had fallen on July 5, 2024, when Bahujan Samaj Party (BSP) Tamil Nadu president K. Armstrong was inspecting his 2,400-square foot plot on a narrow Venugopalaswamy Koil Street at Perambur, where the foundation was being laid for his new house. He was chatting with a few people at the site, located close to his relatives’ houses and the BSP office.  Around 7 p.m., eight persons — four of whom were clad in the uniform of a food delivery platform — arrived at the spot on two-wheelers, one after another. Before Armstrong could sense the lurking danger, the gang swiftly and indiscriminately attacked him with machetes and knives. Unarmed and unguarded, Armstrong tried to shield himself by raising his hands. He, however, slumped to the ground and thereafter, he was stabbed at least 31 times. His brother K. Veeramani, who was nearby, rushed to his rescue, but was hit on the head by the assailants. Armstrong’s driver sustained cuts to the back of his shoulders.  Two others were also injured as they tried to stop the attack. The eight-member gang escaped from the narrow lane on two-wheelers by brandishing weapons at people who had gathered by then. The critically injured were taken to Apollo Hospitals on Greams Road. But Armstrong died on the way.  Later that night, the eight alleged assailants walked into a police station at Anna Nagar in an act of surrender. They said they were related to a gangster in north Chennai, ‘Arcot’ Suresh, who was killed last year, and that they had murdered Armstrong for revenge as they believed that he was responsible for the death of Suresh. They were V. Ponnai Balu, 39; G. Arul, 32; K. Manivannan, 25; K. Thiruvengatam, 33; D. Ramu, 38; J. Santhosh, 22; S. Thirumalai, 45; and D. Selvaraj, 48.  The Sembium police opened an investigation into Armstrong’s murder based on Mr. Veeramani’s complaint and were quick to rule out a political angle in the case. But as the investigation progressed, the confessions of those who had surrendered did not add up.  Cut to today. Greater Chennai Police Commissioner A. Arun and his special teams have arrested 27 persons, including members of the Congress, the AIADMK, the BJP, and the Tamil Manila Congress, for complicity in the murder. Gang leaders P. Nagendran and ‘Sambav’ Senthil have been named as the accused no. 1 and 2. Voluminous materials, including documentary evidence and witnesses, have been cited in the final 5,000-page charge sheet, which was recently submitted to a jurisdictional magistrate court. The Hindu has exclusively accessed the final charge sheet, which brings together the several strands in this investigation. Armstrong was a prominent Dalit leader and his murder triggered a furore in Tamil Nadu. When his body was brought from Apollo Hospitals to the Rajiv Gandhi Government General Hospital for a post-mortem, his supporters staged a road roko condemning the killing. Armstrong’s social and political influence in Tamil Nadu, especially in Chennai, has been towering, though electorally speaking, the BSP has had limited influence in the State. An Ambedkarite Buddhist, Armstrong grew up in Perambur in north Chennai. He was the ninth child of his family that migrated to the area from Tiruvallur district. Growing up, he set his sights on a job in the Railways, but soon developed a liking for participating in amateur boxing events in north Chennai. He was associated with several Dalit leaders in his area and quickly grew as a striking figure in north Chennai and certain parts of north Tamil Nadu, where his influence extended beyond politics and local affairs.  Armstrong entered politics while obtaining an LLB degree from Sri Venkateswara University in Tirupati. He practised law in Chennai courts and he successfully contested as an Independent candidate in the Chennai Municipal Corporation elections in 2006. He was elected from a ward in north Chennai as councillor. Subsequently, he joined the BSP and was made its State president in 2007. He was once labelled a history-sheeter by the Chennai City Police; his name figured in at least six criminal cases. He was either discharged or acquitted in all of them. As his influence grew, Armstrong became a man of several enemies. He was often seen guarded or moving with a crowd. On the evening of July 5, however, he was not.  It was the conspirators’ agenda to make the murder of Armstrong look like a crime committed by a group of low-key criminals to avenge the murder of ‘Arcot’ Suresh, a senior officer of the Greater Chennai Police told The Hindu. They thought that once the suspects surrendered immediately after the crime, the police would not investigate further. “But we unearthed the whole network and their conspiracy,” the officer said. According to the charge sheet, some of Armstrong’s rivals joined hands to hatch a conspiracy to murder him. While one gang in the city brought them all together, another supplied the money and the arms. Yet another gang executed the killing when the BSP leader was unguarded.  The story, therefore, does not begin with ‘Arcot’ Suresh or his murder; it inevitably starts with the accused no. 1 in the charge sheet, P. Nagendran. Nagendran, 54, of Sathyiamurthi Nagar at Vyasarpadi has been serving a prison sentence for the past 25 years. He is lodged at Vellore Central Prison. He was jailed after being convicted in the murder of AIADMK worker Stanley Shanmugam in 1997 at Vyasarpadi. Known among the police as a gangster who once ruled north Chennai, he was once respected by none other than Armstrong, who would call him Periyavar (The elder). But, over time, with Nagendran’s arrest and Armstrong’s subsequent rise as a key political figure, there was a shift in their power dynamics. Nagendran’s son N. Aswathaman has been named the accused no. 3. An advocate and former Congress functionary (who was expelled by the party after his arrest), he was also allegedly involved in criminal activities, according to the charge sheet. In recent years, the father-son duo grew increasingly hostile towards Armstrong owing to his frequent interference in their “businesses”.  One such was the murder of A. Thennarasu, secretary of the BSP North Chennai unit. A close associate of Armstrong, Thennarasu was accused of at least three murders and named in a dozen other criminal cases. In February 2015, when Thennarasu emerged from a marriage hall at Thamaraipakkam near Vengal, he was allegedly murdered by the gang of ‘Arcot’ Suresh at the instigation of Nagendran. The Tiruvallur police started an investigation; but BSP workers, directed by Armstrong, conducted a series of protests demanding a CBI probe into the murder. The case was transferred to the CB-CID, Tiruvallur. Nagendran was named the prime accused and formally arrested. By then, Nagendran’s prison term in the case of murder of Stanley Shanmugam had expired, but he had to remain in jail.  In January last year, Armstrong reportedly got in the way of the father and son yet again when Aswathaman allegedly attempted to steal land from an advocate named T. Sekar, who, on behalf of a builder, had been developing 150 acres near Sholavaram to sell. Aswathaman and his men reportedly forcibly entered the land and allegedly threatened Sekar to give them 10 acres. As Sekar refused to do so, Nagendran, who had had a liver transplant earlier and had come down to a private hospital in Chennai from the prison on February 22, 2023, got hold of a mobile phone and allegedly called him up and threatened him. At the insistence of Armstrong, Sekar lodged a complaint with the police.  An apprehensive Aswathaman, who wished to contest the 2024 Lok Sabha election as a Congress candidate, decided to back down, fearing a case would affect his political prospects. At ‘compromise’ talks held at the office of an advocate, Armstrong intervened and forced Aswathaman to apologise. Sekar then withdrew the complaint.  Aswathaman allegedly held Armstrong responsible for scuttling his political career. The father-son duo made it known overtly that they would go to any extent to get back at Armstrong. But there were others who wanted to settle scores too. Senthil Kumaran, also known as ‘Sambav’ Senthil, has been named as the accused no. 2 in the case.  The 48-year-old, who hails from Tondiarpet, has a law degree, but is known to run katta panchayats or kangaroo courts in Chennai. An expert at chalking out plans and sending hirelings to murder or attack someone, Senthil, in the words of the police, is one of the “most notorious and wanted gangsters” in the city. However, he is learnt to have been operating out of foreign soil through internet calls to his men in Chennai. He has now been removed from the bar council’s roster and barred from practising law.  The police say Senthil’s feud with Armstrong began as Armstrong’s men refused to vacate a house bought by his mother Rajeshwari at A.K. Swami Nagar, Kilpauk, in 2005. Armstrong’s associates were running K.V.S. Sat TV, a cable television agency, on the said premises. A dispute arose between the two parties, and Armstrong’s men agreed to vacate the premises only after “extorting” ₹12 lakh from Senthil. Besides their enmity towards Armstrong, Senthil and Nagendran had a common link: a remand prisoner at the Coimbatore Central Jail named Raja, who worked for Senthil. Raja, an accused in an idol smuggling case, and Nagendran were lodged at the same prison a few years ago. The police would later discover that this link was significant as it brought together Nagendran and Senthil. Senthil allegedly executed several plans, including Armstrong’s murder, drawn up by Nagendran from the prison.  On August 18, 2023, Armstrong’s aide Ottrai Kann Jayapal and his associates allegedly hacked ‘Arcot’ Suresh, 48, to death on Loop Road at Pattinapakkam. This was allegedly in revenge for the murder of Thennarasu near Vengal in 2015. When Suresh was murdered, Armstrong was said to be present in a car nearby, the police said. However, he was not named in the case. Believing that Armstrong was responsible for the murder of Suresh, his brother ‘Ponnai’ Balu, of Ponnai village in Ranipet district, sought revenge. He joined hands with his friends and relatives, including G. Arul, of Thirunindravur, a relative of Suresh and an advocate. Six others, who claimed to be furious over Suresh’s death, joined Balu and Arul. Word quickly spread that a plan to murder Armstrong was afoot, and when Aswathaman got to know of it, he realised that it was time to get back at the BSP leader.  Arul, who was told that Aswathaman and Nagendran wanted Armstrong murdered, spoke to Aswathaman on the phone on April 1, and again on 8.  The plot quickly thickened over the next few weeks.  Part 2: The unravelling of the murder plot (Collated by S. Meenakshy)  Published - November 02, 2024 12:54 am IST  murder "
    },
    {
      "title": "7 days, 9 murders: is Chennai safe?",
      "content": "Nine murders, including four for gain, in the last one week alone have sent shockwaves among residents of the city. Is this city safe anymore, residents wonder, and question the efficacy of policing. Four cases have been cracked with the suspects behind bars while the rest are believed to be the work of acquaintances of the victims, who committed the crimes for gold and cash, police say. On Friday evening, homemaker Manju Devi (48) was found lying in a pool of blood in the kitchen of her first-floor home in Kalathiappa Street, Choolai. The house was ransacked and gold jewellery and other valuables were missing. “We have obtained CCTV footage in which a man is seen arriving outside Devi’s building on a Scooty in the evening. He seems calm and knows his way into the house. He is clearly a family member. We are probing the lead,” said an investigating officer. However, the murder of the woman in a densely-populated neighbourhood has left residents deeply unhappy with the way the police are going about maintaining law and order. “If policing was effective, there would not be such crimes, and cases wouldn’t need to be resolved,” a resident said. In the Kolathur murder of G. Hemavathi (49) on Thursday afternoon, police suspect the hand of a close relative who is believed to have slit her throat at her flat on Girija Nagar 5 Cross Street. She lay unconscious and bled profusely in the drawing room before a neighbour spotted her and rushed her to a hospital where she succumbed to her injuries. “The suspect had dined with her at home and they seem to have had an argument after he demanded money, leading to her murder. We have identified the man and a search is underway to nab him,” added an officer with the Kolathur police. On November 15, Chennaiites woke up to the shocking story of the murder of a woman and her six-year-old son and the death of a medical representative in Manadi. In both the murders, police are yet to apprehend the suspects who are said to have committed the killings over personal enmity. However, police have cracked the murder of octogenarian S. Veliappan in Choolaimedu on Tuesday afternoon. The culprits are a gang of youths who attempted to snatch the ornaments he was wearing, police said. Suspect Vinod alias ‘Pambu’ Vinod (25) of Pudupet who often hung out near the elderly man’s home joined hands with a teenager and another youth to pocket the gold but ended up stabbing the 87-year-old to death. Vinod and the teenager were apprehended on Friday night. Their aide is on the run.  Published - November 23, 2014 01:20 am IST"
    },
    {
      "title": "Woman ends life, months after her husband was murdered in Pallikaranai",
      "content": "A 22-year-old woman ended her life on Monday night, a few months after her husband was hacked to death in a suspected honour killing, in Pallikaranai.  The victim was identified as Sharmila, 22, who had married Praveen, 26, a mechanic and a Dalit residing at Ambedkar Street in Pallikaranai. Praveen, later, got employed at a call centre. He and Sharmila, who was a BBA graduate from Jalladianpettai and belonging to other backward castes, fell in love. Since the parents of the girl were opposed to the marriage owing to their caste differences, Sharmila and Praveen had a self-respect marriage which they later got registered duly. Praveen brought her to his house and they started living there.  On noticing Praveen walking alone near a Tasmac outlet in Pallikaranai on February 23, Sharmila’s brother Dinesh and four of his friends, waylaid him and hacked him to death using knives. The Pallikaranai police registered a case in connection with the murder and arrested Dinesh, 24, and his associates — Sriram, 18, Jothlingam, 25, Vishnuraj, 25, and Stephankumar, 24.  Subsequently, Sharmila demanded that her parents and another brother be also arrested, since they were responsible as well, for the murder of her husband. Under such circumstances, on April 14, Sharmila attempted to end her life. She was admitted to a private hospital in Pallikaranai and later referred to Rajiv Gandhi Government General Hospital where she died without responding to the treatment on Monday night.  G. Chitra, Praveen’s mother, in a written complaint to the Tambaram Police Commissioner, alleged that her daughter-in law Sharmila attempted to end her life, because the police failed to add her parents’ and her elder brother’s names to the charge-sheet. She also alleged that the police were supporting Sharmila’s family and that it caused great distress to Sharmila.  However, the police have denied the allegations. The Pallikaranai police have registered a case over the death of Sharmila and a probe is on.  (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050.)   Published - April 23, 2024 10:25 pm IST"
    },
    {
      "title": "Chennai history-sheeter ‘Seizing’ Raja shot dead by police",
      "content": "History-sheeter N. Raja, alias ‘Seizing’ Raja, 52, who was caught in Andhra Pradesh on Sunday was shot dead by the Greater Chennai Police in the early hours of Monday. The police said they had to return the fire after he allegedly shot at them with a country weapon when he was taken to recover the weapon at a secluded place on Canal Bank Road at Akkarai on the East Coast Raod. This is third incident of a suspect being gunned down by the police in Chennai since July.  Raja was an A+ category history-sheeter in the records of the Chitlapakkam police station as he had 39 criminal cases pending against him at different police stations for offences, including six murder cases, four cases of possession of arms, three cases of abduction and one case of dacoity. He had been detained under the Goondas Act eight times. More than 10 non-bailable warrants were pending against him and he had also been declared as a proclaimed offender by a court in Chengalpattu.  Last August, The Velachery police registered a case against him for threatening a businessman at gunpoint and indulging in extortion. The police had been searching for him since then. Special teams, which were camping in Andhra Pradesh to trace suspects in other cases, got information that Raja was hiding in the area, and they shared the information with the Velachery police. One of the teams camping in Andhra Pradesh was asked to nab him. Following the instructions, a team secured him at a lodge at Rajampet, which is located between Cudappah and Renigunta, on Sunday morning. He was handed over to the investigation officer of Velachery on Sunday evening.   Policemen at the spot where the criminal ‘Seizing’ Raja was shot dead in an encounter in Akkarai on the East Coast Road in Chennai on Monday, September 23, 2024. | Photo Credit: B. Velankanni Raj  Talking to reporters, Joint Commissioner of Police, South, M.R. Sibi Chakravarthy said, “During interrogation, he was asked to show the place where he had hidden the weapon he had used for threatening the businessman. Raja took the police to two places, but the gun was not there. At the third place, he had hidden a country gun. Pretending to take the weapon from the ground, he suddenly opened fire at Adyar inspector Ilangani. The bullets missed him and instead hit the vehicle. The police said that in self-defence, Velachery inspector Vimal returned fire with his service weapon, and Raja fell down. He was rushed to a private hospital at Neelankarai where doctors declared him dead. The body was then shifted to Government Royapettah Hospital for post-mortem.  Mr. Sibi Chakravarthy said, “As per our investigation, he was not connected to the murder of BSP leader K. Armstrong (as was reported in the morning). The situation warranted retaliatIon by the police in self-defence. When there was a threat to the life of the inspector, there was no other option than to open fire. Our intention is to nab the accused and secure his conviction and punishment,” he said.  The police denied the charge of an extra-judicial killing. A senior officer said, “Our personnel caught the suspect in a lodge and duly informed a patrolling team of Andhra Pradesh. We brought him to the city and handed him over to the investigation officer and followed all procedures. He was taken to a different place for recovery of a weapon used in his last crime. That is when he opened fire from the gun and our personnel had to open fire in self-defence. After the death, a requisition was duly sent by us to the judicial authority to conduct an inquiry to find out the cause of death.”  Raja got the moniker ‘Seizing’ since he was working on motor parts at a two-wheeler mechanic shop at Chromepet. He gained notoriety when he and his associate Ramu murdered one Ramani at Palur, Chengalpattu district, in a dispute over selling illicit liquor in 2006. Two years later, he murdered one Nataraj near the Paranur toll plaza to avenge the killing of his associate Ramu. He was also involved in the murder of Sivili, alias Sivalingam, who had murdered his associate Viji at Rajamangalam.  Raja was involved in the twin murders of Chenna, alias Chenna Kesavalu, 43, of Pulianthope and advocate Bhagath Singh near the Poonamallee court premises in 2010. Chenna Kesavulu had threatened Anjalai, the second wife of history0sheeter Arcot Suresh, who was into usury. Since Raja was close to Arcot Suresh, he joined the gang which committed the double murders.  In 2015, he was involved in the murder of BSP functionary A. Thenarasu, who was an accused in at least three murders and more than a dozen other criminal cases, near Vengal in Thiruvallur district. Thennarasu was considered to be close to Armstrong.  On July 14, K. Thiruvenkadam, 33, a history-sheeter and one of the suspects arrested for the murder of Armstrong, was killed in the Puzhal police station limits. On September 18, history-sheeter ‘Kakkathoppu’ Balaji was gunned down by the police at a secluded place at Vyasarpadi.  EOM   Published - September 23, 2024 08:46 am IST  crime, law and justice / encounters / Chennai "
    },
    {
      "title": "Seven surrender in attempt to murder BJP functionary’s husband in Chennai",
      "content": "At least seven persons have surrendered before police in connection with an attempt to murder a BJP functionary’s husband in Thirumangalam and confessed that they committed to avenge the killing of one of their associates in Elephant Gate, 19 years ago.  The victim has been identified as Srinivasan, 47, who is the husband of S. Nathiya, general secretary of Tamil Nadu BJP’s Mahila Morcha. He is a resident of Thirumangalam. Police said on Friday (June 14) Srinivasan was on his way to his office in Choolaimedu on a two-wheeler. A gang rounded and attacked him. The gang fled in an autorickshaw leaving Srinivasan injured and bleeding, as a crowd started to gather. Srinivasan was rushed to a hospital where he is undergoing treatment. Police said that he sustained injuries on his head and other parts. Police bandobust deployed at the hospital. Thirumangalam Police registered a case and launched an investigation to trace the assailants.  However, on Saturday evening, police arrested seven suspects after their surrender. The arrested suspects have been identified as Prasanth, 27, Rajesh, 20, Ganesh, 40, Saravanan, 27, and three others - all are from Elephant gate. During interrogation, they confessed that they attempted to murder Srinivasan as he was involved in the murder of one Neduchezhian in 2005 in order to take revenge on him. They were planning to execute it for the last two years.  Police seized knives and mobile phones from them. The suspects were remanded to judicial custody after being produced in a court.   Published - June 17, 2024 04:02 pm IST  murder / crime "
    },
    {
      "title": "Chennai police arrest main suspect in Velachery businessman murder case",
      "content": "The city police on Saturday, March 30, 2024 cracked the murder case of a real estate businessman in Velachery by arresting the main suspect.  The victim V. Palanisamy, 60, was a real estate businessman. On Friday evening while Palanisamy was walking with his friend on Gandhi Road near Seva Nagar in Velachery, unidentified persons who came there on two-wheelers waylaid him. They attacked him with knives and fled.  Palanisamy, who was seriously injured in the attack, died on the way to the hospital. Based on the complaint, Taramani Police took up the investigation. On investigation, police arrested one suspect N. Subbaiyan, 68 of Paramakudi, Ramanathapuram. A knife and mobile phone were seized from him. The investigation revealed that Palanisamy had cheated ₹28 lakh from Subbaiyan after receiving it from him for buying land. He failed to return the money. Enraged by this, Subbaiyan along with his accomplices - all from Paramakudi had planned and murdered Palanisamy, police said.  Police said both accused and deceased were from Paramakudi. The deceased Palanisamy had also borrowed money from one Utthra Kumar in Paramakudi. He was staying in the city to evade the lender, said police.   Published - March 31, 2024 01:45 pm IST  crime / murder "
    },
    {
      "title": "Man murders wife inside police station in Chennai",
      "content": "A 23-year-old woman was murdered by her husband at the All Woman Police Station in Tambaram on Monday evening. Gowri (23) was assaulted by Ganapathy (26) with a screw driver at the waiting area of the police station. The duo had been summoned for counselling by the police as they used to quarrel often. Gowri, who had arrived before Ganapathy, was sitting in the waiting area. “Ganapathy barged into the police station, pulled out a screw driver he had concealed in his dress and assaulted his wife,” said a police officer. The screw driver pierced her chest, resulting in profuse bleeding. Hearing her cries for help, the women police at the station detained Ganapathy. They rushed Gowri to the Tambaram Taluk Government Hospital, where she was pronounced dead on arrival. Police sources said the couple had been married for about eight years and were living at Annai Sathya Nagar in Agaramthen under Selaiyur police station limits with their two children. They were working as contract labourers with the Tambaram Municipality. Police said Ganapathy suspected her to be having an affair and had even asked his friends to track her movement when was out of town. Recently, Gowri had gone missing from the house and this angered Ganapathy. “Gowri’s mother had lodged a missing complaint at the Selaiyur police station on Monday morning. Ganapathy too lodged a complaint at AWPS in Tambaram, seeking custody of his children,” an investigating police officer said. Further investigation is on.  Published - December 22, 2015 12:00 am IST"
    },
    {
      "title": "Man arrested for murder of pregnant woman in Chennai",
      "content": "The Sunguvarchatram police have arrested a 26-year-old man for allegedly murdering a 34-year-old woman, a relative of his. Police said he killed her as she was pregnant with his baby and refused to get an abortion.  The victim has been identified as Devi, a resident of Maduramangalam village near Sunguvarchatram in Kancheepuram district. She was married, and had a six-year-old child. She was working at a private firm in Sunguvarchatram and was also doing embroidery work on a part-time basis at a house in nearby Thirumangalam village. She had been having an affair with the man who murdered her, D. Ravi of Maduramangalam village. Last Thursday, June 6, 2024, when Devi did not return home from work, her husband Murugan, 40, lodged a complaint with the police seeking to trace her. On Saturday (June 8) morning, residents found a sewerage line choked in one of the streets in Thirumangalam. One resident tried to remove the blockage using a stick and found a piece of a saree. When he pulled at the saree, he saw part of a human body. The police recovered the body after breaking open the cement slab on the sewerage line. Devi’s husband Murugan identified the body.  After an investigation, the police nabbed Ravi, and following a sustained interrogation, he confessed to the crime.  Ravi said that on the night of June 6, when Devi was returning home, he waylaid her and asked her to have an abortion. When she refused, he smashed her head against a wall. She fell down, unconscious. He removed her thali and tied her legs and arms using her saree, and then dumped her body into the drain and fled the scene, said police sources  Ravi was arrested and remanded to judicial custody.   Published - June 10, 2024 04:04 pm IST  Chennai / police / murder / crime "
    },
    {
      "title": "Man murders father in Chennai",
      "content": "A 39-year-old man murdered his father by forcing bathroom acid down his throat at their residence in Kakkanji Nagar, Pattabiram. The Pattabiram police said early on Wednesday, the suspect Anthony, who is unemployed, had a heated argument with his father David (65), a retired OCF employee, over money matters. Enraged, Anthony got a bottle of acid from the bathroom and poured the contents into his father’s mouth after overpowering him. Hearing the cries of the elderly man, other family members and neighbours rushed him to Government Kilpauk Hospital where he died around 2 p.m. on Thursday. The Pattabiram police registered a case of murder and have launched a hunt for Anthony.  Published - September 13, 2013 08:15 am IST  Chennai / murder "
    },
    {
      "title": "Three men arrested in connection with double murder near Perungalathur",
      "content": "The police on Tuesday arrested three men in connection with the murder of two youth, whose bodies were found at a burial ground near Perungalathur in the city earlier in the day.  In the early hours of Tuesday, the police received information that two bodies were found with their heads severed at the burial ground in Gundumedu, near Perungalathur. Upon receipt of the information, police personnel from the Peerkankaranai police station rushed to the spot and recovered the bodies. Then, they began an investigation.  The police identified the victims as Annamalai, 23, and his associate Zilla alias Tamilarasan, 24, of Perungalathur. Both men, from New Perungalathur, were painters and were selling ganja to make a quick buck, the police said. They were in a feud with another group led by Sonu alias Gopalakrishnan and Arif, allegedly over selling ganja and painkiller tablets, the police said.  On Monday, Annamalai called Sonu’s wife over phone, made derogatory remarks about her, and threatened to kill her husband. She informed Sonu about this when he returned home.  Sonu contacted Annamalai and asked him to come to a spot in Gundumedu at midnight so they could talk and sort out their dispute. Then, he went with his friends Vijay and Arif in an autorickshaw to the place where Annamalai and at least 15 other persons were waiting. The groups held talks and reached an agreement.  Sonu and his associates returned home, after which they armed themselves with knives and iron rods from Sonu’s house and returned to the spot. They attacked Annamaalai and Tamilarasan with the weapons. They severed their heads and dumped the bodies at the burial ground.  An autorickshaw driver, who was present at the scene, lodged a complaint at the Peerkankaranai police station. After recovering the bodies, the police sent them to the Government Chengalpattu Hospital for a post-mortem. On Tuesday evening, the police arrested Sonu, Arif, and Vijay.   Published - July 02, 2024 01:56 pm IST  Chennai / crime / police / narcotics & drug trafficking / murder "
    },
    {
      "title": "Suspect in murder case taken into custody from Chennai",
      "content": "The police on Friday took into custody a 28-year-old Thrissur native from Chennai who was suspected of murdering a woman in a hotel room at Eranhipalam in Kozhikode. The suspect, identified as Abdul Sanoof of Talappilly, had fled the city on November 25. The police were in search of him after receiving the post-mortem report which revealed that suffocation was the cause of death. There was also a lookout notice against him. It was on November 26 that the body of the 33-year-old woman, identified as Faseela Panthalath, was found inside the hotel room. According to hotel records, Abdul Sanoof and Faseela had secured the room on November 24. The man reportedly left the spot the next day around 10 p.m. without informing the hotel staff. Police sources said the woman from Malappuram had come to Kozhikode in search of a job. The two were friends for over a year and the trigger behind the crime remained obscure, they added.  Published - November 30, 2024 01:31 am IST"
    },
    {
      "title": "Man found murdered near Chennai, police begin investigation",
      "content": "A 58-year-old resident of Vallur village near Minjur, was found murdered near his house on Monday.  According to a police officer at the Avadi Police Commissionerate, the victim Panchanathan, a contract employee working at a public sector oil company in Minjur, had slept at a vacant shop constructed outside his house on Sunday night. On Monday morning, his wife found him dead with his head smashed in. On receiving a complaint, a police team from Minjur station visited the crime spot and sent the body to the Government Stanley Hospital for a post-mortem.  Avadi Joint Police Commissioner P. Vijayakumar and other senior police officers also visited the crime scene and directed police personnel to find and apprehend the perpetrators.   Published - May 30, 2023 12:07 pm IST  Chennai / police / murder / crime "
    },
    {
      "title": "Chennai history-sheeter ‘Seizing’ Raja shot dead by police",
      "content": "History-sheeter N. Raja, alias ‘Seizing’ Raja, 52, who was caught in Andhra Pradesh on Sunday was shot dead by the Greater Chennai Police in the early hours of Monday. The police said they had to return the fire after he allegedly shot at them with a country weapon when he was taken to recover the weapon at a secluded place on Canal Bank Road at Akkarai on the East Coast Raod. This is third incident of a suspect being gunned down by the police in Chennai since July.  Raja was an A+ category history-sheeter in the records of the Chitlapakkam police station as he had 39 criminal cases pending against him at different police stations for offences, including six murder cases, four cases of possession of arms, three cases of abduction and one case of dacoity. He had been detained under the Goondas Act eight times. More than 10 non-bailable warrants were pending against him and he had also been declared as a proclaimed offender by a court in Chengalpattu.  Last August, The Velachery police registered a case against him for threatening a businessman at gunpoint and indulging in extortion. The police had been searching for him since then. Special teams, which were camping in Andhra Pradesh to trace suspects in other cases, got information that Raja was hiding in the area, and they shared the information with the Velachery police. One of the teams camping in Andhra Pradesh was asked to nab him. Following the instructions, a team secured him at a lodge at Rajampet, which is located between Cudappah and Renigunta, on Sunday morning. He was handed over to the investigation officer of Velachery on Sunday evening.   Policemen at the spot where the criminal ‘Seizing’ Raja was shot dead in an encounter in Akkarai on the East Coast Road in Chennai on Monday, September 23, 2024. | Photo Credit: B. Velankanni Raj  Talking to reporters, Joint Commissioner of Police, South, M.R. Sibi Chakravarthy said, “During interrogation, he was asked to show the place where he had hidden the weapon he had used for threatening the businessman. Raja took the police to two places, but the gun was not there. At the third place, he had hidden a country gun. Pretending to take the weapon from the ground, he suddenly opened fire at Adyar inspector Ilangani. The bullets missed him and instead hit the vehicle. The police said that in self-defence, Velachery inspector Vimal returned fire with his service weapon, and Raja fell down. He was rushed to a private hospital at Neelankarai where doctors declared him dead. The body was then shifted to Government Royapettah Hospital for post-mortem.  Mr. Sibi Chakravarthy said, “As per our investigation, he was not connected to the murder of BSP leader K. Armstrong (as was reported in the morning). The situation warranted retaliatIon by the police in self-defence. When there was a threat to the life of the inspector, there was no other option than to open fire. Our intention is to nab the accused and secure his conviction and punishment,” he said.  The police denied the charge of an extra-judicial killing. A senior officer said, “Our personnel caught the suspect in a lodge and duly informed a patrolling team of Andhra Pradesh. We brought him to the city and handed him over to the investigation officer and followed all procedures. He was taken to a different place for recovery of a weapon used in his last crime. That is when he opened fire from the gun and our personnel had to open fire in self-defence. After the death, a requisition was duly sent by us to the judicial authority to conduct an inquiry to find out the cause of death.”  Raja got the moniker ‘Seizing’ since he was working on motor parts at a two-wheeler mechanic shop at Chromepet. He gained notoriety when he and his associate Ramu murdered one Ramani at Palur, Chengalpattu district, in a dispute over selling illicit liquor in 2006. Two years later, he murdered one Nataraj near the Paranur toll plaza to avenge the killing of his associate Ramu. He was also involved in the murder of Sivili, alias Sivalingam, who had murdered his associate Viji at Rajamangalam.  Raja was involved in the twin murders of Chenna, alias Chenna Kesavalu, 43, of Pulianthope and advocate Bhagath Singh near the Poonamallee court premises in 2010. Chenna Kesavulu had threatened Anjalai, the second wife of history0sheeter Arcot Suresh, who was into usury. Since Raja was close to Arcot Suresh, he joined the gang which committed the double murders.  In 2015, he was involved in the murder of BSP functionary A. Thenarasu, who was an accused in at least three murders and more than a dozen other criminal cases, near Vengal in Thiruvallur district. Thennarasu was considered to be close to Armstrong.  On July 14, K. Thiruvenkadam, 33, a history-sheeter and one of the suspects arrested for the murder of Armstrong, was killed in the Puzhal police station limits. On September 18, history-sheeter ‘Kakkathoppu’ Balaji was gunned down by the police at a secluded place at Vyasarpadi.  EOM   Published - September 23, 2024 08:46 am IST  crime, law and justice / encounters / Chennai "
    },
    {
      "title": "Couple held for murdering 70-year-old neighbour in MGR Nagar",
      "content": "The MGR Nagar police have arrested a couple in connection with the murder of a 70-year-old woman in MGR Nagar in the city.  The police identified the victim as Vijaya of Sivamurthy Street in MGR Nagar. After Vijaya went missing on July 17, her daughter Loganayagi looked for her at several places and ultimately lodged a complaint with the MGR Nagar police on July 19.  During the course of the investigation, the police summoned Parthiban, 32, one of Vijaya’s neighbours, for an inquiry. However, Parthiban and his wife Sangeetha, 28, went into hiding. The police analysed their mobile phone signals and traced the couple to Virudhunagar. A special team of police apprehended the duo and brought them to the city.  The police said the couple were in financial trouble and learnt that Vijaya had a large sum of money at her home. They decided to steal the money. When Vijaya caught them in the act, they strangled her to death. They then stole a one-and-a-half-sovereign gold chain, earrings, and ₹20,000 in cash from her purse. They carried the body in a gunny bag on a bike and threw it into a canal under a bridge on Jones Road in Saidapet, the police said.  The police arrested Parthiban and Sangeetha and seized the gold ornaments, ₹8,000 cash , and a bike from them. The police recovered Vijaya’s body from the canal.   Published - July 28, 2024 12:39 pm IST  Chennai / murder / crime "
    },
    {
      "title": "A massacre that shook Chennai more than three decades ago\nPremium",
      "content": "On June 19, 1990, 15-20 men, armed with light machine guns and other automatic weapons, came in two cars around 7 p.m. to an apartment at Zackariah Colony in Kodambakkam. There, a large number of men from the Eelam People’s Revolutionary Liberation Front (EPRLF) and their families were staying for some time. Their leader K. Padmanabha and other prominent functionaries of the outfit were at an informal meeting in a flat on the second floor.  The armed men sprinted up the narrow staircase and stormed the flat. In the next four minutes, the militants of the Liberation Tigers of Tamil Eelam (LTTE) sprayed bullets into the EPRLF men and lobbed five grenades. Then, they came down, fired at some people standing on the road, and escaped. In all 15 persons — 14 of them EPRLF workers, including secretary-general K. Padmanabha and Finance Minister in the defunct North-Eastern Provincial Council P. Kirubakaran — were killed. Eight persons, including Padmanabha, were killed in the flat. Five others, including Ramesh, 28, of Choolaimedu, were gunned down on the road. K. Yogasangari, an EPRLF MP, and another activist, Mukundan, died of injuries at hospital, and 21 others, including a four-month-old boy, were injured.  It was a rude shock to Anandi, 30, wife of Padmanabha, when she returned from visiting her father nearby. The apartment looked like a battlefield with pools of blood and bullet-riddled bodies. Blood and bullet-marks were everywhere on the floors and walls, The Hindu reported. The partly dismembered bodies of Komalaraja, 35, and Padmanathan, 27, members of the defunct provincial council, were lying in the flat’s toilet and bedroom respectively. The police issued a State-wide alert. Chief Minister M. Karunanidhi said the government would not allow any militant group to indulge in any internecine clash in the State. Premachandran, who was elected the new leader of EPRLF, blamed the attack on the LTTE, which denied the charge.  A retired police officer said, “The intra-party rivalry is seen as the ultimate motive behind the killing. The LTTE wanted to show one-upmanship.” The EPRLF, a Marxist-Leninist group, was fighting for a united Sri Lanka with equal rights for all ethnic groups, while the LTTE wanted a separate state in the north and east of Sri Lanka. The LTTE saw the EPRLF as a betrayer as it had allegedly collaborated with the Indian Peace Keeping Force and as a threat to its dominance in the freedom movement, said former intelligence experts.  The assassins boarded a Maruthi jeep on the way to the coastal area in Thanjavur district. Retired Deputy Superintendent of Police K. Manickavasgam, who was the then sub-inspector in Thanjavur district, said the squad had cleverly crossed so many checkpoints. When it came to the Pillayar Thidal village checkpoint on the coastal area near Pattukottai, their jeep slowed down. The local sub-inspector, Ramamurthy, found some men in the vehicle, armed with weapons. One of them brandished an AK 47 rifle and told Ramamurthy, “Sir, yours are only toy guns; but ours are AK 47 automatic machine guns. Don’t make fun with your toy guns. Please leave us.” The sub-inspector could not stop the jeep and it entered a coconut grove 300 metres from the East Coast Road adjoining the Bay of Bengal. The sub-inspector went to another village and called up the District Superintendent of Police.  The Superintendent of Police and members of the ‘Q’ Branch entered the grove, but found none, except some chicken feathers and fish waste. The jeep was later found concealed under the haystack. “Then the villagers told the police officers that some men, armed with big guns, alighted from the jeep, purchased chicken and fish from the shore, cooked them, had their lunch. They got into a plastic mechanised boat and escaped around 3 p.m.,” Mr. Manickavasagam recalled.  The case was investigated by the Tamil Nadu Special Investigation Team. Only in August 1991 was Chinna Santhan, one of the accused in the Padmanabha case, was arrested by the Special Investigating Team (SIT) probing the Rajiv Gandhi assassination case. Of the 26 accused persons listed in the original charge sheet, Sivarasan and Gundu Santhan (both among the accused in the Rajiv Gandhi case) are dead. Kiruban escaped from custody. Six of them — LTTE intelligence chief Pottu Amman (also an accused in the Rajiv Gandhi case), Daniel, David, Dileepan, Ravi, and Nagaraja — were declared proclaimed offenders. The remaining 17 faced the trial which began, nearly five years after the assassination of Padmanabha, at a court designated for the Terrorist and Disruptive Activities (Prevention) Act cases at the Poonamallee jail.  Padmanabha’s murder was planned by Pottu Amman and “one-eyed” Sivarasan, who also masterminded the Rajiv Gandhi assassination. In fact, the police say Sivarasan was part of the gang that carried out Padmanabha’s assassination. Pottu Amman allegedly worked out the plot from Jaffna in February 1990. On his instructions, Chinna Santhan came to Chennai and joined an institute and stayed near the flat where the EPRLF leaders were living. It was further alleged that a squad — comprising Sivarasan, David, Dileepan, Daniel, and Ravi — arrived in Tamil Nadu on June 10, 1990. Informed by Chinna Santhan that Padmanabha and other EPRLF leaders were holding a meeting in the flat, they executed the massacre and fled to the island nation.  In November 1997, judge Arumuga Perumal Adityan acquitted 15 of the 17 accused because the prosecution had “not proved beyond any reasonable doubt” the allegations against them. The judge convicted Chinna Santhan and Anandaraj. Among those acquitted were former DMK Minister Subbulakshmi Jagadeesan, her husband Jagadeesan, former Home Secretary R. Nagarajan, MDMK leader V. Gopalsamy’s brother V. Ravichandran, and advocate D. Veerasekaran. Chinna Santhan was found guilty of advising, abetting and facilitating the crime and was sentenced to six years of rigorous imprisonment. Anandaraj was found guilty of harbouring Gundu Santhan. He was sentenced to five years of rigorous imprisonment.  Published - June 02, 2024 11:48 pm IST"
    },
    {
      "title": "Man wanted in 2018 double murder in Chennai arrested in Mumbai",
      "content": "More than five years after a man arrested in connection with the murder of an elderly couple in Chennai jumped bail, the police have managed to trace and arrest him in Mumbai. The accused Kamrul Alam, who hailed from Bihar, was engaged in construction-related work in Chennai when he committed the crime.  According to police, Alam killed Mayandi, 76, and his wife Vallinayaki, at their home on Ramalinga Nagar Road in Thoraipakkam, in 2018 following a dispute over payment of wages for some work he did on the couple’s property. He also allegedly stole the victims’ jewellery.  Although the police arrested Alam soon after the crime, he came out on bail. He had secured it after allegedly furnishing fake surety and fled the city. The Alandur Court then issued an arrest warrant against him.  Following this, a Special Task Force of the Greater Chennai Police took up the task to trace. A team went to his native village of Ratnapura in Darbhanga district of Bihar and investigated. It found that Alam had gone into hiding with his family.  However, recently, the police, with help from the cyber crime unit, detected money being deposited into the bank account of Alam’s wife by her family members. They noticed that the money had been withdrawn at an ATM in Mumbai. The team rushed to Mumbai and began investigating.  They found that Alam and his wife were living there. Acting on leads, the police reached his house and found that Alam had injured both his legs in an accident last month. The police arrested him and brought him to the city after obtaining a prisoner transfer warrant from a local court.   Published - February 02, 2025 11:19 pm IST"
    },
    {
      "title": "Two killed on rail track in Chennai",
      "content": "Seventeen-year-old Riaz Ahmed of Corporation Colony, Kodambakkam, was killed after being hit by Guruvayur Express, when he tried to cross the railway tracks between Saidapet and Mambalam, on Saturday night. An official of the Government Railway Police said the youth had gone for shopping with three of his friends. They were crossing the tracks and his friends managed to escape the speeding train, but Riaz was hit and died on the spot. His body was taken to Rajiv Gandhi Government General Hospital for post-mortem. In another accident, a youth from Rajasthan was hit by a suburban train and killed while crossing the railway tracks between Perungalathur and Tambaram stations. Rishikesh Meera (27), who had come to appear for Railway Recruitment Board exams, was hit by an EMU. The body was taken to Chromepet GH.  Published - June 16, 2014 09:25 am IST  Chennai "
    },
    {
      "title": "Man murders brother in Chennai suburb",
      "content": "A 34-year-old man stabbed his brother to death following an argument outside their house in Mogappair East in the early hours of Friday. Police said both the men were in an inebriated state. Sources with the JJ Nagar police identified the deceased as Poniahan alias Kamal (32), an employee of an export firm. His elder brother Thangaraj alias Rajini (34), a cable TV sub operator, allegedly killed him. The incident took place around 1.30 a.m. at their residence in Nakkeeran Salai when they planned to leave for Pallavaram with rest of the family members after receiving news on the sudden demise of their uncle. Thangaraj got into an argument with Poniahan after the latter refused to bring an autorickshaw for the family members to leave. The brothers exchanged blows and finally Thangaraj took a kitchen knife and stabbed his younger brother. He died with a few minutes. Neighbours informed the police who reached the spot and arrested Thangaraj, sources added. Poniahan’s body was sent to the Government Kilpauk Medical College hospital for post-mortem.  Published - June 22, 2012 02:33 pm IST  murder "
    },
    {
      "title": "Man murders two children and ends life",
      "content": "A 55-year-old man murdered his two children and ended his life at their house in West Mambalam on Friday following a domestic dispute with his wife.  The victims have been identified as Mohan, 55, a businessman, and his two children - M. Sai Swathi, a class IX student and M. Tejas, a UKG student. Police sources said that when his wife Yamuna came home on Friday evening, she found the door locked from inside. With the help of neighbours, she broke open the door and found the three dead.  The Kumaran Nagar police recovered the bodies and sent them to Government Royapettah Hospital for post-mortem.  Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050.   Published - May 11, 2024 07:32 pm IST"
    },
    {
      "title": "Three arrested in Chennai for murdering young man who protested against his girlfriend’s engagement",
      "content": "The Peerkankaranai police on Friday, February 2, 2024, arrested three men who were allegedly involved in the murder of a 24-year-old, as had protested against their getting a young woman, with whom he was in a relationship, engaged to another man.   Following information from members of the public about the body of a young man found at a graveyard in Gundumedu, the police had arrived at the spot and found that the man had been murdered with a heavy stone. The body also bore other wound marks. The body was sent to the Government Chromepet Hospital for a post-mortem, and the police began an investigation.  Police said the victim has been identified as Jeeva, 24, from Gundumedu village in Perungalathur. Jeeva used to play the drums, and was a gaana singer at funerals. He belonged to a Scheduled Caste community. He had been in a relationship with a young woman from the same caste in Gundumedu for the past two years. However, the young woman’s family opposed the relationship, and got her engaged to another man, an employee of a private firm. Jeeva, reportedly, sent pictures to this man, of himself with the young woman.  The young woman’s parents and brothers warned him to break off the relationship. However, on the night of January 31, Jeeva went to the young woman’s house and created a ruckus. The brothers of the woman chased him away. The following day, village residents found Jeeva’s body along with that of his pet dog. The police’s investigation revealed that her family members had attacked him using wooden logs and stones, and had also killed his dog.  Police said three suspects, including the young woman’s brothers, were arrested for the murder. The accused persons have been identified as G. Vijay, 21, his brother Ajith, 24 and their friend Aravindan, 22. They were all remanded to judicial custody after being produced before a court. Police said they are on the lookout for a few more suspects who are still absconding.   Published - February 02, 2024 02:48 pm IST  murder / police / crime, law and justice / arrest "
    },
    {
      "title": "West Bengal native suspected of Kerala woman’s murder detained in Chennai",
      "content": " A migrant labourer, who is the prime suspect of the murder of an elderly woman near Kesavadasapuram, was detained in Chennai on Monday.  Adam Ali, 21, of West Bengal was caught by the Railway Protection Force at the Chennai Central railway station nearly a day after the murder of 68-year old Manorama who hailed from Rakshapuri road in Mosque Lane, Kesavadasapuram.  Her body was found in a well of an adjacent house around 10.45 p.m. on Sunday. The prime accused fled the city in a train after purportedly committing the crime. Five of Adam’s colleagues and housemates, who also hailed from West Bengal, have been taken into custody by the Medical College police.  Manorama, who had retired as Superintendent at the Directorate of Collegiate Education, was alone in her house at the time of the incident on Sunday. Her husband Dinaraj had gone to their daughter’s house in Varkala. The victim was reported to have gone missing by noon.  While the police soon initiated a search operation, they found out that one among the six migrant workers who resided nearby at a construction site had gone missing. The others told the police that Adam claimed to have assaulted the woman following an altercation and that he was leaving the place with his belongings.  During a preliminary inspection, the police found ₹50,000 had gone missing from the house, strengthening the possibility of the case being a murder for gain. After the body was retrieved, it was later found that a gold necklace and a set of bangles that Manorama had worn were also missing.  While a heavy rock was found to have been tied to her legs, a post-mortem examination revealed the death was due to strangulation. The police have recovered CCTV footage of the accused dragging the deceased’s body to the well and another of him walking towards the Thiruvananthapuram Central railway station around 4.45 p.m.  The latter prompted the City police to issue an alert across railway stations and other transit points. A team from the Medical College police have left for Chennai to gain custody of the accused.   Published - August 09, 2022 09:21 am IST  murder / arrest / Kerala / Chennai "
    },
    {
      "title": "A Friday to forget for Chennai women",
      "content": "It was a bloody Friday for women in the city, as news emerged of the cold blooded murder of five women — four of them under 30 years of age. While S. Swathi, a 24-year-old Infosys employee, was hacked to death as she sat waiting for a train at the Nungambakkam railway station, the decaying corpses of a mother and her three teenaged daughters were discovered in a house in Royapettah, right behind the new police station building. Angry residents took to social media to vent their ire at the establishment, at the visible lack of policing and the brazen nature of the violent crimes against women. Reacting to the murders, Sudha Ramalingam, a senior advocate said, “Whether at home or outside, women are vulnerable, even helpless. It is high time we began learning martial arts for self defence.”  Published - June 25, 2016 10:20 am IST  Chennai / murder "
    },
    {
      "title": "Eight, including two juveniles, arrested for murder of autorickshaw driver in Chennai",
      "content": "The Ambattur Police have arrested eight persons, including two juveniles, in connection with the murder of an autorickshaw driver.  On the night of Thursday, July 20, 2023, a group of young people were celebrating a birthday, by cutting a cake in the middle of a road, blocking traffic, in Ambattur. They allegedly attacked an autorickshaw driver when he asked them to make way for his vehicle and then, they escaped from the spot.   The victim was identified as Kamesh, 25, of Venkateshwara Nagar, Ambattur. He died on the spot, while his brother Sathish was also injured when he attempted to rescue his brother from the attack.  Ambattur Police took up the investigation after registering a case. After an investigation, the police apprehended eight suspects including two juveniles. The suspects were identified as Gowtham, 22, Ajay, 22, Surya, 23 and five others, all from Oragadam.   Published - July 22, 2023 04:46 pm IST  Chennai / crime, law and justice / police / murder "
    },
    {
      "title": "A massacre that shook Chennai more than three decades ago\nPremium",
      "content": "On June 19, 1990, 15-20 men, armed with light machine guns and other automatic weapons, came in two cars around 7 p.m. to an apartment at Zackariah Colony in Kodambakkam. There, a large number of men from the Eelam People’s Revolutionary Liberation Front (EPRLF) and their families were staying for some time. Their leader K. Padmanabha and other prominent functionaries of the outfit were at an informal meeting in a flat on the second floor.  The armed men sprinted up the narrow staircase and stormed the flat. In the next four minutes, the militants of the Liberation Tigers of Tamil Eelam (LTTE) sprayed bullets into the EPRLF men and lobbed five grenades. Then, they came down, fired at some people standing on the road, and escaped. In all 15 persons — 14 of them EPRLF workers, including secretary-general K. Padmanabha and Finance Minister in the defunct North-Eastern Provincial Council P. Kirubakaran — were killed. Eight persons, including Padmanabha, were killed in the flat. Five others, including Ramesh, 28, of Choolaimedu, were gunned down on the road. K. Yogasangari, an EPRLF MP, and another activist, Mukundan, died of injuries at hospital, and 21 others, including a four-month-old boy, were injured.  It was a rude shock to Anandi, 30, wife of Padmanabha, when she returned from visiting her father nearby. The apartment looked like a battlefield with pools of blood and bullet-riddled bodies. Blood and bullet-marks were everywhere on the floors and walls, The Hindu reported. The partly dismembered bodies of Komalaraja, 35, and Padmanathan, 27, members of the defunct provincial council, were lying in the flat’s toilet and bedroom respectively. The police issued a State-wide alert. Chief Minister M. Karunanidhi said the government would not allow any militant group to indulge in any internecine clash in the State. Premachandran, who was elected the new leader of EPRLF, blamed the attack on the LTTE, which denied the charge.  A retired police officer said, “The intra-party rivalry is seen as the ultimate motive behind the killing. The LTTE wanted to show one-upmanship.” The EPRLF, a Marxist-Leninist group, was fighting for a united Sri Lanka with equal rights for all ethnic groups, while the LTTE wanted a separate state in the north and east of Sri Lanka. The LTTE saw the EPRLF as a betrayer as it had allegedly collaborated with the Indian Peace Keeping Force and as a threat to its dominance in the freedom movement, said former intelligence experts.  The assassins boarded a Maruthi jeep on the way to the coastal area in Thanjavur district. Retired Deputy Superintendent of Police K. Manickavasgam, who was the then sub-inspector in Thanjavur district, said the squad had cleverly crossed so many checkpoints. When it came to the Pillayar Thidal village checkpoint on the coastal area near Pattukottai, their jeep slowed down. The local sub-inspector, Ramamurthy, found some men in the vehicle, armed with weapons. One of them brandished an AK 47 rifle and told Ramamurthy, “Sir, yours are only toy guns; but ours are AK 47 automatic machine guns. Don’t make fun with your toy guns. Please leave us.” The sub-inspector could not stop the jeep and it entered a coconut grove 300 metres from the East Coast Road adjoining the Bay of Bengal. The sub-inspector went to another village and called up the District Superintendent of Police.  The Superintendent of Police and members of the ‘Q’ Branch entered the grove, but found none, except some chicken feathers and fish waste. The jeep was later found concealed under the haystack. “Then the villagers told the police officers that some men, armed with big guns, alighted from the jeep, purchased chicken and fish from the shore, cooked them, had their lunch. They got into a plastic mechanised boat and escaped around 3 p.m.,” Mr. Manickavasagam recalled.  The case was investigated by the Tamil Nadu Special Investigation Team. Only in August 1991 was Chinna Santhan, one of the accused in the Padmanabha case, was arrested by the Special Investigating Team (SIT) probing the Rajiv Gandhi assassination case. Of the 26 accused persons listed in the original charge sheet, Sivarasan and Gundu Santhan (both among the accused in the Rajiv Gandhi case) are dead. Kiruban escaped from custody. Six of them — LTTE intelligence chief Pottu Amman (also an accused in the Rajiv Gandhi case), Daniel, David, Dileepan, Ravi, and Nagaraja — were declared proclaimed offenders. The remaining 17 faced the trial which began, nearly five years after the assassination of Padmanabha, at a court designated for the Terrorist and Disruptive Activities (Prevention) Act cases at the Poonamallee jail.  Padmanabha’s murder was planned by Pottu Amman and “one-eyed” Sivarasan, who also masterminded the Rajiv Gandhi assassination. In fact, the police say Sivarasan was part of the gang that carried out Padmanabha’s assassination. Pottu Amman allegedly worked out the plot from Jaffna in February 1990. On his instructions, Chinna Santhan came to Chennai and joined an institute and stayed near the flat where the EPRLF leaders were living. It was further alleged that a squad — comprising Sivarasan, David, Dileepan, Daniel, and Ravi — arrived in Tamil Nadu on June 10, 1990. Informed by Chinna Santhan that Padmanabha and other EPRLF leaders were holding a meeting in the flat, they executed the massacre and fled to the island nation.  In November 1997, judge Arumuga Perumal Adityan acquitted 15 of the 17 accused because the prosecution had “not proved beyond any reasonable doubt” the allegations against them. The judge convicted Chinna Santhan and Anandaraj. Among those acquitted were former DMK Minister Subbulakshmi Jagadeesan, her husband Jagadeesan, former Home Secretary R. Nagarajan, MDMK leader V. Gopalsamy’s brother V. Ravichandran, and advocate D. Veerasekaran. Chinna Santhan was found guilty of advising, abetting and facilitating the crime and was sentenced to six years of rigorous imprisonment. Anandaraj was found guilty of harbouring Gundu Santhan. He was sentenced to five years of rigorous imprisonment.  Published - June 02, 2024 11:48 pm IST"
    },
    {
      "title": "Three arrested for murdering retired Chennai Corporation employee over land issue",
      "content": "The Tambaram police have arrested three persons on the charge of murder of a 70-year-old retired Chennai Corporation employee in a purported attempt to grab his relative’s land in Uthandi, on Wednesday (March 19, 2025).  A senior official of the Tambaram Police Commissionerate said the deceased Kumar was also an office-bearer of a trade union. Hailing from Ayanavaram, he had been residing in his daughter’s house in Selaiyur for the past one year. Kumar left the house for some personal work on March 16, 2025, but did not return, after which his daughter lodged a missing persons complaint. During their investigation, the Tambaram police said they found that Kumar was murdered by a three-member gang, allegedly to take over a parcel of land in Uthandi belonging to his relative Ramesh, who resides in Mumbai. Kumar had come to know that the land was being encroached upon by a person named A. Ravi of Urapakkam a few months ago. He had lodged a land-grabbing complaint at the Kanathur police station regarding this. The accused Ravi had created fake documents and contructed a compound wall around the land, the police said. After the complaint, Ravi, fearing arrest, had contacted Kumar, saying he was willing to purchase the land. He asked him to come to a restaurant near the Tambaram bus terminus on March 16. When Kumar went to the restaurant, Ravi told him they could visit the land in Uthandi in his car. Land brokers Vijay and Senthilkumar also accompanied them, the police said.  When they reached Singaperumal Koil, Ravi threatened Kumar to hand over the original land documents. Kumar, however, disagreed. Enraged by this, Ravi, along with Vijay and Senthilkumar, murdered Kumar and buried the body near a forest land in Gingee, said the police.  The police are also investigating a person named Sukumar, who allegedly created false documents and a fake patta for the land in Uthandi.   Published - March 19, 2025 12:12 pm IST  Chennai / murder / crime "
    },
    {
      "title": "Three arrested in Chennai for murdering young man who protested against his girlfriend’s engagement",
      "content": "The Peerkankaranai police on Friday, February 2, 2024, arrested three men who were allegedly involved in the murder of a 24-year-old, as had protested against their getting a young woman, with whom he was in a relationship, engaged to another man.   Following information from members of the public about the body of a young man found at a graveyard in Gundumedu, the police had arrived at the spot and found that the man had been murdered with a heavy stone. The body also bore other wound marks. The body was sent to the Government Chromepet Hospital for a post-mortem, and the police began an investigation.  Police said the victim has been identified as Jeeva, 24, from Gundumedu village in Perungalathur. Jeeva used to play the drums, and was a gaana singer at funerals. He belonged to a Scheduled Caste community. He had been in a relationship with a young woman from the same caste in Gundumedu for the past two years. However, the young woman’s family opposed the relationship, and got her engaged to another man, an employee of a private firm. Jeeva, reportedly, sent pictures to this man, of himself with the young woman.  The young woman’s parents and brothers warned him to break off the relationship. However, on the night of January 31, Jeeva went to the young woman’s house and created a ruckus. The brothers of the woman chased him away. The following day, village residents found Jeeva’s body along with that of his pet dog. The police’s investigation revealed that her family members had attacked him using wooden logs and stones, and had also killed his dog.  Police said three suspects, including the young woman’s brothers, were arrested for the murder. The accused persons have been identified as G. Vijay, 21, his brother Ajith, 24 and their friend Aravindan, 22. They were all remanded to judicial custody after being produced before a court. Police said they are on the lookout for a few more suspects who are still absconding.   Published - February 02, 2024 02:48 pm IST  murder / police / crime, law and justice / arrest "
    },
    {
      "title": "Man murders two children and ends life",
      "content": "A 55-year-old man murdered his two children and ended his life at their house in West Mambalam on Friday following a domestic dispute with his wife.  The victims have been identified as Mohan, 55, a businessman, and his two children - M. Sai Swathi, a class IX student and M. Tejas, a UKG student. Police sources said that when his wife Yamuna came home on Friday evening, she found the door locked from inside. With the help of neighbours, she broke open the door and found the three dead.  The Kumaran Nagar police recovered the bodies and sent them to Government Royapettah Hospital for post-mortem.  Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050.   Published - May 11, 2024 07:32 pm IST"
    },
    {
      "title": "Syringe murders: Three bodies to be exhumed",
      "content": "Neelangarai police in Chennai are planning to exhume the bodies of three victims in the syringe murder cases. In 2015, Stephen, a 41-year-old businessman, had allegedly killed the three in separate incidents using a potassium cyanide-filled syringe that had been fitted to an umbrella. According to police sources, with the help of his accomplices, Stephen allegedly murdered his brother-in-law John Philomenon on April 19 last year at Thousand Lights. He was also suspected to have murdered Sridhar of Uthiramerur and Henry of Madipakkam on May 17 and October 10 last year respectively. He had administered a deadly injection to all three victims, with the help of his aides. The murders came to light when the police were investigating a burglary complaint lodged by Stephen. The burglary suspects turned out to be Stephen’s aides who helped him commit the murders. “We took Stephen under police custody and questioned him. We also searched his farmhouse. But he has cleared everything from there. He had probably instructed someone to do so if he got arrested,” said a police officer. Now the police would have to take the permission from the respective tahsildars to exhume the bodies. “We have to check for the place where he injected the poison and also check if there are some traces left in the body parts. All the three were buried since they were Christians,” the police officer said. During interrogation, Stephen told them that he was initially planning to make the murders appear to be an accident. “He had tried it on John Philomenon. He wanted to make him lose his balance while riding a motorcycle, by hitting his vehicle’s handlebar. As this attempt failed to produce the desired result, he adopted this novel method,” said the officer. Stephen went to Navi Mumbai to purchase potassium cyanide. Stephen was sent back to judicial custody on Friday. When umbrella turned a lethal weapon Stephen had removed the tip of an umbrella and made a provision for a syringe to be fitted in its place. He would fill the syringe with a deadly chemical, suspected to be potassium cyanide. Using this umbrella with a poisoned tip, his aides would gently inject the poison into a target. Nobody would know what was going on, not even the victim, who would die in ten minutes, after suffering a heart attack, police sources said.  Published - May 09, 2016 12:00 am IST"
    },
    {
      "title": "Chennai police open fire on history-sheeter, arrest him",
      "content": "A history-sheeter who attempted to evade arrest was nabbed after a special police team shot at him at Ayanavaram in Chennai early Monday (December 9, 2024).  A senior police officer said the accused, Arivazhagan, 24, of Thirumullaivoyal, an ‘A’ category history-sheeter, was in hiding, and that the special team traced him to a housing quarters at Pananthope Railway Colony, Ayanavaram. He was surrounded by the team at around 6 a.m. on Monday.  “On being surrounded by the police, he whipped out a country-made gun and brandished it at them. Sub-Inspector Prem Kumar shot him in his right leg, below the knee, in order to immobilise him. He dropped his weapon, fell, and the police caught him. He was rushed to Government Stanley Hospital, where he has been undergoing treatment. Further investigation is on,” the official said.  The police said Arivazhagan, alias Hari, is allegedly involved in half a dozen criminal offences, including murder and attempt to murder cases, in Chennai and Tiruvallur districts. He has murder cases pending against him in Sembium and Pulianthope stations in the Greater Chennai City Police limits and another murder case and an attempt to murder case in Sholavaram police station, besides a ganja-peddling case in Minjur and an attempt to murder case in Thiruthani.  A non-bailable warrant had been issued against him by a trial court after he failed to appear before it in connection with a criminal case registered by the Chennai City police. Thereafter, a special team was formed to arrest him. The team, headed by Otteri Sub-Inspectors Prem Kumar and Venkateshwaran, launched the hunt to trace him as he had been evading the police for the past couple of years.  The team had been to Bihar in search of him and then to Andhra Pradesh, where he was in hiding for a long time, apprehensive that he was in danger of being attacked by the associates of a history-sheeter whose murder he was allegedly involved in, said police sources.  When the special team went to Andhra Pradesh on Sunday (December 8, 2024), it was learnt he had escaped to Chennai. They then traced him to his hideout in the city before shooting at him and arresting him. The police also seized a country-made gun, a knife, and 6 kg of ganja from the scene.  Published - December 09, 2024 01:23 pm IST  crime / Tamil Nadu / police "
    },
    {
      "title": "Chennai police arrest three for murder of 20-year-old",
      "content": "The Thiruverkadu Police have arrested three men believed to be involved in the murder of a 20-year-old youth in Sundara Cholapuram. Police claimed the suspects were arrested within three hours of the crime being reported.  The victim has been identified as V. Vijayakanth alias ‘Captain’, 20 who used to assist his father Velayutham, a plumber. At 3 a.m. on Wednesday, April 10, 2024, the police received information that the young man had been hacked to death by unidentified persons at his house in Selliamman Nagar, Sundara Cholapuram.  Upon receipt of the information, police personnel led by Thiruverkadu Inspector Vijaya Krishnaraj went to the spot and found the youth dead, in a pool of blood. His mother had also been injured when she attempted to fend off the attack. The body of the deceased was sent to Government Kilpauk Medical College Hospital for a post-mortem.  The police swung into action and began an investigation after analysing clues provided by the family of the deceased. The initial investigation revealed that the Vijayakanth, along with his accomplices, had attempted to murder G. Arokiasamy, 20 of the same area due to previous enmity. The criminal case against them in this regard was pending in a court. Police said that Arokiasamy along with two of his associates, had hatched a plan to settle this score and had been waiting for an opportune moment.  On Tuesday (April 9) night, the suspects drank alcohol and when they were very drunk, went to Vijayakanth’s home and barged into it. They then hacked him to death using knives.  After an investigation, the police traced and arrested the suspects: G .Arokiasamy, 20, M. Saravanan, 20 and A. Vignesh, 20 of Thiruverkadu around 6 a.m. They were remanded in judicial custody.   Published - April 10, 2024 03:55 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "Class XI student among two killed on Chennai - Bengaluru Highway in Vellore",
      "content": "Two persons including a standard XI student were killed after the two-wheeler they were travelling hit a lorry on Chennai - Bengaluru Highway (NH 44) in Vellore town on Sunday. Police said the deceased were identified as Mohammed Talaq (17), a native of Melvisharam town in Ranipet and a first-year college student, and Mohamed Pyas (16), a class XI student from Melvisharam. Initial inquiry revealed that the duo was traveling in the two-wheeler from Melvisharam town to Vellore to meet their friends when Talaq lost control of his two-wheeler and hit a stationed lorry on the highway. In the impact, they were thrown off from their vehicle. Police said that the duo did not wear helmets. Immediately, other motorists shifted the duo to Government Hospital in Vellore town where doctors declared them dead on arrival. Vellore North police also inspected the spot and regulated the traffic on the highway. A case has been registered. Special teams have been formed to nab the lorry driver. A probe is underway.  Published - November 24, 2024 09:48 pm IST"
    },
    {
      "title": "Chennai police open fire on history-sheeter, arrest him",
      "content": "A history-sheeter who attempted to evade arrest was nabbed after a special police team shot at him at Ayanavaram in Chennai early Monday (December 9, 2024).  A senior police officer said the accused, Arivazhagan, 24, of Thirumullaivoyal, an ‘A’ category history-sheeter, was in hiding, and that the special team traced him to a housing quarters at Pananthope Railway Colony, Ayanavaram. He was surrounded by the team at around 6 a.m. on Monday.  “On being surrounded by the police, he whipped out a country-made gun and brandished it at them. Sub-Inspector Prem Kumar shot him in his right leg, below the knee, in order to immobilise him. He dropped his weapon, fell, and the police caught him. He was rushed to Government Stanley Hospital, where he has been undergoing treatment. Further investigation is on,” the official said.  The police said Arivazhagan, alias Hari, is allegedly involved in half a dozen criminal offences, including murder and attempt to murder cases, in Chennai and Tiruvallur districts. He has murder cases pending against him in Sembium and Pulianthope stations in the Greater Chennai City Police limits and another murder case and an attempt to murder case in Sholavaram police station, besides a ganja-peddling case in Minjur and an attempt to murder case in Thiruthani.  A non-bailable warrant had been issued against him by a trial court after he failed to appear before it in connection with a criminal case registered by the Chennai City police. Thereafter, a special team was formed to arrest him. The team, headed by Otteri Sub-Inspectors Prem Kumar and Venkateshwaran, launched the hunt to trace him as he had been evading the police for the past couple of years.  The team had been to Bihar in search of him and then to Andhra Pradesh, where he was in hiding for a long time, apprehensive that he was in danger of being attacked by the associates of a history-sheeter whose murder he was allegedly involved in, said police sources.  When the special team went to Andhra Pradesh on Sunday (December 8, 2024), it was learnt he had escaped to Chennai. They then traced him to his hideout in the city before shooting at him and arresting him. The police also seized a country-made gun, a knife, and 6 kg of ganja from the scene.  Published - December 09, 2024 01:23 pm IST  crime / Tamil Nadu / police "
    },
    {
      "title": "Class XI student among two killed on Chennai - Bengaluru Highway in Vellore",
      "content": "Two persons including a standard XI student were killed after the two-wheeler they were travelling hit a lorry on Chennai - Bengaluru Highway (NH 44) in Vellore town on Sunday. Police said the deceased were identified as Mohammed Talaq (17), a native of Melvisharam town in Ranipet and a first-year college student, and Mohamed Pyas (16), a class XI student from Melvisharam. Initial inquiry revealed that the duo was traveling in the two-wheeler from Melvisharam town to Vellore to meet their friends when Talaq lost control of his two-wheeler and hit a stationed lorry on the highway. In the impact, they were thrown off from their vehicle. Police said that the duo did not wear helmets. Immediately, other motorists shifted the duo to Government Hospital in Vellore town where doctors declared them dead on arrival. Vellore North police also inspected the spot and regulated the traffic on the highway. A case has been registered. Special teams have been formed to nab the lorry driver. A probe is underway.  Published - November 24, 2024 09:48 pm IST"
    },
    {
      "title": "Chennai police open fire at history-sheeter ‘Bomb’ Saravanan, arrest him",
      "content": "A history-sheeter ‘Bomb’ A. Saravanan, who was on the run, was arrested by a special police team at his hideout in Mullai Nagar on Wednesday night. Saravanan had allegedly attempted to attack the police personnel when they surrounded him. An A-plus category history-sheeter, he had been allegedly involved in over 30 cases – six each for murder and attempt to murder, and for possessing and using explosive substances, among others. The police were on the lookout for Saravanan for the last six years. Acting on a tip-off that he was hiding in the Vyasarpadi area, the special team led by Pulianthope Crime Inspector Ambedkar traced him in Mullai Nagar. According to police sources, the team had initially asked him to surrender. However, he attempted to escape by attempting to attack Mr. Ambedkar with a knife, who ducked at the right time to avoid it.A sub-inspector, Mani, who tried to snatch the knife from Saravanan was injured on his hand. Saravanan also hurled a country- made bomb at the police personnel. However, it did not explode. This prompted the Inspector to shoot Saravanan below his knees with his service weapon for apprehending him.  Saravanan and the injured policeman were taken to government hospitals. Four country-made bombs, two knives and five kg of ganja were seized in the operation. Police sources said Saravanan was a close associate of BSP leader Armstrong, who was murdered last year. Saravanan’s brother, Thennu, alias Thennarasu, BSP north chennai district secretary,was murdered by a gang led by Arcot Suresh in Tiruvallur district in 2015. History-sheeter Nagendran was the main accused in the murder, and Saravanan was said to have been attempting to finish off his adversaries to avenge his brother.  He was said to be involved in the murder of one Yanai Selvam, alias Panneerselvam, who was a part of the gang that killed his brother.  According to police, Saravanan had confessed that in 2018, he came out of prison and got to know that an advocate, Rajesh, Agaram Appu, and two other persons had kidnapped Panneerselvam in connection with a real estate dispute and planned to kill him.  Realising this, he and his men kidnapped Panneerselvam to Andhra Pradesh, took him to a river in Gudur, and murdered him. He had later burnt the body there, the police added.  Published - January 16, 2025 05:06 pm IST  Chennai / crime "
    },
    {
      "title": "Chargesheet will soon be filed in Armstrong murder case, says Chennai Police Commissioner",
      "content": "Greater Chennai Police Commissioner A. Arun on Thursday said the investigation into BSP leader K. Armstrong’s murder was nearing completion. On July 5, BSP leader Armstrong was hacked to death by a gang on Venugopalaswamy Street in Perambur. The Sembium police registered a case based on a complaint by his brother, and took up the investigation.  Immediately after the incident, Mr. Arun took over as the new Commissioner of Police. The investigation, which was entrusted to a special team of police, intensified. So far, at least 27 suspects, including Ponnai Balu, who is the brother of slain history-sheeter Arcot Suresh, and three women, were arrested.  Interacting with mediapersons, Mr. Arun said, “We are investigating the case methodically and in a professional manner. We are gathering all the evidence to make a strong case against the suspects. We have made 27 arrests, and three more suspects need to be arrested. They will soon be arrested. We may file a chargesheet next week in the case, specifying the role of each suspect.“ The Commissioner said the special team has also been conducting an investigation into the financial transactions of the suspects, adding that one of them, while serving prison term, had made certain financial dealings.  On the major initiatives he undertook since assuming office as the Commissioner, Mr. Arun said rowdyism in the city was brought under control and a special intelligence team was formed to keep crimes under check. So far, over 150 criminals were detained under the Goondas Act. The Commissioner said that he has formed a special team to clamp down on drug trafficking.  Mr. Arun said the snatching of mobile phones is a serious offence.  Earlier in the day, he held a special grievance redress meeting with police personnel. A total of 263 petitions were received.   Published - September 06, 2024 12:31 am IST"
    },
    {
      "title": "Fewer murders, thefts in 2020 compared to 2019, Chennai Police say",
      "content": "The city police said the number of murder cases and chain snatching offences have been fewer in 2020 compared to 2019. Also, more cases were booked against drug peddlers this year, compared to 2019.  In 2020, the number of murder cases reported was 147, while it was 173 in the previous year. All the 147 murder cases have been solved and the accused have been arrested. Similarly, there has been a substantial reduction in the occurrences of chain snatching. A total of 246 cases were reported in 2020 against 310 cases during the previous year. After the present Commissioner Mahesh Kumar Aggarwal took over, the city police also launched a special drive against drugs to weed out narcotic drugs within the city limits. A total of 522 cases have been booked and 2,966 kg of contraband was seized in 2020 as compared to 452 cases booked in the previous year with a seizure of 1,128 kg.  Mr. Aggarwal said, “In order to maintain law and order and to control the activities of rowdies and habitual offenders, the Greater Chennai Police detained 542 anti-social elements under the Goondas Act. A special drive was initiated for the execution of Non Bailable Warrants and more than 2,560 NBWs were executed during the last two months.” Resorting to legal action against criminals, the Greater Chennai Police got the bail of 123 criminals cancelled to curtail their illegal activities, he said.  “Our emphasis has been to provide police service at the doorsteps [of residents] and build a very good rapport with the public. If people are with us, we are with the people. Then law and order will not be a major problem. It should be taken care of with public cooperation. We should be serving people in different ways,” said Mr. Aggarwal.  The city police also registered 938 cases of mobile snatching thefts. A special impetus was given to the detection of mobile snatching and theft cases. As many as 2,834 mobiles were handed over to the rightful owners after recovery.  Cyber crimes were given special emphasis and investigation of cyber-related crimes were decentralised by creating special units at these district level. These cyber units registered 87 FIRs and 1,925 CSRs in a period of 4 months and successfully restored ₹1.56 crore to the victims of the cyber crimes. In addition, the cyber crime units were able to bust fifteen call centres involved in job racketing. The Cyber Crime of Wing of the CCB arrested criminals involved in impersonating police officers’ Facebook accounts and the accused were arrested from Rajasthan.  The murder of 3 members of the same family under the Elephant Gate Police Station’s jurisdiction created a sensation. The special teams were able to solve this case within 36 hours by conducting an investigation in the States of Tamil Nadu, Andhra Pradesh, Karnataka, Maharashtra, Uttar Pradesh and Rajasthan.  In order to make the police accessible to the public, the Greater Chennai Police took various proactive measures. During the pandemic, video call grievance redressal was introduced. The Commissioner of Police Mr. Aggarwal himself received 996 grievances and 849 petitions have been disposed of.  Similarly, the city police also took the initiatives of organising foot patrolling in all the Police Stations’ jurisdiction and accepting complaints from the petitioners by the patrol vehicles stationed at the designated locations.   Road safety was another major area of concern for the city police. The efforts of the police led to a reduction in fatal accidents from 1,229 in 2019 to 839 in 2020 -- almost 33%. Traffic police successfully implemented zero traffic violation junctions in four places in the city to ensure road discipline and make motorists follow traffic rules strictly. Mr. Aggarwal said, “This programme will be extended to other places to ensure the city roads are safer and accident free.”   Published - December 31, 2020 04:39 pm IST  Chennai "
    },
    {
      "title": "Young athlete killed in road accident in Chennai",
      "content": "A 19-year-old athlete, who was going to a freshers’ party organised by his friends in Manapakkam, was killed after being knocked down by a private school bus on Mount Poonamallee Road on Tuesday, June 25, 2024.  The St. Thomas Mount Traffic Investigation wing police have filed a case and are on the lookout for the absconding driver of the school bus.  Traffic police said P. Nidhipadhi Pandian was a State-level athlete residing in Bhajanai Koil street in Nandambakkam. He was in his first year at a private college in Nungambakkam. His friends had arranged a freshers’ party to which Pandian was proceeding on his two-wheeler on Mount Poonamallee Road, when a private school bus hit him from behind. When he fell down, the driver, without stopping, ran the bus over him, killing him on the spot.  The driver then fearing for his life, abandoned the bus and ran away from the spot.  The police sent the body to Rajiv Gandhi Government General Hospital for a postmortem and are searching for the driver with the help of footage taken from CCTVs near the site of the accident.  Published - June 26, 2024 11:49 am IST  Chennai / police / road accident "
    },
    {
      "title": "Seven persons held for murder in separate cases in Chennai",
      "content": "The Avadi police on Monday arrested six persons for allegedly murdering a youth over a monetary dispute following a drunken brawl near Avadi.  On Monday, the police personnel received information that a body had been discovered at a house in Nandavanam Mettur, near Avadi. The police recovered it and identified the victim as Kaja Moideen, 26. They also determined that the house belonged to S. Karthikeyan, 23, an autorickshaw driver, and interrogated him. Karthikeyan admitted that Kaja Moideen had been staying with him for the last 10 days, and they had a monetary dispute.  When Kaja Moideen threatened to kill Karthikeyan, the latter called his friends to the house. Following a drunken brawl, they murdered Kaja Moideen with knives. The police arrested Karthikeyan and his five associates and seized the knives from them.  In another case, the Muthapudupet police on Monday arrested a 36-year-old woman who allegedly murdered her husband for harassing her while drunk.  The police identified the victim as Velankanni Das, 38. His wife Leema Rose Mary admitted him to a hospital in Avadi on May 10, claiming that he fell unconscious after drinking too much. However, the doctors declared him brought dead. The police registered a case of suspicious death and sent the body for a post-mortem.  Based on the post-mortem report, the police interrogated Leema Rose Mary. She admitted to killing Das when he was inebriated as he had allegedly verbally abused her frequently. She was arrested and remanded in judicial custody.   Published - July 08, 2024 10:56 pm IST"
    },
    {
      "title": "Three held for murder of Chennai man in Krishnagiri",
      "content": "Uthangarai police arrested three persons, including the district secretary of the Tamil Nadu Teachers Association, for allegedly beating to death a man from Chennai who had reportedly duped people of their money by promising them jobs. The victim, Venkatesan (52), residing in Jaswant Nagar, Mogappair, Chennai, allegedly duped his relative Ganesan, the main accused, of Kannalampatty, Uthangarai, by soliciting money in exchange for government jobs.  Earlier this month, Ganesan, along with his associates, kidnapped Venkatesan and his wife while they were in Salem regarding the sale of their property. The couple was transported to Bommampatty, Uthangarai, and held captive separately. Demanding that Venkatesan pay back the money, the accused allegedly beat him to death. Police sources indicate that Venkatesan’s body was buried within the premises of a crusher by Ganesan’s accomplices, Nithyanandan and Vignesh. Lakshmi, Venkatesan’s wife, was coerced into returning to Salem with the ultimatum that she transfer their property to Ganesan if she wished to secure her husband’s release, as per police reports. Upon her arrival in Salem, Lakshmi, accompanied by her son, filed a complaint with the Pallapatty police station. With police assistance, Lakshmi was directed to summon Ganesan to Salem under the pretext of property transfer. Subsequently, the authorities apprehended the suspects in Salem and transported them back to Uthangarai, where the police uncovered Venkatesan’s body.  Published - May 09, 2024 10:36 pm IST"
    },
    {
      "title": "Man murders mother in Chennai, arrested",
      "content": "The Maduravoyal police have arrested a 58-year-old man who escaped after murdering his 80-year-old mother in her house in Porur on Monday. The man had murdered his mother over a property dispute on Sunday.  A senior official of the Chennai City Police said G. Kabali had an ongoing property dispute with his mother Saroja, residing in Dharmaraja Koil Street, Porur, for several years. Kabali had picked up a verbal duel with his 80-year-old mother on Sunday which turned violent and he murdered her with a knife. He later escaped from the place.  Based on the information provided by neighbours, the Maduravoyal police rushed to the spot and sent the body to the Rajiv Gandhi Government General Hospital for a post-mortem. The police filed a murder case.  Kabali was arrested from a hideout in the locality on Monday and the murder weapon was seized from him, police said. He was later produced before a judicial magistrate and sent to prison.   Published - November 21, 2022 01:39 pm IST  Chennai / murder / police "
    },
    {
      "title": "Three murders in outskirts, one reported  in city",
      "content": "Three murders were reported in the city’s suburbs in Minjur, Tambaram, Manimangalam and one in Maduravoyal, within the city limits, late Sunday.  In Minjur, a 26-year-old history-sheeter was hacked to death by another history-sheeter and his associates as the former questioned the latter about having illicit relationship with the former’s wife on Sunday night.  The deceased has been identified as Lakshmanan, 26, of Chinnakavanam village near Ponneri, who had a history-sheet on him at Ponneri police station for his involvement in offences, including an attempt to murder and theft. Lakshmanan had developed friendship with another history-sheeter Vishnu of Thottakadu near Minjur when they were in prison. Vishnu had a relationship with Lakshmanan’s wife. When Lakshmanan warned Vishnu to desist, it resulted in a quarrel between them, though they patched up after sometime.  On Sunday, when both were drinking with Vishnu’s friends, an inebriated Lakshmanan scolded Vishnu. Following this, a scuffle ensued. Vishnu and his associates surrounded him and hacked him with knives. They fled the scene. Upon receipt of the information, the police personnel reached the spot and recovered the body.  Minjur police registered a case and launched a manhunt to nab the suspects. A senior police officer said, “The murder was committed due to an illicit affair. We have secured three suspects, including a prime suspect. The search is on for two more suspects.”  Two murders in Tambaram City limits A youth was stabbed to death in a melee, following a clash between two groups of youngsters over a dispute that arose over snatching a mobile phone from one of them in Mudichur near Tambaram.  Police sources said one Surya Gandhi of Varadharajapuram snatched a mobile phone from Santhosh of the same area after slapping the latter on Sunday evening. Later Santhosh’s mother went to Surya Gandhi’s house and recovered the mobile phone. In the meantime, Santhosh along with his friend Vignesh, 18, and eight others surrounded Surya Gandhi and assaulted him. However, Surya Gandhi and his associates snatched the weapons from the rival gang and retaliated. Vignesh was alone, and hence caught and hacked to death by the opposite group while Santhosh and others escaped from the spot. Peerkankaranai police intensified investigation to nab the suspects. Police arrested Surya alias Surya Gandhi and two more suspects. Meanwhile, another murder was reported from Manimangalam police station limits on Sunday night; a 60-year-old man was murdered by his relatives over a property dispute in Manimangalam near Tambaram. Police said the victim has been identified as Dhayalan, 60, of Aathananchery near Manimangalam. He was constructing a new house on a vacant land near his house. He and his relatives already had a dispute over the property. On Monday, Dhayalan was found lying dead near the new house with his head severed. Manimangalam police are investigating. Tambaram City Police Commissioner A.Amalraj said the suspects were arrested in both cases and further interrogation is on.  Murder in Maduravoyal: Six held  Maduravoyal police arrested six suspects, including a father and son for stabbing to death one of siblings who was addicted to ganja and setting fire to his body to screen the offence.  Police said one of the suspects — Aasai Mani, 65, a daily wager and resident of Mettukuppam, Vanagaram on Friday night cried that his elder son Vijay, 35 who was under the influence of alcohol lost his life after an accidental fall. The next morning, Asai Mani, his younger son Ajay and others cremated the body in a burial ground. Subsequently, a woman made an anonymous call to Maduravoyal Police raising suspicion over the death.  Following the call, Madurovoyal police picked up Aasai Mani and his younger son Ajay for enquiry. During interrogation, they confessed that they had beaten Vijay to death using wooden logs and knives. Police sources said the deceased Vijay was addicted to alcohol and ganja and had frequent quarrels with his father and brother.   Published - June 24, 2024 10:26 pm IST"
    },
    {
      "title": "Class 12 boy dies while carrying out experiments in his house in Kolathur",
      "content": "A 17-year-old boy studying in Class 12 was killed when he was trying out a science experiment with chemicals in his house located in Kolathur on Thursday. The Rajamangalam Police have filed a case and are investigating.  A senior official of the City Police said H. Aditya Pranav was a science stream student of a private school in Mogappair. His father, Hariharan, is engaged in car battery business in West Mambalam. He had set up a small science lab in the first floor of the house located on Murugan Nagar 2nd Street of Kolathur where Aditya Pranav was experimenting with various chemical compounds, including phosphorus along with some batteries. The student was working in his lab in the house around 1 p.m. on Thursday when there was a loud blast. In the impact, the top floor collapsed, killing Aditya Pranav on the spot.  The neighbours alerted the Rajamangalam Police. A police team along with two fire tenders were pressed into service for dousing the fire at the accident spot.  The Rajamangalam Police, after sending the victim’s body to the Government Kilpauk Medical College Hospital for post mortem is inquiring into the incident.   Published - March 21, 2024 11:36 pm IST"
    },
    {
      "title": "Chennai techie murder suspect: A portrait of an introvert",
      "content": "For the rest of his neighbours in Meenakshipuram, nothing seemed out of place: P. Ramkumar was taking his goats out to graze, like he usually does when he is at home. Until the night of Friday, when cops swarmed the house, they had no clue that the loner they knew was suspected of hacking a young woman to death at Nungambakkam Railway Station. Ramkumar is the son of Paramasivam, a daily wage earner with BSNL. His mother, Pushpam, is a agricultural worker and he has two sisters. After passing out in 2011 from a government school in the locality, he joined a course in mechanical engineering at Einstein College, Seethaparpanallur. He completed the course in 2015, but couldn’t get a job. Ramkumar left for Chennai three months ago after telling his parents that he was planning to get coaching to clear five arrear papers and get a job. When he returned last week, he told them he had been ill and hadn’t been able to find a job. Meenakshipuram was in the news in the 1980s when more than 60 per cent of its residents, all Dalits, embraced Islam, alleging discrimination by caste Hindus. On Friday, the hamlet was abuzz with activity after the ‘invasion’ by the police and the media. “He has brought disrepute to us,” says Barakath, who runs a small shop at the end of Ambedkar Street on which Ramkumar’s house is also located.  Most stories about Ramkumar end up referring to his reclusive nature. A few residents of Meenakshipuram say he was probably ‘friendless’. Some of his classmates The Hindu tried to reach could not remember him, or refused to comment. “He never mingled with other children and was always aloof. He never took part in any cultural or sports programmes. This trait continued even in college,” says a faculty member. His relative Papa recalls he would take the goats out to graze during his college days and would be alone at home after returning from the forest.  True to character, he did not speak to anyone even at the A.S. Mansion he stayed in, in Chennai. “Many did not even know he stayed there. He used to go to his room through a small gate near the main entrance,” says a resident of the mansion. “From Swathi’s friends, we learnt that she used to walk back from the railway station through 8 street, Sowrashtra Nagar, to reach her house. The suspect must have seen her then,” says a police source.  Published - July 03, 2016 08:05 am IST  Chennai / murder / Tirunelveli / arrest "
    },
    {
      "title": "Gang murders AMMK party functionary in Chennai, police form special teams to nab culprits",
      "content": "The Nolambur police have formed special police teams to apprehend a gang who murdered Jagan, a party functionary of the AMMK, near Reddypalayam, on the night of Tuesday, September 5, 2023. Jagan was running a fish shop in the locality.  A senior official of the Chennai City Police said Jagan was a native of Tiruvarur district, who had switched allegiance from the AIADMK to AMMK recently.  The victim had had a running dispute with another individual Rajesh, over the installation of flex banners several years ago. Rajesh was murdered by a gang in 2021, and Jagan was arrested along with 11 other persons by the police of Tiruvarur district.  Having come out on bail recently Jagan was living in hiding in Nolambur by operating a fish shop. On Tuesday night, a gang of four persons used the knife at the shop, kept there to cut fish, to murder him and escaped.   Published - September 06, 2023 11:42 am IST  Chennai / murder / police / crime, law and justice "
    },
    {
      "title": "Woman working in a software company murdered in Chennai",
      "content": "The Tambaram Police Commissionerate arrested a 26-year-old person accused of murdering his 24-year-old friend on December 23 night A senior police official of Tambaram Commissionerate said R. Nadini, a native of Madurai, was working in a software company for more than eight months on Rajiv Gandhi Salai. She was staying along with Vetrimaran alias Pandi Maheshwari, who was also from Madurai, in Thalambur.  Vetrimaran, a transgender, was a childhood buddy and was in love with Nandini. As Nandini did not reciprocate her love and refused to marry, Vetrimaran planned to murder her, police said. The accused in the guise of giving a surprise gift for her birthday which falls on December 24, took her to a secluded place in Vedagiri Nagar of Ponmar and hit her with a sharp object. After she fell down the accused chained her with iron chains both her legs and hands and burnt her with petrol. The nearby residents on seeing something burning rushed to the place and on finding her fighting for her life took her to a nearby private hospital where she was pronounced brought dead.  The Thalambur police sent the body to Chromepet Government hospital for postmortem.   Published - December 24, 2023 01:21 pm IST  Chennai / murder / crime "
    },
    {
      "title": "Woman who went missing found murdered near Kayar forest",
      "content": "A 38-year-old woman who went missing was found murdered and dumped in a wooded area near Kayar forest on Saturday, March 8, 2025. The woman had gone missing from home on March 3.  A senior official of the Tambaram Police Commissionerate said S. Selvarani was married to Shankar of Perumal Koil Street in Nallambakkam and has a daughter. Selvarani who was working as a house-keeping staff in a private college in Thalambur had not returned home on March 3.  Based on the complaint filed by her husband, the Thalambur police filed a woman missing complaint and during investigation found out that Selvarani was having an illicit relationship with a 31-year-old person named Kumaresan of the same locality. Kumaresan had taken Selvarani to Kayar forest on March 3 evening where they had a heated argument during which Kumaresan reportedly murdered her.  The Thalambur police sent the body to the Government Chengalpattu hospital for post-mortem and have arrested the accused.   Published - March 09, 2025 03:11 pm IST  Chennai / murder / crime "
    },
    {
      "title": "T.N. BSP chief Armstrong murder: Accused Thiruvengadam killed in police encounter at Chennai",
      "content": "A 33-year-old history sheeter who is one of the 11 persons arrested for the involvement of the murder of Bahujan Samaj party (BSP) leader K. Armstrong was killed in an encounter near Madhavaram on Sunday morning. The police team fired at the accused when he tried to escape by firing at the police team. Armstrong was murdered by a gang near his house in Perambur on July 5.  A senior official of the City police said K. Thiruvengadam was one of the main culprits involved in planning the murder of Armstrong along with the main accused Ponnai Bala, who is the brother of murdered history sheeter Arcot Suresh. Thiruvengadam who is from Kundrathur has a total of five criminal cases pending against him, including three murder cases, notably the murder of Thennarasu, a close confidante of Armstrong, near Thamaraipakkam Koot Road in 2015.   Police officers are conducting investigation at the spot, Vegetarian Nagar, Madhavaram in Chennai, where the accused Thiruvengadam who was one of the accused in the murder of BSP state leader K. Armstrong, was killed in police encounter on July 14, 2024 | Photo Credit: B. Jothi Ramalingam  The police official said in addition to the Thennarasu murder, Thiruvengadam is the accused in two murder cases registered in Kundrathur police station. Also he is accused in a case relating to robbery in Mangadu station.  The Sembium police which was probing the murder case had taken five-day custody of the 11 accused persons lodged in Poonamallee prison. A police team from Kodungaiyur had taken Thiruvengadam to Manali reportedly to recover the weapons used for the murder in the early morning on Sunday.  When the security vehicle reached the goat market near Red Hills, he requested to be allowed to answer nature’s call. When he was allowed, he escaped from the police and hid in a tin-roofed shed in Vegetarian street in Madhavaram.  Also read | Politics, gang rivalries and revenge murders in Tamil Nadu The police team, bolstered with additional forces, identified the location of the accused hiding in the tin-shed, where they claimed the plan to murder Armstrong was hatched, and approached him. However Thiruvengadam started firing at them with a country revolver, and the police had to return fire, sources said.  Thiruvengadam was hit in the abdomen and chest. The police team rushed him to a private hospital where he was pronounced brought dead.  The Puzhal police on filing a case have sent the body to Government Stanley hospital for post mortem.   Published - July 14, 2024 09:05 am IST  murder / police / Tamil Nadu / Bahujan Samaj Party / crime / Chennai "
    },
    {
      "title": "Eight-member gang murders history-sheeter in Chennai",
      "content": "A 40-year-old history-sheeter, residing in Adambakkam, was murdered by an eight-member gang near his house on Wednesday night, leading to tension in the locality. The special police teams have apprehended two persons in this regard. They were identified as B. Vicky alias Tamil Arasan of Adambakkam and D. Manikandan of Alandur. While three persons have surrendered in court, the police have launched a search for the remaining three members of the gang.  A senior official of the Greater Chennai Police said Srinivasan, a resident of Ambedkar Nagar 3rd Street of Adambakkam, had two murder and other criminal cases pending against him under the Adambakkam station limits. The cases were registered in 2014 and another in 2021, for the murder of an individual, Nagoor Meeran.  On Wednesday night, after attending the funeral of a relative, Srinivasan was sitting outside his house, when an eight-member gang on four two-wheelers suddenly came and assaulted him with weapons. His two sons, seeing their father being assaulted, tried to protect him but they also received knife wounds. Srinivasan, having sustained severe injuries to various parts of his body, died on the spot.  The Adambakkam police on being alerted about the murder, went to the site and sent the body to the Government Chromepet Hospital for a post mortem. His two sons, Nagaraj (17) and Prathap (15) who had sustained minor injuries, were sent to the Government Royapettah Hospital for treatment.   Published - May 18, 2023 05:07 pm IST  Chennai / murder / police "
    },
    {
      "title": "Gang murders suspect, advocate",
      "content": "A suspect in an Explosives Act case and his advocate were murdered by a gang at Kummananchavidi in Poonamallee near here on Friday. According to police sources, Chenna alias Chenna Kesavalu (43) of Pulianthope had come to a special court in Poonamallee where an Explosive Act case, in which he was an accused, came up for judgement. During lunch break, Chenna was relaxing in a car after having lunch at Kumananchavidi when a gang armed with deadly weapons attacked him. The accused broke the wind shield and hacked Chenna to death. His advocate Bhagat Singh (26), who was in another car, was also attacked. Bhagat suffered a head injury and died hours after admission in a private hospital. Chenna was arrested by the police in about 23 criminal offences, most of which ended in acquittal. He was detained under the Goondas Act in 1994, 1996 and 2003. Chennai Suburban Police Commissioner S.R. Jangid and Deputy Commissioner of Police (St. Thomas Mount) V. Varadaraju visited the scene of crime. Six special teams, led by Additional Deputy Commissioner of Police S. Jayakumar, have been formed to apprehend the assailants, the sources said. “Chenna had come to the court in connection with a dacoity and Explosives Act case registered against him by the Mambalam police in 2001. A woman advocate who was sitting in the rear seat of the car escaped unhurt. There are four cases pending against him, including a murder case at Madhavaram,” a police official said.  Published - May 01, 2010 01:49 am IST  Chennai / murder / gangs & organised crime "
    },
    {
      "title": "History sheeter ‘Kakkathoppu’ Balaji shot dead by police in Vyasarpadi, Chennai",
      "content": " Police personnel at the BSNL quarters in Vyasarpadi, where Balaji was shot dead, on Wednesday. | Photo Credit: B. JOTHI RAMALINGAM  History-sheeter R. Balaji, alias ‘Kakkathoppu’ Balaji, 44, was shot dead by the police at a secluded place in Vyasarpadi on Wednesday.  According to the police, they shot at him in self-defence when Balaji opened fire at them. He was wanted in several criminal cases for offences, including murder.  Police sources said that a special sub-inspector (SSI) and a head constable had intercepted a car at Mullai Nagar in the early hours of Wednesday. Two persons were inside the vehicle, and when the policemen questioned the person next to the driver about the contents of his bag, he refused to respond.  Growing suspicious, they asked him to step out of the vehicle and began quizzing him. However, even as the questioning was under way, the driver sped away. The SSI informed the control room, which then issued an alert. Soon after, Kodungaiyur police inspector Saravanan, who was at the Mullainagar-Vyasarpadi road, spotted the car. Along with a few police personnel, he chased down the car as it entered the BSNL quarters in Vyasarpadi, the sources added. Suddenly, the driver got out of the car and opened fire at the policemen with a country-made gun. A bullet hit the police vehicle. As he continued to shoot despite the inspector’s warning, the latter opened fire at him in an act of self defence. Later, the man was rushed to a hospital where the doctors declared him dead, Pravesh Kumar, Joint Commissioner of Police, North, said.  Ten kg of ganja and a knife were recovered from the car. The deceased was identified as Balaji, who had over 55 criminal cases – six for murder; 17 for attempt to murder; one for ganja trafficking; and 34 other cases – against him. Mr. Kumar said the police have detained Sathyamurthy, who was travelling with Balaji. A case has been registered. A magistrate has begun an inquiry into the cause of the death. The body was sent for post-mortem.  Published - September 18, 2024 09:46 am IST  Chennai "
    },
    {
      "title": "Two young men held for murder in Chennai",
      "content": "Abhiramapuram Police on Thursday arrested two young men for allegedly hacking a 34-year-old man to death due to previous enmity, in Raja Annamalaipuram.  Police said S. Sathish, 34, was a resident of Kutti Gramani Garden. He had frequent quarrels with his nephew Ranjith due to a dispute about rearing pigeons on his terrace. At 11.30 p.m. on Wednesday, while Sathish was standing near his house, Ranjith, who came there with his friend Hariharan, brutally attacked Sathish and later hacked him to death. Then they fled the scene.  On receiving information, Abiramapuram police reached the spot and recovered the body. Police registered a case following a complaint from Srinivasan, brother of the deceased, and began an investigation.  R. Ranjith, 20 of Raja Annamalaipuram and his friend V. Hariharan, 19 of Mylapore were arrested. A knife and a bike were seized from them. Both were remanded in judicial custody.    Published - January 27, 2022 04:29 pm IST  Chennai "
    },
    {
      "title": "Armstrong murder case: Three more persons including a woman advocate arrested",
      "content": "The Sembium police which is probing the murder of BSP leader K. Armstrong has arrested three more persons including a woman advocate on Wednesday, July 17, 2024. BSP leader Armstrong was murdered by a gang on July 5 near his house in Perambur.  The Sembium police which had arrested 11 persons in relation to the murder had on Sunday killed an accused Thiruvengadam in a police encounter when he tried to escape near Madhavaram.  A senior official of the City police said the arrest of the three persons including advocate Malarkodi, who is the wife of slain history sheeter Thottam Sekar and Hariharan and Satish, were based on the investigation carried with three main accused - Ponnai Balu, who is brother of murdered Arcot Suresh, Thirumalai and Balu. The 11 accused were given five-day police custody.  Also read: Politics, gang rivalries and revenge murders in Tamil Nadu  The three persons were arrested based on the investigation with the three main accused in which huge cash transactions were settled to Malarkodi and Hariharan. Satish had helped the accused by giving a vehicle for the gang to escape, the police official added.  A total of six persons were interrogated last week of which three persons have been arrested.   Published - July 18, 2024 01:19 pm IST  arrest / Tamil Nadu / Chennai "
    },
    {
      "title": "Kodanad estate murder case: Chennai police team arrests duo in Delhi",
      "content": "K.V. Sayan and Valayar Manoj — two suspects in the 2017 dacoity and murder at former Tamil Nadu Chief Minister Jayalalithaa’s estate in Kodanad — who in a video conversation with journalist Mathew Samuel sought to link Chief Minister Edappadi K. Palaniswami with the break-in at the estate were arrested by a special team of the Chennai police in New Delhi on Sunday.  The video was released at a press conference addressed by Mr. Samuel and the two suspects in Delhi on Friday last. The Central Crime Branch of the Chennai Police had registered a case against Mr. Samuel and others on charges of “promoting enmity between different groups” and “doing acts prejudicial to maintenance of harmony” on a complaint lodged by the ruling AIADMK’s Information Technology wing. The police have also accused the journalist of “publishing and circulating a rumour with intent to cause, or which is likely to cause, fear or alarm to the public, or to any section of the public whereby any person may be induced to commit an offence against the State or against the public tranquillity.” Mr. Mathew in a Facebook post on Sunday said he stood by his report. Soon after the arrest, Mr. Samuel in a video message circulated on WhatsApp claimed that the police came to Sector-9 in Dwaraka and forced Sayan and Manoj into a private vehicle with a police sticker. “They were kidnapped,” he claimed. In the 16-minute video released in New Delhi, Sayan and Manoj had claimed that key conspirator Kanakaraj (since dead) had told them about his proximity to Mr. Palaniswami. However, the Chief Minister dismissed the allegations as baseless and said strong action would be taken against those behind the making of the video. Parrying questions on the contents of the First Information Report, a senior officer of the Chennai Police said that preliminary investigation had revealed that the people involved in the making of the video tried to establish contact with some sources to “negotiate” a deal. Refusing to elaborate the details of the negotiation or nature of the alleged deal, the officer said more information would be known only after the arrest of all the persons in the “conspiracy”.  Published - January 13, 2019 11:19 pm IST  Tamil Nadu / murder "
    },
    {
      "title": "Three accused in Chennai triple murder case nabbed in Maharashtra",
      "content": " Three persons who fled after committing a triple murder in Sowcarpet have been apprehended by a special team of police personnel near Solapur, Maharashtra, after a film-style chase.  On Wednesday night, Dileep Thalil Chand, 74, who ran a finance firm and his wife Pushpa Bhai, 68, and their son, Shithal Kumar, 42, natives of Rajasthan were found dead at their house on the first floor of a three-storey residential apartment on Vinayaga Maestri Street in Sowcarpet. Police said they were gunned down by the unidentified assailants. Five special teams were formed to trace the suspects City Police Commissioner Mahesh Kumar Aggarwal said, “Since the accused are from Pune, we contacted the Pune police and also sought assistance from Solapur since their location was identified as Solapur. We have conducted an interstate operation with the assistance of the police in Andhra Pradesh, Karnataka and Maharashtra and have nabbed the three accused successfully near Solapur after a chase. They will be brought to the city after obtaining transit remand from a local court.” At 3.30 a.m. on Friday, the special team led by inspector P. Jawahar and sub-inspector Ashok spotted a car and the suspects inside it, near Solapur, crossing them in the opposite direction. Upon spotting the car, the special team took a U-turn and chased it. After a short distance, they overtook the fleeing vehicle and intercepted it. The suspects -- Kalaish, 32, a brother of the prime accused Jayamala (daughter-in-law of Dileep Chand) and his associates -- Ravindranath Kher, 25, of Kolkata and Vijay Uttham Kamal, 28, of Pune, were apprehended. Jayamala from Pune, and Shithal Kumar got married through a matrimonial website, 10 years ago. She complained of harassment, and was estranged from her husband and had left her matrimonial home last January. She was living with her two children and her parents in Pune. Kumar had filed a case in the city’s family court in this regard. The Commissioner said both sides had preferred criminal complaints against each other in Chennai and Pune. Police got vital clues about the suspects from a criminal case which was under investigation by the Elephant Gate police following a prior complaint from the family alleging that a few persons came in an autorickshaw and threatened them. He said six persons -- Jayamala, her two brothers and three more persons who are friends -- came all the way from Pune during that incident. “This was a planned murder by them. They came with a plan to murder and brought the weapons from Pune,” said Mr. Aggarwal. He added that three more persons including Jayamala, her brother Vilash , and one more suspect, who are still at large would be soon apprehended and a special team has been deputed to trace them. Additional Commissioner of Police, North, A. Arun said, “Our personnel have been working day and night to solve the case and are on the job to trace the remaining accused.” Police recovered two weapons including a .32 bore revolver from Kailash and other suspects. Kailash allegedly confessed that Jayamala had been harassed by the family for a long time. They had taunted her about her caste and poor family background. Attempts to negotiate alimony with the family had failed. Annoyed over filing her in-laws filing a case against her, Jayamala and her brothers came down with three friends. Kailash and one of his friends fired five rounds and shot down three people before escaping in two cars, said police sources.  Published - November 13, 2020 05:12 pm IST  crime / murder / police / Chennai "
    },
    {
      "title": "Chennai police arrest four for abduction and murder",
      "content": "The CMBT police on Saturday arrested four men, including a financier and a junior film artiste, for allegedly murdering a 50-year-old man at a house in Nolambur after abducting him from a restaurant in Koyambedu, and then burning the body in a dumpyard near Mangadu.  Police sources said the victim has been identified as B. Babuji, who was working as a collection agent with a financier and was temporarily residing in Ayanambakkam.  The accused persons who have been arrested have been identified as L. Venkatraman alias Chotta Venkat, 48 of Nolambur, a money-lender who has had transactions with film personalities, his associates, M. Ganapathy alias Saravanan, 29 of Maduravoyal, a collection agent, M. Dillip, 30, of Maduravoyal, a construction worker and M. Gopi alias Naveen, 47 of Purasawalkam, a junior film artiste.  Police sources said the victim Babuji was working with the main accused Venkatraman. He was recently sacked from his job, as he had alleged stolen a two-and-a-half sovereign gold chain from Venkataraman’s child. A complaint was lodged with the Nolambur police with regard to this, and is pending.  Following this, Babuji became associated with another individual, Gopal, who was an advocate and was involved in petty financing. He also cheated Gopal by swindling money. Babuji also allegedly abused Venkatraman among his friends.  On finding out that Babuji was dining at a popular hotel on 100 feet road in Koyambedu on Thursday night, Venkatraman and his associates abducted Babuji in a car and took him to the former’s house in Nolambur. Babuji was beaten brutally by the gang and died at 3 a.m. on Friday. The gang then took the body in a car to dispose of it and dumped it at a roadside garbage yard in Kolapakkam. They burnt the body by pouring petrol on it and setting it on fire.  On receiving information from the public, police personnel from Mangadu arrived and recovered the partially burnt body. Later, Assistant Commissioner of Police, Koyambedu, S. Ramesh Babu took up the investigation and arrested the four accused persons, including Venkatraman.  Police have launched a manhunt to nab Gopal and one more accused, both of whom are absconding.   Published - February 25, 2023 03:43 pm IST  Chennai / murder / police / crime "
    },
    {
      "title": "Seven persons arrested in Chennai for murder of drum-maker at Pulianthope",
      "content": "The Basin Bridge Police arrested seven persons in connection with the murder of a 41-year-old drum-maker of Pulianthope on Tuesday, June 2, 2024. The police are searching for three more accused.  A senior official of the City Police said S. Murugan, a resident of Sivarajapuram of Pulianthope, was engaged in making small drum musical instruments and was also a drum artist engaged in offering music service for funeral processions.  Murugan was engaged in making drum instruments on the first floor of his house when a group of seven persons headed by M. Velmurugan of Wall Tax Road came on Tuesday at around 3 p.m.  Claiming to have come to purchase drum instruments, they went to the first floor and after picking a verbal argument, severely assaulted Murugan with knives and escaped. Hearing the cries of Murugan seeking help, the residents of the locality rushed to the first floor and saw the victim suffering from several knife wounds in the head and body. Immediately, he was rushed to the Government Stanley Hospital where he died within a few hours.  The Basin Bridge Police filed a murder complaint and were searching for the accused based on the closed circuit television camera footage when seven persons surrendered in Kodungaiyur Police station in the evening of Tuesday.  The Kodungaiyur Police took the seven accused persons to the Basin Bridge police who during investigation of the accused found that the victim along with his brother had grievously assaulted Velmurugan’s elder brother in an earlier case in March 2021. Velmurugan’s brother had died within a few days for which Murugan and his brother had got acquittal recently.  Angered by this Velmurugan along with his friends Sanjay, Karthik alias Vasanth, Prabha alias Prabhakaran, Prem Kumar, Abiraj, Vijay, Surya, Khandiban, and Murugan, murdered the drum maker, police said. The police are searching for the three remaining accused including Surya, Khandiban and Murugan.   Published - July 03, 2024 03:02 pm IST  crime / murder "
    },
    {
      "title": "Septuagenarian man, daughter found dead in Chennai; doctor close to the family held",
      "content": "The bodies of a 78-year-old man and his 36-year-old daughter were found in a locked apartment under suspicious circumstances. Police identified the deceased as Samuel Sankar, 78, and his daughter Ann Cynthia, 37, both from Vellore. The duo had been residing in Thirumullaivoyal in order that he can get dialysis treatment at a private hospital in the city. According to police sources, relatives grew concerned after repeated attempts to contact them failed. When no response was received to phone calls, the Thirumullaivoyal Police were alerted. Officers traced the location using mobile phone signals and, upon breaking open the locked apartment, discovered the decomposed bodies. Inspector George Miller of Thirumullaivoyal Police sent the bodies for postmortem and launched an investigation. Scrutiny of Cynthia’s call records led them to Samuel Ebinezer, 34, a native of Orikkai, Kancheepuram district, who had studied medicine in Vienna and was reportedly in close contact with Cynthia. Police detained Ebinezer, who was staying in the same apartment complex.  Initial inquiries revealed that Cynthia, estranged from her husband, had moved to the apartment with her father based on Ebinezer’s suggestion. He had allegedly been providing medical treatment to her father, including dialysis procedures. Investigations suggest that Samuel Sankar died in September, allegedly due to improper treatment. A dispute between Cynthia and the doctor ensued, during which Ebinezer allegedly pushed her, rendering her unconscious. Panicking, he fled the scene, locking the apartment without informing authorities. Police are now probing whether Sampath’s death resulted from medical negligence or natural causes. Additionally, they are investigating the exact circumstances that led to Cynthia’s death. Authorities also noted that the air-conditioner had remained on for some time after the deaths. Police suspect that a chemical, possibly camphor, was used to suppress any odour, as no neighbours had reported anything unusual. Further investigations are underway to corroborate the doctor’s confession and establish a clear sequence of events.  Published - January 31, 2025 01:10 am IST  murder / Chennai "
    },
    {
      "title": "History-sheeter killed in Chennai",
      "content": "A history-sheeter was hacked to death by a gang in Adambakkam on Thursday.  The victim was identified as Nagoor Meeran, 32. He was named an accused in the murder of a customs officer in 2013 and had other cases against him. He had a running feud with one Robin, another history-sheeter.   On Thursday, when he was visiting a woman in Adambakkam, a 10-member gang barged in, hacked him to death and fled. Five of them surrendered on Friday. A search is on for the others, the police said.  Published - October 15, 2021 11:13 pm IST"
    },
    {
      "title": "Man murders wife in Kannagi Nagar during spat",
      "content": " The Kannagi Nagar police arrested a 44-year-old for murdering his 38-year-old wife on Saturday.  A police official of Kannagi Nagar station said Thiagarajan was a painter and had been without any work since the COVID-19 pandemic whereas his wife Dhanalakshmi had to take up domestic jobs. Due to this, the couple had regular fights. On Saturday, Dhanalakshmi abused Thiagarajan for not going to work. In a fit of rage, Thiagarajan allegedly stabbed Dhanalakshmi with a kitchen knife.  On hearing Dhanalakshmi’s, the neighbours informed the Kannagi Nagar police who rushed to the slum and arrested the accused.   Published - May 01, 2022 09:57 pm IST  Chennai / murder "
    },
    {
      "title": "Police nab three of gang planning to kidnap, murder jeweller in Chennai",
      "content": "In a major operation, the Greater Chennai Police nabbed three men who were part of a gang from Thoothukudi who came to the city to murder a jeweller.  Greater Chennai Police Commissioner A. Arun received an alert that a gang of history-sheeters with weapons were in the city and were planning to murder a jeweller who might live somewhere between Adambakkam and Velachery. The police did not know the identifies of the target or the accused.  A special team under Joint Commissioner of Police (South) M.R. Sibi Chakravarthi swung into action, while another team analysed call records of a suspected person who was spotted in the area. In peak hour traffic, police personnel placed iron barricades in the middle of the roads in Velachery, Madipakkam, Adambakkam, and Taramani. They intensified vehicle checks at arterial junctions.  Initially, they managed to nab a suspect near Vijayanagar Bus Stand in Velachery. Based on his inputs, the police began tracing the other accused. Mr. Chakravarthi, in plainclothes, took a motorbike from SRP Tool side and proceeded towards Velachery. Four other police personnel followed him looking for the suspects.  Deputy Commissioner of Police (St. Thomas Mount) V.R. Srinivasan took an autorickshaw from the opposite side. They quickly narrowed down the movements of the suspects.  Mr. Chakravarthi intercepted a car near Taramani and inquired two persons who were in the car. He apprehended one of them after knowing that he was from Thoothukudi. Quickly, the other police personnel reached the spot and overpowered the duo. In the operation, Mr. Chakravarthi sustained a minor injury on his hand. The suspects were taken to Velachery police station for an inquiry, and they confessed their plan.  The police named three arrested suspects as A. Vinodh, 27, of Thalamuthu Nagar, Thoothukudi, A. Balamurugan, 23, of Manali, and L. Suresh, 35, of Madhavaram.  The police said the investigation revealed that the gang planned to kidnap and murder a jeweller or his son for money. Vinodh had previous criminal cases for offences, including murder, in Thoothukudi and the other two suspects had criminal cases for offences, including kidnapping.  A senior police officer said, “There were two groups staying in different places; one group came to show the target to the other group, who were to commit the crime. We aimed to nab them before the two groups met each other.”  Further investigation is on to trace two more suspects.   Published - March 16, 2025 01:17 am IST"
    },
    {
      "title": "Woman bank manager killed by drunken husband in Chennai",
      "content": "A 37-year-old woman bank manager died on Friday after her drunken husband hit her with a hammer, following a quarrel at their house in Padi. The victim was identified as Mano Bharathi, who was a resident of Kalaivanar Nagar, Padi. Police said she was a manager at a nationalised bank in Guindy. She and her husband, Achuthan fell in love 13 years ago and married. The couple have two daughters. The couple had frequent quarrels as Achuthan was unemployed and and addicted to alcohol. At 4 p.m on Friday, he was under the influence of alcohol and had a quarrel with her and in a fit of anger, he hit her head using a hammer. She was grievously injured and fell on the ground. Her mother took her in an ambulance to Rajiv Gandhi Government General Hospital. At around 8.30 p.m, she died without responding to the treatment. J.J.Nagar police registered a case of murder and apprehended Achuthan. Further investigations are on.   Published - July 03, 2021 11:47 am IST  Chennai / murder "
    }
  ]
}