{
  "searchQuery": "chennai murders",
  "length": 100,
  "result": [
    {
      "title": "In Chennai and its surroundings, a long tale of police encounters: 14 deaths, 10 encounters since 2019",
      "content": "From 2019 onwards, Chennai and its surrounding areas witnessed 10 extra-judicial killings by the police, involving 14 men, including history-sheeters.  On June 15, 2019, S. Vallarasu, 21, of Vysarpadi was gunned down by the police in Madhavaram. The police said he was a notorious history-sheeter and they were forced to shoot him because he had injured at least three police personnel. Vallarasu is said to have been involved in cases of murder, attempt to murder, and other criminal activities. The previous night, a resident of M.M. Garden, Vyasarpadi, called the police to complain that a few youth were causing a ruckus in the area. Two constables, S. Paunraj and Ramesh, went to the spot. They found Vallarasu drinking with his associates. On seeing the police, he whipped out a long knife and attacked Mr. Paunraj. Special teams were constituted to trace him, and he was traced to a truck terminal near the Madhavaram bus stand. There, he attacked two sub inspectors, Premkumar and Deepan, of the Vyasarpadi station. Sources said the police were left with little choice but to open fire at him.  On August, 21, 2020, the city police gunned down a 48 year-old history-sheeter, Shankar, when he allegedly attacked a police constable with a knife on New Avadi Road. Shankar had been detained under the Goondas Act on nine occasions. He was acquitted in a few cases. He had been involved in the attack on a Congress functionary and the owner of a supermarket. The previous night, Ayanavaram Police Inspector had detained Shankar in connection with cases related to murder and possession of ganja. At 6.30 a.m., he was taken to recover contraband, which was concealed in the debris dumped on a vacant plot near the Ayanavaram RTO on New Avadi Road. At the time, he allegedly whipped a knife from the place and allegedly attacked the police.  On October 10, 2021, a 28-year-old robbery suspect who was roaming with a weapon was shot dead in an encounter with police in Mevalurkuppam village near Sriperumbudur. The victim Murthaza, 28, a robbery suspect from Jharkhand was staying in a nearby village. He along with another associate allegedly indulged in at least three snatchings in Sriperumbudur previous night. The duo allegedly attacked a 55-year-old woman who was walking towards a bus stand and robbed her chain despite her resistance. On hearing her cries, the villagers launched a search to nab the duo who hid in a lake surrounded by forest area with thick bushes. Police also joined them and secured a suspect named Naem Akthar, 39, and another suspect was found in touch with him. A team went inside the adjoining area of a lake and the suspect Murthaza attacked one of our head constables using a knife. When the suspect went for a second attack, the inspector of the team opened fire on him in retaliation. The two men had been involved in the stabbing of a Tasmac staff member in the previous week.  Two history-sheeters, who were reportedly involved in a double murder, were gunned down by the police near Mamandur in Chengalpattu district on January 7, 2022. The dead were identified as Deena alias Dinesh, 24, and Biscuit alias Mohammed Moideen, 20, of Chengalpattu. Deena and Moideen were part of a six-member armed gang which murdered two rowdies — Appu alias Karthik, 30, of K.K. Street and Mahesh, 24, of Mettu Street — in the previous night in Chengalpattu. When a special team of police which went in search of him tried to round up the suspects at a forest adjoining the Palar at Irunkundrampalli, they threw bombs and attacked it with knives. An inspector opened fire in self-defence, said police.  At around 3 a.m. on August 1, 2023, police personnel who were conducting the checks on Karanai-Puducherry-Arungal Salai attempted to stop a speeding car. It came to a halt after bumping into a stationary police jeep. When police personnel tried to nab them, they attempted to use weapons. Police said the situation forced them to open fire on them. Vinodh alias Chotta Vinodh, 35, and Ramesh, 32, were shot dead by the police. Vinoth had a history-sheet on him at the Otteri police station and was an A+ category history-sheeter. He was involved in more than 50 offences — 10 murders, 15 attempt-to-murder cases, 10 robberies and 15 assault and extortion cases. Ramesh was an ‘A’ category history-sheeter at the Otteri station, and had more than 20 criminal cases pending against him.  On September 16, 2023, a 34-year-old history-sheeter namely A. Viswanathan alias ‘Kulla’ Vishwa was gunned down by the police on Saturday at Sogandy village near Sunguvarchatram as he allegedly tried to escape after attacking a police team that went to nab him in connection with a criminal case. He was from Kiloy village in Sriperumbudur taluk and was categorised as an A+ criminal in police records and had at least 25 cases for offences, including murders and attempt to murder, pending against him in Sriperumbudur, Oragadam, Sunguvarchatram and surrounding areas The police said he had indulged in extortion from the scrap businessmen and used to hold kangaroo courts in and around Sriperumbudur. Two murder suspects — Ragu alias Raguvaran, 38, and Hassan alias ‘Karuppu’ Hassan alias Batcha, 30 — who were involved in the murder of a history-sheeter in public were shot dead by police in Kancheepuram in the early hours of December, 27, 2023 when they reportedly attacked a police team who attempted to nab them. The special team who were searching for the suspects reached Indira Nagar following information that two of suspects were hiding there. When our personnel surrounded them at 5.30 a.m., they asked the duo to surrender. “Instead of surrendering, they attacked two of our personnel using knives. A sub-inspector in the team had to open fire in self-defence and to protect others,” said a police officer.  On October 12, 2023, Muthu Saravanan, 27, of Edapalayam and ‘Sunday’ Sathish of Gnayiru village near Redhills were gunned down by a special team of police personnel while they were hiding in a dilapidated house at Marambedu Kandigai on the Minjur-Vandalur Outer Ring Road. Both had been involved in murders and attempt to murders in the city and suburban areas..Muthu Saravanan and Sathish were hiding after they were involved in the murder of one Parthiban. Following receipt of information about the whereabouts of the duo, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects, said police.  On 14th July 2024, K. Thiruvenkadam, 33, a history-sheeter, one of the suspects who were arrested for the murder of Bahujan Samaj party (BSP) leader K. Armstrong was killed in the Puzhal Police station limits. Thiruvengadam had been involved in at least five criminal cases for offences including murder and robbery. Police said based on their confession, they took Thiruvenkadam with adequate security in a government vehicle to a house in Manali on Sunday morning to recover the weapons used for the murder. Then, he escaped from the police custody after getting down from the vehicle on the pretext of attending nature’s call and ran, pushing police personnel near Retteri. When a police team surrounded Thiruvenkadam who holed up at a place called Vegetarian village in Puzhal Police station limits early Sunday, he opened fire from an unlicensed weapon towards police personnel. Immediately, the police inspector opened fire from his service weapon towards Thiruvenkadam for self-defence.  On September 18, 2024, notorious history-sheeter Kakkathoppu Balaji was gunned down by police at a secluded place in Vyasarpadi. Police said Balaji had more than 50 criminal cases and was also wanted in a murder case. When he was surrounded, he opened fire at a police vehicle, and a police inspector retaliated by opening fire at him.  Human rights activists and advocates have condemned the series of encounters and said it should be prevented. People’s Union for Civil Liberties(PUCL) General Secretary V.Suresh said Tamil Nadu has always been a police state, irrespective of who is ruling the State. “If the police want to stop the crime it is not rocket science to bring it under control. Except, in Tamil Nadu, the nexus between the police force, politicians and various crime syndicates is too thick,” said Mr. Suresh.  Human Rights Advocate M. Pugazhendhi said in the last five years, a dozen cases of encounter deaths were reported in Chennai and suburbs. He said police personnel are continuing human rights violations. All these years, no police officers were properly prosecuted and sentenced for gunning down the accused. It is clear extra judicial killing.” “Self defence can be only proven in the court based on criminal laws until it is proven the police officer should be the murderer,” said Mr. Pugazhendhi.  I. Aseer, State coordinator of the Joint Action against Custodial Torture, said, “As per our calculation, from 1998 onwards, approximately 100 encounters were reported in the state. Wish to know whether the crime rate has decreased because of this.”  Henri Tiphagne of executive director of People’s Watch said, “I want rowdyism to be controlled; there is no second opinion about that. This is a very sad state of affairs. I want the people who break the law to be handled, but within the parameters of the law.”  Published - September 18, 2024 08:35 pm IST  Tamil Nadu / Chennai / encounters "
    },
    {
      "title": "Nine brutal murders in a house at Chennai’s Valasaravakkam 40 years ago\nPremium",
      "content": "In the morning of February 27, 1984, nine persons, eight of them belonging to a family, were found dead in mysterious circumstances at a house at Palaniappa Nagar, off Virugambakkam. The highly decomposed bodies were found lying in a heap in one of the rooms that was locked from outside. The dead included three brothers, the wives of two of them, and their three children. The ninth was an employee of a small-scale plastic factory, owned by the brothers at Virugambakkam. Though the cause of death was not immediately known, the police suspected that they should have been poisoned and murdered, a few days ago, presumably on a Friday.  The tragedy came to light around 5.15 a.m. on a Monday when the father in-law of one of the brothers arrived from Dharmapuri to visit his daughter. Seeing the doors locked and blood stains outside, he called out to the neighbours for help. The police broke open the door and found the corpses. Initially, the police suspected that the deaths could have been caused by poisoning, followed by stabbing and cutting. Some plates containing half-eaten food were found in the room. A couple of the bodies had ropes tied to the necks. Forensic experts were busy until the evening, taking the fingerprints and searching for other clues. Some injection needles were recovered from the vicinity. A police dog led them to a butcher shop nearby.  Neighbours told the investigators that no noise came from the house. The deceased were last seen on Friday. Jayaprakash, the brother-in-law of the eldest of the brothers, who was staying with the family, had told them on Saturday morning that everyone had gone to Tirupati on Friday night in a van. He himself was last seen on Sunday afternoon, when he went off in a motorcycle with two suitcases. The police began a search for him. Initial interrogation of a labourer at Valasaravakkam, close to the scene of crime, revealed that Jayaprakash had sought his help in digging a pit for a septic tank in the house on Saturday. The plan had, however, fallen through as the labourer felt that it was not feasible to scoop up the earth near the locked room for a septic tank. Enquiries were also made at a karate school at Mambalam where Jayaprakash had learnt the martial art.  Post-mortem revealed that of the nine killed, four men and two women had been hit from behind with a weapon similar to the butcher’s long knife which had sharp and blunt edges, as was evident from the uniform skull fractures and incised wounds on the chest, the neck and the hips. Strangulation with a rope had also been resorted to. Two girls, aged six and one, and a six-month-old infant had been killed by strangulation.  Jayaprakash, who was wanted for the murders, had sneaked into a students’ hostel at Triplicane, but escaped before a police team arrived. An associate of Jayaprakash at the hostel told the police that his friend was on his way to Tirupati. A police team went there. On March 1, the special team arrested Jayaprakash, 21, in Tirupati. He was brought to the city and remanded in judicial custody. He confessed to the murders. The victims included his sister, brother-in-law and their six-month-old baby. They were killed one after another between 3 p.m. and 10.30 p.m. on Friday because he was unable to bear with the humiliating treatment meted out to him by the family, he told the police.  The prosecution’s case was that between 3.30 p.m. and 10 p.m. on February 24, 1984, Jayaprakash caused the death of Narasimhan, his wife, their six-month-old male child, his brother Mani and his wife and their two female children aged six and two, another brother Arumugham, and Sekar, the employee in their factory at Palaniappa Nagar. He had beaten some of them with casuarina sticks and throttled them, and attacked some others with a knife and strangulated them with a rope. He pushed down a few and throttled them. A uniform pattern of attack was evident in all these murders, the prosecution said.  On May 26, the charge sheet was filed and the trial was conducted before the District Sessions Court, Chengalpattu. From his confession, Jayaprakash seemed to have had no peace of mind and he saw a Tamil film, Nooravadu Naal, directed by Manivannan. The theme of the film was the murder of two persons and the attack on the third, who did not succumb to injuries. The prosecution said it was probable that to ensure that the victims should not be alive, Jayaprakash not only attacked them in the back of the head to make them unconscious but also resorted to strangulation by tying the necks with jute ropes.  The defence argued that the murders might have been committed by ruthless masked dacoits who were frequenting that locality and it was impossible for a single person to commit nine murders. The court dismissed the contention as being devoid of merit.  The court awarded the death sentence to Jayaprakash because of the magnitude of the crime and the brutal and inhuman manner in which the nine persons were murdered. On April 9, 1985, the Madras High Court confirmed the sentence. However, the execution was delayed.  G. Ramasubramanian, retired DIG, Prisons, said, “Then he was kept in the condemned prisoners’ cell, which was kept locked round the clock. The cell would be opened only by the jailer and not by any other officer. A guard would always be on duty in front of the cell. His lawyer appealed against the verdict before the higher courts. Subsequently, the death sentence was commuted to life imprisonment.”  In 1989, a Bench of the High Court commuted the death sentence to life imprisonment on the ground that there was a long delay on the part of the executive in disposing of his mercy petition. Subsequently, Jayaprakash was released from prison under an amnesty scheme and led a reformed life, prison sources said.  Published - February 04, 2024 10:34 pm IST  crime / murder "
    },
    {
      "title": "Six arrested for murder of history-sheeter in Chennai",
      "content": "The Ambattur police in Chennai have arrested six persons on charges of murdering a 24-year-old history-sheeter over a previous enmity. On Monday (December 30, 2024) evening, the police received information that a youngster was battling for his life after being brutally attacked by a gang at Muthamizh Nagar, Kallikuppam, Ambattur. The police arrived at the crime scene and shifted the injured man to Government Stanley Hospital for treatment.  The police then identified the man as ‘Lota’ Naveen, 24, who had criminal cases against him at Villivakkam police station. He died without responding to treatment on Tuesday (December 31, 2024).  During the course of the investigation, the Ambattur police found that at 5.30 p.m. on Monday, when Naveen was riding his two-wheeler towards his house in Tambaram, a group of men followed him on bikes at Kallikuppam, waylaid him, and attacked him with knives.  The police arrested six men, who have been identified as N. Ashok Kumar, 24, of Aminjikarai, R. Rajesh Kumar, 21, of Villivakkam, T. Albert, 23, of Redhills, A. Vijay Solomon, 21, of ICF, P. Iman, 20, of T.P. Chatram, and M. Vinodh Kumar, 21, of Pulianthope. They were remanded to judicial custody.  Naveen was allegedly murdered by the gang owing to a past rivalry over his involvement in two murders – of a person named Karunakaran, who was murdered in ICF in 2021, and that of Udayakumar, who was murdered in Villivakkam last year.   Published - January 02, 2025 03:11 pm IST  crime / police / Chennai "
    },
    {
      "title": "Out in the open: Chennai sees a spurt in daylight murders",
      "content": "At a time when the police are planning to bring the city under a web of CCTV cameras by September, goons seem to be undeterred by the possibility of getting caught in the act. In brazen attacks carried out in broad daylight, armed gangs — mostly hired goons — have started murdering people, history-sheeters, in particular, on roads in full public glare. Thirty-eight year-old Suresh was the latest victim. On Thursday morning, he was attacked and murdered by a gang near a school where he had dropped his children in the morning. School students and parents were witness to the brutal murder. “It was chilling. It happened at our doorstep. We may not be able to sleep for a week,” an eyewitness said. The daylight attacks are premeditated and usually carried out to settle scores due to previous enmity among anti-socials, police said. T.C.S. Raja Chockalingam, a former district judge, said, “Although the crime rate has drastically reduced over the years, the pattern of murders is changing. The offenders now plan and commit murders in public places and in broad daylight without any qualms.”   One such instance was the murder of J. Vijayakumar by a gang on a busy road in Mannady last November. The gang chased him when he came out of the George Town court. CCTV footage showed him running for his life in a narrow pathway and falling down. The gang took just 30 seconds to kill him and escape. Kandhan, a 43-year-old real estate businessman, was hacked to death in broad daylight by four persons, even as his college-going daughter watched helplessly in West Mambalam on the morning of January 9. On April 1, Harikrishnan, a murder suspect, was killed in the Vyasarpadi police station limits on a busy morning by a four-member gang. The incident was caught on camera and went viral on social media. The next day, ‘Muttai’ Gopi, a former gangster, stopped at a roadside tea stall at Moolakadai only to be hacked to death by a gang of six. Till June, 81 murders have been recorded in the city. Last year, 145 persons were murdered. Analysing the pattern of crime, M. Karunanidhi, a former police officer, said that several judicial interventions restrict police from functioning effectively. “These days, anti-social elements have no fear of police. Moreover, there is less interaction between the police and the public to identify criminals and detain them.” Asked about the increasing frequency of day-time murders, a police officer said that the movements of rowdies were restricted at night due to patrolling.  Published - July 14, 2018 01:09 am IST"
    },
    {
      "title": "Chennai college student murders mother, brother",
      "content": "The Thiruvottriyur Police on Saturday, June 22, 2024, arrested a 20-year-old for allegedly murdering his mother and his brother at their house on Wednesday.  The double murder only came to light only after two days, following the receipt of a WhatsApp message sent by the suspected murderer to a relative of the deceased.  The deceased have been identified as M. Padma, 45, who was an acupuncture therapist and her younger son M. Sanjay, 14, who was a class 10 student. Padma’s elder son M. Nithesh was studying at a city college. Her husband Murugan, worked as a crane operator in Oman while Padma stayed with her sons in Thirunagar First Street, Thiruvottriyur. Police sources said Padma’s niece Mahalakshmi received a WhatsApp message from her cousin Nithesh at 12.30 am on Saturday, stating that he had left his home after leaving his mobile phone and the key of the house in a bag near the house. She then went to his house and opened the door using the key. A foul smell emanated from the house, and she found the bodies of her aunt Padma and her other cousin Sanjay, their heads severed, and covered in plastic bags.  Mahalakshmi alerted the police control room. On receipt of information, police personnel from Thiruvottriyur station rushed to the spot and recovered the bodies and severed heads. Nithesh could not be traced. After sending the bodies to the Government Stanley Hospital for post-mortems, the police began an investigation.  Police quickly found and nabbed Nithesh who was sleeping on the beach in Thiruvottriyur on Saturday. He was taken to the police station and subjected to an interrogation. During the interrogation, police came to know that Nithesh had 14 arrears in his semester examinations and his mother had repeatedly scolded him for this.  At one point he had left home angry, but later, his friends had reunited him with his family. He reportedly told the police that his mother used to say his father’s earnings were not adequate to support the family and so, since he was constantly stressed, he was not able to perform well in college. He had believed that he would have to shoulder the responsibility of the family if his father’s earnings dwindled further. There was also other complications in the family and all of this, finally led him to murder his mother and his brother, he claimed. He had also decided to end his life later, he told police.  Police said that after the murders, he went with his friends to watch a film at a nearby theatre. He decided not to go ahead with his earlier plan to end his life out of to fear, and was just wandering around the beach, before he fell asleep and was found.  (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050)  Published - June 22, 2024 01:26 pm IST  Chennai / murder / family / police / crime "
    },
    {
      "title": "16-year-old domestic help found murdered at employer’s house in Chennai; police nabs six",
      "content": "A 16-year-old girl, who was engaged as a domestic aid by a businessman’s family was found dead at their house in Aminjikarai. After initial investigation, the police said it was a murder and that the girl had been tortured. Further investigation is on to establish who all are involved. The girl from Thanjavur was working at the rented house of Mohammed Nishad, 35, a businessman on Sadasivam Metha Street in Aminjikarai. She was under the care of her mother at her native after the demise of her father. She was brought to the city by two persons to be engaged in domestic work one and half years ago. On Friday, the house owner who came to know about the suspicious death alerted the police, who broke open the locked door of the house. The girl was found dead in the bathroom. The inmates of the house, including Mohammed Nishad, went missing. Aminjikarai Police registered a case and began an investigation after sending the body to Government Kilpauk Medical College Hospital for post-mortem. After intensifying the investigation, police picked up six persons including Nishad, his wife Nivetha alias Nasiya, 30, another couple who are their friends and frequently visited the house, and two others - a woman and her brother who helped the family engage the girl as domestic aid. Police said the body of the girl bore burn and strangulation marks. They said that on Deepavali day, she was tortured and beaten up by one of the suspects. She went into the bathroom and was lying motionless despite the family members’ repeated calls. On learning that she was dead, they locked the house and fled without informing anyone. One of them contacted a lawyer who, in turn, alerted the police.  They were staying at friends’ house from where the police nabbed them. Police said their probe ruled out any sexual assault on the girl. The National Federation of Indian Women condemned the alleged killing of the girl. It alleged that the girl collapsed due to the beating despite doing domestic chores properly on Deepavali day. It also wanted the police to conduct a thorough probe and get suitable punishment for the culprits.  Published - November 03, 2024 12:27 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Woman murders senior citizen in Perungudi railway station, arrested",
      "content": " The Thoraipakkam police arrested a 50-year-old woman for the murder of a 60-year-old resident of Kallukuttai on Saturday (August 17, 2024) night.  A senior officer of the city police said the victim C. Shankar, a construction worker residing in Thiruvalluvar nagar of Kallukuttai near Perungudi, used to sleep outside the Perungudi railway station. On Friday (August 16, 2024) night he had consumed liquor along with Muniyammal who also lived near the railway station.  On Saturday (August 17, 2024) morning, Muniyammal told the railway staff at the station that Shankar was not breathing and had left the place. Later, Thiruvanmiyur Government Railway police personnel visited the spot and found Shankar dead. After they sent his body to the Government Royapettah Hospital for post mortem it was found that he had been murdered.  After an investigation, police arrested Muniyammal on charges of killing the man. Police said she had been previously booked in a few cases of theft.  Published - August 18, 2024 02:58 pm IST  crime, law and justice / Chennai "
    },
    {
      "title": "Six-member gang arrested for murder of history-sheeter in Chennai",
      "content": "A six-member gang allegedly murdered a 33-year-old resident of New Washermenpet on Tuesday (January 14, 2025) night to avenge the killing of a history-sheeter.  The Fishing Harbour police, after registering a case, arrested the six people on Wednesday (January 15, 2025).  A senior official from the City Police said the deceased R. Ulaganathan lived with his wife Malathi at Thideer Nagar in New Washermenpet. He has several cases pending against him at the local police station on charges of smuggling narcotics, assault, and causing public nuisance.  The gang in question, led by Vallarasu, the son of another history-sheeter Desi alias Desingu, had a past enmity with Ulaganathan. Desi was murdered by a 10-member gang on April 24 last year, and Ulaganathan had given shelter to a few of the accused persons in Desi’s murder, including Gopi, Abhishek, and Venkatesh.  On Tuesday night, Vallarasu, along with five others, murdered Ulaganathan using deadly weapons, the police said. When his wife Malathi tried to stop the attack, she too was assaulted by the gang, inflicting serious injuries on her. The couple’s neighbours rushed them to the Government Stanley Hospital for treatment, but Ulaganathan died on the way. Malathi has been admitted to the intensive care unit (ICU) of the hospital.  The Washermanpet Police Deputy Commissioner formed a special task force to investigate the crime, and arrested the six persons, including Vallarasu. The others have been identified as: Anthony (who has a criminal record at Kasimedu police station), Ebenezer, Ezhilarasan, Manoj, and Gunasekar.   Published - January 15, 2025 11:51 am IST  crime / Chennai / murder "
    },
    {
      "title": "The toxic trail of syringe murders in Chennai",
      "content": "On April 27, Stephen (41), a Chennai-based businessman, was arrested on charges of murdering three persons in 2015 in three separate operations. According to police sources, what was striking about these murders was that he had administered a deadly injection to all three victims, with the help of his aides, through a novel method that made their deaths appear natural. It took the confession of his three aides, while they were being questioned by the police in connection with a burglary at Stephen’s house, to bring these murders to light. Stephen had removed the tip of an umbrella and made a provision for a syringe to be fitted in its place. He would fill the syringe with a deadly chemical, suspected to be potassium cyanide. Using this umbrella with a poisoned tip, his aides would gently inject the poison into a target. Nobody would know what was going on, not even the victim, who would die in ten minutes, after suffering a heart attack, police sources said. In this manner, Stephen had murdered two men, whose wives he was in relationships with, and also his brother-in-law. A recall While the report of these sensational murders was received with surprise by most of the city residents, for some, the case brought to mind a spate of Visha Oosi (poison injection) murders that rocked the city in the 1970s. These cases in the 1970s proved a challenge to the police; after they were cracked, these cases were established as case studies in the police academy. Seven people are said to have been murdered between December 1970 and October 1972, using poisoned syringes by a gang that included a drug store owner, T.V. Vaitheeswaran. According to the State Crime Branch, CID, which filed the chargesheet, Vaitheeswaran and his seven accomplices targeted persons coming into the city with large amounts of cash for business purposes. The victims included Vadivullan Chettlar of Karaikudi who was carrying Rs. 1.5 lakh, Shahul Hamll of Malaysia (Rs. 55,000), Buhan Thambi of Tirunellvelli district (Rs. 50,000), Siddique of Kayalpatnam (Rs. 60 000) and Mohammed Salai of Karaikal (Rs. 19.900). Thaika Thambi, the last victim, was murdered in October 1972. He was carrying 23 gold bits valued at Rs. 75.000. The eight, including Vaitheeswaran, were arrested and charged with conspiracy, abduction, robbery, drugging and murder. They gang members would posed as customs officers and under the pretext of interrogation, took them in a car to far-off places, drugged and murdered them on the way and took away their valuables. Their bodies were disposed of on the Tamil Nadu-Andhra border. The men are said to have injected pethedine into the victims after telling them it was a ‘truth serum’ used for investigation. The investigation was conducted under the supervision of Mr. S. Krishnaraj, Deputy Inspector-General of Police, CID and Mr. K. V. Gnanasambandam, Superintendent of Police, Crime Branch, CID. No connection However, police say Stephen, who committed the three murders with the umbrella fitted with a poisoned syringe, is unlikely to have been influenced by the cases from the 1970s. It is believed he chose the modus operandi after carrying out research on the internet. “He had tried different methods including using darts. Finally, he decided on using syringes,” said a senior police officer.  Published - April 30, 2016 08:46 am IST"
    },
    {
      "title": "Four murders reported in the suburbs of Chennai on Monday night",
      "content": "At least four murders and one more death suspected to be a murder were reported from the city’s suburbs on Monday night. The list of victims, included an autorickshaw driver in Tambaram, a lorry owner in Chromepet, a daily wager in Kundrathur, an elderly woman in Walajabad and a textile shop owner in Thirumullaivoyal. In Tambaram police limits, a 26-year-old history-sheeter driving an autorickshaw was hacked to death in Tambaram bus stand by five men, including an auto-stand union leader over rivalry in getting rides. Police sources said the deceased has been identified as Kathik Raja, 26, of Erikarai street, Irumbuliyur who was a history-sheeter. After 2018, he was not involved in any offence. He led a reformed life, married a woman and drove an autorickshaw for a living.  He had a running quarrel with one Anand who is an auto-union leader and a DMK functionary. Anand invited him for talks near the Tambaram bus stand. At 11.30 p.m., Karthik Raja and Anand reached the spot with their friends. While they were holding talks, things went south, a physical quarrel broke out. Anand and his associates hacked Karthik Raja to death using knives and then they fled the scene. The Tambaram Police recovered the body and arrested Anand, 40, and four others.  In Chromepet, a 50-year-old man was hacked to death following a quarrel that erupted over repayment of a loan he had given to one of his friends. The victim has been identified as Thomas, a resident of T.S.Lakshmanan Nagar, Chromepet. He owned a lorry and handled disposal of leather waste. He had lent ₹30,000 to Sabari, one of his friends, recently. As the former pestered the latter for repayment, a quarrel ensued.  On Monday night, Sabari invited Thomas near a temple on Thiruneermalai Salai, to repay the loan. When Thomas reached the spot, Sabari and others attacked him with knives even as they were talking. Thomas collapsed in a pool of blood and died on the spot. The Chromepet Police, after recovering the body, began an investigation and arrested Sabari.  A 65-year-old woman was found dead after strangulation in Kattavakkam village near Walajabad in Kancheepuram district. The victim has been identified as Suguna. She was living alone in her house after the demise of her husband while her sons lived in Tiruvallur district. Since she did not come out of the house on Tuesday and the house was locked outside, neighbours who grew suspicious, broke open the door and found her lying dead. Police suspected that unidentified persons must have entered the house on Monday night and strangled her. Gold jewellery, weighing eight sovereigns, was stolen. Police have launched an investigation to trace the suspects.  Another murder was reported from Thirumullaivoyal police limits on Monday night. A 48-year-old man, running a cloth store, was beaten to death by his brother-in-law. The victim has been identified as Gunasekaran, of Ravindran Nagar, Thirumullaivoyal, near Avadi. He visited his father-in-law’s house on Monday evening and scolded his brother-in-law Ganeshan, 52, for being unemployed. Both had a heated exchange of words. Irked over the rebuke, Ganeshan hit Gunasekaran with a wooden log. Gunasekaran, who was critically injured, died on the spot. Police arrested Ganeshan.  In Kundrathur police limits, a 30-year-old man died under suspicious circumstances, after a mild attack on Monday evening, by a bike-borne duo near Chembarambakkam lake, when they snatched his mobile phone. The victim has been identified as Rajesh, of Arcot, Villupuram district who had come with his family to work in a brick kiln in Therku Malayambakkam near Kundrathur to settle his loans. On Monday evening, when he had gone to the bank of Chembarambakkam lake to attend nature’s call, two men on a bike waylaid him and attempted to snatch his mobile phone. As he resisted their attempt, they hit him near his eyebrow, using the handle of a knife. He was treated in a private hospital. After returning home, he complained of chest pain and later died at a hospital without responding to the treatment. Police said the cause of death will be known only after receiving the post-mortem report. Police have registered a case of suspicious death and efforts are on to trace the suspects.   Published - May 28, 2024 09:29 pm IST"
    },
    {
      "title": "In Chennai and its surroundings, a long tale of police encounters: 14 deaths, 10 encounters since 2019",
      "content": "From 2019 onwards, Chennai and its surrounding areas witnessed 10 extra-judicial killings by the police, involving 14 men, including history-sheeters.  On June 15, 2019, S. Vallarasu, 21, of Vysarpadi was gunned down by the police in Madhavaram. The police said he was a notorious history-sheeter and they were forced to shoot him because he had injured at least three police personnel. Vallarasu is said to have been involved in cases of murder, attempt to murder, and other criminal activities. The previous night, a resident of M.M. Garden, Vyasarpadi, called the police to complain that a few youth were causing a ruckus in the area. Two constables, S. Paunraj and Ramesh, went to the spot. They found Vallarasu drinking with his associates. On seeing the police, he whipped out a long knife and attacked Mr. Paunraj. Special teams were constituted to trace him, and he was traced to a truck terminal near the Madhavaram bus stand. There, he attacked two sub inspectors, Premkumar and Deepan, of the Vyasarpadi station. Sources said the police were left with little choice but to open fire at him.  On August, 21, 2020, the city police gunned down a 48 year-old history-sheeter, Shankar, when he allegedly attacked a police constable with a knife on New Avadi Road. Shankar had been detained under the Goondas Act on nine occasions. He was acquitted in a few cases. He had been involved in the attack on a Congress functionary and the owner of a supermarket. The previous night, Ayanavaram Police Inspector had detained Shankar in connection with cases related to murder and possession of ganja. At 6.30 a.m., he was taken to recover contraband, which was concealed in the debris dumped on a vacant plot near the Ayanavaram RTO on New Avadi Road. At the time, he allegedly whipped a knife from the place and allegedly attacked the police.  On October 10, 2021, a 28-year-old robbery suspect who was roaming with a weapon was shot dead in an encounter with police in Mevalurkuppam village near Sriperumbudur. The victim Murthaza, 28, a robbery suspect from Jharkhand was staying in a nearby village. He along with another associate allegedly indulged in at least three snatchings in Sriperumbudur previous night. The duo allegedly attacked a 55-year-old woman who was walking towards a bus stand and robbed her chain despite her resistance. On hearing her cries, the villagers launched a search to nab the duo who hid in a lake surrounded by forest area with thick bushes. Police also joined them and secured a suspect named Naem Akthar, 39, and another suspect was found in touch with him. A team went inside the adjoining area of a lake and the suspect Murthaza attacked one of our head constables using a knife. When the suspect went for a second attack, the inspector of the team opened fire on him in retaliation. The two men had been involved in the stabbing of a Tasmac staff member in the previous week.  Two history-sheeters, who were reportedly involved in a double murder, were gunned down by the police near Mamandur in Chengalpattu district on January 7, 2022. The dead were identified as Deena alias Dinesh, 24, and Biscuit alias Mohammed Moideen, 20, of Chengalpattu. Deena and Moideen were part of a six-member armed gang which murdered two rowdies — Appu alias Karthik, 30, of K.K. Street and Mahesh, 24, of Mettu Street — in the previous night in Chengalpattu. When a special team of police which went in search of him tried to round up the suspects at a forest adjoining the Palar at Irunkundrampalli, they threw bombs and attacked it with knives. An inspector opened fire in self-defence, said police.  At around 3 a.m. on August 1, 2023, police personnel who were conducting the checks on Karanai-Puducherry-Arungal Salai attempted to stop a speeding car. It came to a halt after bumping into a stationary police jeep. When police personnel tried to nab them, they attempted to use weapons. Police said the situation forced them to open fire on them. Vinodh alias Chotta Vinodh, 35, and Ramesh, 32, were shot dead by the police. Vinoth had a history-sheet on him at the Otteri police station and was an A+ category history-sheeter. He was involved in more than 50 offences — 10 murders, 15 attempt-to-murder cases, 10 robberies and 15 assault and extortion cases. Ramesh was an ‘A’ category history-sheeter at the Otteri station, and had more than 20 criminal cases pending against him.  On September 16, 2023, a 34-year-old history-sheeter namely A. Viswanathan alias ‘Kulla’ Vishwa was gunned down by the police on Saturday at Sogandy village near Sunguvarchatram as he allegedly tried to escape after attacking a police team that went to nab him in connection with a criminal case. He was from Kiloy village in Sriperumbudur taluk and was categorised as an A+ criminal in police records and had at least 25 cases for offences, including murders and attempt to murder, pending against him in Sriperumbudur, Oragadam, Sunguvarchatram and surrounding areas The police said he had indulged in extortion from the scrap businessmen and used to hold kangaroo courts in and around Sriperumbudur. Two murder suspects — Ragu alias Raguvaran, 38, and Hassan alias ‘Karuppu’ Hassan alias Batcha, 30 — who were involved in the murder of a history-sheeter in public were shot dead by police in Kancheepuram in the early hours of December, 27, 2023 when they reportedly attacked a police team who attempted to nab them. The special team who were searching for the suspects reached Indira Nagar following information that two of suspects were hiding there. When our personnel surrounded them at 5.30 a.m., they asked the duo to surrender. “Instead of surrendering, they attacked two of our personnel using knives. A sub-inspector in the team had to open fire in self-defence and to protect others,” said a police officer.  On October 12, 2023, Muthu Saravanan, 27, of Edapalayam and ‘Sunday’ Sathish of Gnayiru village near Redhills were gunned down by a special team of police personnel while they were hiding in a dilapidated house at Marambedu Kandigai on the Minjur-Vandalur Outer Ring Road. Both had been involved in murders and attempt to murders in the city and suburban areas..Muthu Saravanan and Sathish were hiding after they were involved in the murder of one Parthiban. Following receipt of information about the whereabouts of the duo, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects, said police.  On 14th July 2024, K. Thiruvenkadam, 33, a history-sheeter, one of the suspects who were arrested for the murder of Bahujan Samaj party (BSP) leader K. Armstrong was killed in the Puzhal Police station limits. Thiruvengadam had been involved in at least five criminal cases for offences including murder and robbery. Police said based on their confession, they took Thiruvenkadam with adequate security in a government vehicle to a house in Manali on Sunday morning to recover the weapons used for the murder. Then, he escaped from the police custody after getting down from the vehicle on the pretext of attending nature’s call and ran, pushing police personnel near Retteri. When a police team surrounded Thiruvenkadam who holed up at a place called Vegetarian village in Puzhal Police station limits early Sunday, he opened fire from an unlicensed weapon towards police personnel. Immediately, the police inspector opened fire from his service weapon towards Thiruvenkadam for self-defence.  On September 18, 2024, notorious history-sheeter Kakkathoppu Balaji was gunned down by police at a secluded place in Vyasarpadi. Police said Balaji had more than 50 criminal cases and was also wanted in a murder case. When he was surrounded, he opened fire at a police vehicle, and a police inspector retaliated by opening fire at him.  Human rights activists and advocates have condemned the series of encounters and said it should be prevented. People’s Union for Civil Liberties(PUCL) General Secretary V.Suresh said Tamil Nadu has always been a police state, irrespective of who is ruling the State. “If the police want to stop the crime it is not rocket science to bring it under control. Except, in Tamil Nadu, the nexus between the police force, politicians and various crime syndicates is too thick,” said Mr. Suresh.  Human Rights Advocate M. Pugazhendhi said in the last five years, a dozen cases of encounter deaths were reported in Chennai and suburbs. He said police personnel are continuing human rights violations. All these years, no police officers were properly prosecuted and sentenced for gunning down the accused. It is clear extra judicial killing.” “Self defence can be only proven in the court based on criminal laws until it is proven the police officer should be the murderer,” said Mr. Pugazhendhi.  I. Aseer, State coordinator of the Joint Action against Custodial Torture, said, “As per our calculation, from 1998 onwards, approximately 100 encounters were reported in the state. Wish to know whether the crime rate has decreased because of this.”  Henri Tiphagne of executive director of People’s Watch said, “I want rowdyism to be controlled; there is no second opinion about that. This is a very sad state of affairs. I want the people who break the law to be handled, but within the parameters of the law.”  Published - September 18, 2024 08:35 pm IST  Tamil Nadu / Chennai / encounters "
    },
    {
      "title": "Nine brutal murders in a house at Chennai’s Valasaravakkam 40 years ago\nPremium",
      "content": "In the morning of February 27, 1984, nine persons, eight of them belonging to a family, were found dead in mysterious circumstances at a house at Palaniappa Nagar, off Virugambakkam. The highly decomposed bodies were found lying in a heap in one of the rooms that was locked from outside. The dead included three brothers, the wives of two of them, and their three children. The ninth was an employee of a small-scale plastic factory, owned by the brothers at Virugambakkam. Though the cause of death was not immediately known, the police suspected that they should have been poisoned and murdered, a few days ago, presumably on a Friday.  The tragedy came to light around 5.15 a.m. on a Monday when the father in-law of one of the brothers arrived from Dharmapuri to visit his daughter. Seeing the doors locked and blood stains outside, he called out to the neighbours for help. The police broke open the door and found the corpses. Initially, the police suspected that the deaths could have been caused by poisoning, followed by stabbing and cutting. Some plates containing half-eaten food were found in the room. A couple of the bodies had ropes tied to the necks. Forensic experts were busy until the evening, taking the fingerprints and searching for other clues. Some injection needles were recovered from the vicinity. A police dog led them to a butcher shop nearby.  Neighbours told the investigators that no noise came from the house. The deceased were last seen on Friday. Jayaprakash, the brother-in-law of the eldest of the brothers, who was staying with the family, had told them on Saturday morning that everyone had gone to Tirupati on Friday night in a van. He himself was last seen on Sunday afternoon, when he went off in a motorcycle with two suitcases. The police began a search for him. Initial interrogation of a labourer at Valasaravakkam, close to the scene of crime, revealed that Jayaprakash had sought his help in digging a pit for a septic tank in the house on Saturday. The plan had, however, fallen through as the labourer felt that it was not feasible to scoop up the earth near the locked room for a septic tank. Enquiries were also made at a karate school at Mambalam where Jayaprakash had learnt the martial art.  Post-mortem revealed that of the nine killed, four men and two women had been hit from behind with a weapon similar to the butcher’s long knife which had sharp and blunt edges, as was evident from the uniform skull fractures and incised wounds on the chest, the neck and the hips. Strangulation with a rope had also been resorted to. Two girls, aged six and one, and a six-month-old infant had been killed by strangulation.  Jayaprakash, who was wanted for the murders, had sneaked into a students’ hostel at Triplicane, but escaped before a police team arrived. An associate of Jayaprakash at the hostel told the police that his friend was on his way to Tirupati. A police team went there. On March 1, the special team arrested Jayaprakash, 21, in Tirupati. He was brought to the city and remanded in judicial custody. He confessed to the murders. The victims included his sister, brother-in-law and their six-month-old baby. They were killed one after another between 3 p.m. and 10.30 p.m. on Friday because he was unable to bear with the humiliating treatment meted out to him by the family, he told the police.  The prosecution’s case was that between 3.30 p.m. and 10 p.m. on February 24, 1984, Jayaprakash caused the death of Narasimhan, his wife, their six-month-old male child, his brother Mani and his wife and their two female children aged six and two, another brother Arumugham, and Sekar, the employee in their factory at Palaniappa Nagar. He had beaten some of them with casuarina sticks and throttled them, and attacked some others with a knife and strangulated them with a rope. He pushed down a few and throttled them. A uniform pattern of attack was evident in all these murders, the prosecution said.  On May 26, the charge sheet was filed and the trial was conducted before the District Sessions Court, Chengalpattu. From his confession, Jayaprakash seemed to have had no peace of mind and he saw a Tamil film, Nooravadu Naal, directed by Manivannan. The theme of the film was the murder of two persons and the attack on the third, who did not succumb to injuries. The prosecution said it was probable that to ensure that the victims should not be alive, Jayaprakash not only attacked them in the back of the head to make them unconscious but also resorted to strangulation by tying the necks with jute ropes.  The defence argued that the murders might have been committed by ruthless masked dacoits who were frequenting that locality and it was impossible for a single person to commit nine murders. The court dismissed the contention as being devoid of merit.  The court awarded the death sentence to Jayaprakash because of the magnitude of the crime and the brutal and inhuman manner in which the nine persons were murdered. On April 9, 1985, the Madras High Court confirmed the sentence. However, the execution was delayed.  G. Ramasubramanian, retired DIG, Prisons, said, “Then he was kept in the condemned prisoners’ cell, which was kept locked round the clock. The cell would be opened only by the jailer and not by any other officer. A guard would always be on duty in front of the cell. His lawyer appealed against the verdict before the higher courts. Subsequently, the death sentence was commuted to life imprisonment.”  In 1989, a Bench of the High Court commuted the death sentence to life imprisonment on the ground that there was a long delay on the part of the executive in disposing of his mercy petition. Subsequently, Jayaprakash was released from prison under an amnesty scheme and led a reformed life, prison sources said.  Published - February 04, 2024 10:34 pm IST  crime / murder "
    },
    {
      "title": "Six arrested for murder of history-sheeter in Chennai",
      "content": "The Ambattur police in Chennai have arrested six persons on charges of murdering a 24-year-old history-sheeter over a previous enmity. On Monday (December 30, 2024) evening, the police received information that a youngster was battling for his life after being brutally attacked by a gang at Muthamizh Nagar, Kallikuppam, Ambattur. The police arrived at the crime scene and shifted the injured man to Government Stanley Hospital for treatment.  The police then identified the man as ‘Lota’ Naveen, 24, who had criminal cases against him at Villivakkam police station. He died without responding to treatment on Tuesday (December 31, 2024).  During the course of the investigation, the Ambattur police found that at 5.30 p.m. on Monday, when Naveen was riding his two-wheeler towards his house in Tambaram, a group of men followed him on bikes at Kallikuppam, waylaid him, and attacked him with knives.  The police arrested six men, who have been identified as N. Ashok Kumar, 24, of Aminjikarai, R. Rajesh Kumar, 21, of Villivakkam, T. Albert, 23, of Redhills, A. Vijay Solomon, 21, of ICF, P. Iman, 20, of T.P. Chatram, and M. Vinodh Kumar, 21, of Pulianthope. They were remanded to judicial custody.  Naveen was allegedly murdered by the gang owing to a past rivalry over his involvement in two murders – of a person named Karunakaran, who was murdered in ICF in 2021, and that of Udayakumar, who was murdered in Villivakkam last year.   Published - January 02, 2025 03:11 pm IST  crime / police / Chennai "
    },
    {
      "title": "Out in the open: Chennai sees a spurt in daylight murders",
      "content": "At a time when the police are planning to bring the city under a web of CCTV cameras by September, goons seem to be undeterred by the possibility of getting caught in the act. In brazen attacks carried out in broad daylight, armed gangs — mostly hired goons — have started murdering people, history-sheeters, in particular, on roads in full public glare. Thirty-eight year-old Suresh was the latest victim. On Thursday morning, he was attacked and murdered by a gang near a school where he had dropped his children in the morning. School students and parents were witness to the brutal murder. “It was chilling. It happened at our doorstep. We may not be able to sleep for a week,” an eyewitness said. The daylight attacks are premeditated and usually carried out to settle scores due to previous enmity among anti-socials, police said. T.C.S. Raja Chockalingam, a former district judge, said, “Although the crime rate has drastically reduced over the years, the pattern of murders is changing. The offenders now plan and commit murders in public places and in broad daylight without any qualms.”   One such instance was the murder of J. Vijayakumar by a gang on a busy road in Mannady last November. The gang chased him when he came out of the George Town court. CCTV footage showed him running for his life in a narrow pathway and falling down. The gang took just 30 seconds to kill him and escape. Kandhan, a 43-year-old real estate businessman, was hacked to death in broad daylight by four persons, even as his college-going daughter watched helplessly in West Mambalam on the morning of January 9. On April 1, Harikrishnan, a murder suspect, was killed in the Vyasarpadi police station limits on a busy morning by a four-member gang. The incident was caught on camera and went viral on social media. The next day, ‘Muttai’ Gopi, a former gangster, stopped at a roadside tea stall at Moolakadai only to be hacked to death by a gang of six. Till June, 81 murders have been recorded in the city. Last year, 145 persons were murdered. Analysing the pattern of crime, M. Karunanidhi, a former police officer, said that several judicial interventions restrict police from functioning effectively. “These days, anti-social elements have no fear of police. Moreover, there is less interaction between the police and the public to identify criminals and detain them.” Asked about the increasing frequency of day-time murders, a police officer said that the movements of rowdies were restricted at night due to patrolling.  Published - July 14, 2018 01:09 am IST"
    },
    {
      "title": "Chennai college student murders mother, brother",
      "content": "The Thiruvottriyur Police on Saturday, June 22, 2024, arrested a 20-year-old for allegedly murdering his mother and his brother at their house on Wednesday.  The double murder only came to light only after two days, following the receipt of a WhatsApp message sent by the suspected murderer to a relative of the deceased.  The deceased have been identified as M. Padma, 45, who was an acupuncture therapist and her younger son M. Sanjay, 14, who was a class 10 student. Padma’s elder son M. Nithesh was studying at a city college. Her husband Murugan, worked as a crane operator in Oman while Padma stayed with her sons in Thirunagar First Street, Thiruvottriyur. Police sources said Padma’s niece Mahalakshmi received a WhatsApp message from her cousin Nithesh at 12.30 am on Saturday, stating that he had left his home after leaving his mobile phone and the key of the house in a bag near the house. She then went to his house and opened the door using the key. A foul smell emanated from the house, and she found the bodies of her aunt Padma and her other cousin Sanjay, their heads severed, and covered in plastic bags.  Mahalakshmi alerted the police control room. On receipt of information, police personnel from Thiruvottriyur station rushed to the spot and recovered the bodies and severed heads. Nithesh could not be traced. After sending the bodies to the Government Stanley Hospital for post-mortems, the police began an investigation.  Police quickly found and nabbed Nithesh who was sleeping on the beach in Thiruvottriyur on Saturday. He was taken to the police station and subjected to an interrogation. During the interrogation, police came to know that Nithesh had 14 arrears in his semester examinations and his mother had repeatedly scolded him for this.  At one point he had left home angry, but later, his friends had reunited him with his family. He reportedly told the police that his mother used to say his father’s earnings were not adequate to support the family and so, since he was constantly stressed, he was not able to perform well in college. He had believed that he would have to shoulder the responsibility of the family if his father’s earnings dwindled further. There was also other complications in the family and all of this, finally led him to murder his mother and his brother, he claimed. He had also decided to end his life later, he told police.  Police said that after the murders, he went with his friends to watch a film at a nearby theatre. He decided not to go ahead with his earlier plan to end his life out of to fear, and was just wandering around the beach, before he fell asleep and was found.  (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050)  Published - June 22, 2024 01:26 pm IST  Chennai / murder / family / police / crime "
    },
    {
      "title": "16-year-old domestic help found murdered at employer’s house in Chennai; police nabs six",
      "content": "A 16-year-old girl, who was engaged as a domestic aid by a businessman’s family was found dead at their house in Aminjikarai. After initial investigation, the police said it was a murder and that the girl had been tortured. Further investigation is on to establish who all are involved. The girl from Thanjavur was working at the rented house of Mohammed Nishad, 35, a businessman on Sadasivam Metha Street in Aminjikarai. She was under the care of her mother at her native after the demise of her father. She was brought to the city by two persons to be engaged in domestic work one and half years ago. On Friday, the house owner who came to know about the suspicious death alerted the police, who broke open the locked door of the house. The girl was found dead in the bathroom. The inmates of the house, including Mohammed Nishad, went missing. Aminjikarai Police registered a case and began an investigation after sending the body to Government Kilpauk Medical College Hospital for post-mortem. After intensifying the investigation, police picked up six persons including Nishad, his wife Nivetha alias Nasiya, 30, another couple who are their friends and frequently visited the house, and two others - a woman and her brother who helped the family engage the girl as domestic aid. Police said the body of the girl bore burn and strangulation marks. They said that on Deepavali day, she was tortured and beaten up by one of the suspects. She went into the bathroom and was lying motionless despite the family members’ repeated calls. On learning that she was dead, they locked the house and fled without informing anyone. One of them contacted a lawyer who, in turn, alerted the police.  They were staying at friends’ house from where the police nabbed them. Police said their probe ruled out any sexual assault on the girl. The National Federation of Indian Women condemned the alleged killing of the girl. It alleged that the girl collapsed due to the beating despite doing domestic chores properly on Deepavali day. It also wanted the police to conduct a thorough probe and get suitable punishment for the culprits.  Published - November 03, 2024 12:27 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Woman murders senior citizen in Perungudi railway station, arrested",
      "content": " The Thoraipakkam police arrested a 50-year-old woman for the murder of a 60-year-old resident of Kallukuttai on Saturday (August 17, 2024) night.  A senior officer of the city police said the victim C. Shankar, a construction worker residing in Thiruvalluvar nagar of Kallukuttai near Perungudi, used to sleep outside the Perungudi railway station. On Friday (August 16, 2024) night he had consumed liquor along with Muniyammal who also lived near the railway station.  On Saturday (August 17, 2024) morning, Muniyammal told the railway staff at the station that Shankar was not breathing and had left the place. Later, Thiruvanmiyur Government Railway police personnel visited the spot and found Shankar dead. After they sent his body to the Government Royapettah Hospital for post mortem it was found that he had been murdered.  After an investigation, police arrested Muniyammal on charges of killing the man. Police said she had been previously booked in a few cases of theft.  Published - August 18, 2024 02:58 pm IST  crime, law and justice / Chennai "
    },
    {
      "title": "Six-member gang arrested for murder of history-sheeter in Chennai",
      "content": "A six-member gang allegedly murdered a 33-year-old resident of New Washermenpet on Tuesday (January 14, 2025) night to avenge the killing of a history-sheeter.  The Fishing Harbour police, after registering a case, arrested the six people on Wednesday (January 15, 2025).  A senior official from the City Police said the deceased R. Ulaganathan lived with his wife Malathi at Thideer Nagar in New Washermenpet. He has several cases pending against him at the local police station on charges of smuggling narcotics, assault, and causing public nuisance.  The gang in question, led by Vallarasu, the son of another history-sheeter Desi alias Desingu, had a past enmity with Ulaganathan. Desi was murdered by a 10-member gang on April 24 last year, and Ulaganathan had given shelter to a few of the accused persons in Desi’s murder, including Gopi, Abhishek, and Venkatesh.  On Tuesday night, Vallarasu, along with five others, murdered Ulaganathan using deadly weapons, the police said. When his wife Malathi tried to stop the attack, she too was assaulted by the gang, inflicting serious injuries on her. The couple’s neighbours rushed them to the Government Stanley Hospital for treatment, but Ulaganathan died on the way. Malathi has been admitted to the intensive care unit (ICU) of the hospital.  The Washermanpet Police Deputy Commissioner formed a special task force to investigate the crime, and arrested the six persons, including Vallarasu. The others have been identified as: Anthony (who has a criminal record at Kasimedu police station), Ebenezer, Ezhilarasan, Manoj, and Gunasekar.   Published - January 15, 2025 11:51 am IST  crime / Chennai / murder "
    },
    {
      "title": "The toxic trail of syringe murders in Chennai",
      "content": "On April 27, Stephen (41), a Chennai-based businessman, was arrested on charges of murdering three persons in 2015 in three separate operations. According to police sources, what was striking about these murders was that he had administered a deadly injection to all three victims, with the help of his aides, through a novel method that made their deaths appear natural. It took the confession of his three aides, while they were being questioned by the police in connection with a burglary at Stephen’s house, to bring these murders to light. Stephen had removed the tip of an umbrella and made a provision for a syringe to be fitted in its place. He would fill the syringe with a deadly chemical, suspected to be potassium cyanide. Using this umbrella with a poisoned tip, his aides would gently inject the poison into a target. Nobody would know what was going on, not even the victim, who would die in ten minutes, after suffering a heart attack, police sources said. In this manner, Stephen had murdered two men, whose wives he was in relationships with, and also his brother-in-law. A recall While the report of these sensational murders was received with surprise by most of the city residents, for some, the case brought to mind a spate of Visha Oosi (poison injection) murders that rocked the city in the 1970s. These cases in the 1970s proved a challenge to the police; after they were cracked, these cases were established as case studies in the police academy. Seven people are said to have been murdered between December 1970 and October 1972, using poisoned syringes by a gang that included a drug store owner, T.V. Vaitheeswaran. According to the State Crime Branch, CID, which filed the chargesheet, Vaitheeswaran and his seven accomplices targeted persons coming into the city with large amounts of cash for business purposes. The victims included Vadivullan Chettlar of Karaikudi who was carrying Rs. 1.5 lakh, Shahul Hamll of Malaysia (Rs. 55,000), Buhan Thambi of Tirunellvelli district (Rs. 50,000), Siddique of Kayalpatnam (Rs. 60 000) and Mohammed Salai of Karaikal (Rs. 19.900). Thaika Thambi, the last victim, was murdered in October 1972. He was carrying 23 gold bits valued at Rs. 75.000. The eight, including Vaitheeswaran, were arrested and charged with conspiracy, abduction, robbery, drugging and murder. They gang members would posed as customs officers and under the pretext of interrogation, took them in a car to far-off places, drugged and murdered them on the way and took away their valuables. Their bodies were disposed of on the Tamil Nadu-Andhra border. The men are said to have injected pethedine into the victims after telling them it was a ‘truth serum’ used for investigation. The investigation was conducted under the supervision of Mr. S. Krishnaraj, Deputy Inspector-General of Police, CID and Mr. K. V. Gnanasambandam, Superintendent of Police, Crime Branch, CID. No connection However, police say Stephen, who committed the three murders with the umbrella fitted with a poisoned syringe, is unlikely to have been influenced by the cases from the 1970s. It is believed he chose the modus operandi after carrying out research on the internet. “He had tried different methods including using darts. Finally, he decided on using syringes,” said a senior police officer.  Published - April 30, 2016 08:46 am IST"
    },
    {
      "title": "Four murders reported in the suburbs of Chennai on Monday night",
      "content": "At least four murders and one more death suspected to be a murder were reported from the city’s suburbs on Monday night. The list of victims, included an autorickshaw driver in Tambaram, a lorry owner in Chromepet, a daily wager in Kundrathur, an elderly woman in Walajabad and a textile shop owner in Thirumullaivoyal. In Tambaram police limits, a 26-year-old history-sheeter driving an autorickshaw was hacked to death in Tambaram bus stand by five men, including an auto-stand union leader over rivalry in getting rides. Police sources said the deceased has been identified as Kathik Raja, 26, of Erikarai street, Irumbuliyur who was a history-sheeter. After 2018, he was not involved in any offence. He led a reformed life, married a woman and drove an autorickshaw for a living.  He had a running quarrel with one Anand who is an auto-union leader and a DMK functionary. Anand invited him for talks near the Tambaram bus stand. At 11.30 p.m., Karthik Raja and Anand reached the spot with their friends. While they were holding talks, things went south, a physical quarrel broke out. Anand and his associates hacked Karthik Raja to death using knives and then they fled the scene. The Tambaram Police recovered the body and arrested Anand, 40, and four others.  In Chromepet, a 50-year-old man was hacked to death following a quarrel that erupted over repayment of a loan he had given to one of his friends. The victim has been identified as Thomas, a resident of T.S.Lakshmanan Nagar, Chromepet. He owned a lorry and handled disposal of leather waste. He had lent ₹30,000 to Sabari, one of his friends, recently. As the former pestered the latter for repayment, a quarrel ensued.  On Monday night, Sabari invited Thomas near a temple on Thiruneermalai Salai, to repay the loan. When Thomas reached the spot, Sabari and others attacked him with knives even as they were talking. Thomas collapsed in a pool of blood and died on the spot. The Chromepet Police, after recovering the body, began an investigation and arrested Sabari.  A 65-year-old woman was found dead after strangulation in Kattavakkam village near Walajabad in Kancheepuram district. The victim has been identified as Suguna. She was living alone in her house after the demise of her husband while her sons lived in Tiruvallur district. Since she did not come out of the house on Tuesday and the house was locked outside, neighbours who grew suspicious, broke open the door and found her lying dead. Police suspected that unidentified persons must have entered the house on Monday night and strangled her. Gold jewellery, weighing eight sovereigns, was stolen. Police have launched an investigation to trace the suspects.  Another murder was reported from Thirumullaivoyal police limits on Monday night. A 48-year-old man, running a cloth store, was beaten to death by his brother-in-law. The victim has been identified as Gunasekaran, of Ravindran Nagar, Thirumullaivoyal, near Avadi. He visited his father-in-law’s house on Monday evening and scolded his brother-in-law Ganeshan, 52, for being unemployed. Both had a heated exchange of words. Irked over the rebuke, Ganeshan hit Gunasekaran with a wooden log. Gunasekaran, who was critically injured, died on the spot. Police arrested Ganeshan.  In Kundrathur police limits, a 30-year-old man died under suspicious circumstances, after a mild attack on Monday evening, by a bike-borne duo near Chembarambakkam lake, when they snatched his mobile phone. The victim has been identified as Rajesh, of Arcot, Villupuram district who had come with his family to work in a brick kiln in Therku Malayambakkam near Kundrathur to settle his loans. On Monday evening, when he had gone to the bank of Chembarambakkam lake to attend nature’s call, two men on a bike waylaid him and attempted to snatch his mobile phone. As he resisted their attempt, they hit him near his eyebrow, using the handle of a knife. He was treated in a private hospital. After returning home, he complained of chest pain and later died at a hospital without responding to the treatment. Police said the cause of death will be known only after receiving the post-mortem report. Police have registered a case of suspicious death and efforts are on to trace the suspects.   Published - May 28, 2024 09:29 pm IST"
    },
    {
      "title": "Chennai crime: Murder in Mylapore",
      "content": "An eerie silence envelops the duplex house, ‘Mahalakshmi’, at 19, Dwaraka Colony in Mylapore on Saturday morning, so eerie that it belies the rather tumultuous events that this house stood witness to recently. Only last week did the house witness betrayal, assault and murder, all at once, in a mystery plot that rivalled Arvind Adiga’s award-winning novel The White Tiger. The gruesome double murder of Mylapore made the headlines in the city, and while the speedy cracking of the case was impressive, the case threw up concerns of the elderly living alone in the city.  Srikanth | Photo Credit: SPECIAL ARRANGEMENT  The couple who lost their lives tragically were R. Srikanth, 58, a chartered accountant and president, corporate finance, of the Gujarat-based Infibeam Avenues Ltd, and his wife Anuradha, 53, an engineering graduate and home-maker. While this strange story of betrayal has its beginnings from a previous generation, the current sequence of events can be said to begin last November. It was then that the couple flew to California, U.S., to visit their daughter, Sunanda, 28, a postdoctoral research fellow and their son Sashwath, 25, a medical student. They continued to stay in the U.S. to assist in the delivery of their daughter, and their bungalow in Chennai remained locked.  After six months in the U.S., they returned to Chennai on May 7, Saturday. It was 3.40 a.m. when they landed at the Chennai airport. As soon as they landed, the couple sent a selfie through WhatsApp to their son informing him of arrival at the airport. Srikanth also told his son that he was waiting for customs clearance, and their part-time driver Padam Lal Krishna, or Krishna, was waiting outside with the car. That was the last the world heard from the couple, the police said. One hour later, Sashwath called his parents up on their mobile phones, but there was no response. He then called Krishna about 8.30 a.m. and asked him why his parents were not answering his calls, the latter claimed that the couple were sleeping and he had come out to have breakfast. He promised to tell Srikanth to call Sashwath when he went back home. Again when he was called at 9.15 a.m., Krishna replied that he had come out to buy vegetables. Sashwath called again at 10.15 a.m. and he responded that he had been asked to go to their farmhouse on ECR. Later, Krishna’s mobile phone was also switched off. Sunanda smelt a rat, and tried to check the CCTV feed of the house online, but found it offline, and she was also worried that her parents’ mobiles were still turned off, this was unusual for them. Not willing to wait any longer, at 10.45 a.m., Sunanda made an international call to the emergency number 112 and the call landed at the police control room.   Anuradha | Photo Credit: SPECIAL ARRANGEMENT  On receiving the alert from the control room, a mobile patrolling team reached the spot and knocked on the door and reported back that there was no response from inside. Meanwhile, Mylapore inspector M. Ravi and P. Ramesh from Zamin Pallavaram, who is a relative, also reached the spot. They broke open the main door and entered the house.  After a search, it became clear that the couple were not inside the house. The driver Krishna and their silver-coloured car (Innova) were missing. One suitcase was found in the hall and two boarding passes on the dining table. The police said the kitchen seemed to have been cleaned with a disinfectant, and another suitcase was open on the first floor. Sashwath said his parents had carried five suitcases in all, and three of them were missing. He asked his relatives to check the locker which reportedly contained gold ornaments, cash and other valuables. The locker was empty and they could not find anything inside the locker, the FIR said. The police said that at this point, suspicion fell on Krishna. Krishna was a Nepalese national who had been working for them on and off for a decade and staying at their farmhouse at Soolerikadu near Nemilichery. His father had been in the employ of the family too. Additional Commissioner (South) N. Kannan says, “We found things were disturbed in the house and cupboards were open. Our inspector informed us that the utility area seemed to be washed off and faint blood stains were visible. Initially, we suspected that it was a kidnapping and the couple might be harmed. We thought they might have been abducted and left tied up in the farmhouse.”  Immediately, special teams were formed to trace the suspect and the couple and they fanned out to several places, including the farmhouse and toll plazas in surrounding areas of the city.  The team which went to the farmhouse reported back that there was no one there. But they found the remains of a burnt mobile phone and a burnt cloth lying near what seemed like freshly dug soil. The police then started to suspect murder.  Chennai City Police Commissioner Shankar Jiwal said, “Our investigation started around noon with six special teams. Of them, one scrutinised CCTV footage and another looked at call detail records. We also checked whether the car used by the accused had a FASTag. We immediately alerted all toll gates in the State and the Andhra Pradesh police to keep a watch for Krishna. We alerted two routes up to Vijayawada and Vishakapatinam and tied with Andhra Pradesh’s Additional Director-General of Police Ravi Shankar Ayyanar. He alerted all Superintendents of Police in the State.”  Mr. Jiwal continues, “We saw some messages from FASTag that showed that the car was moving on a highway in Andhra Pradesh. Our teams rushed there. The Ongole police laid a trap at one of their toll plazas. They stopped the car and in under six hours we found the driver and the car, at around 5.40 p.m.”  Mr. Kannan says, “We nabbed the accused in a record time in Ongole, which is 300 kilometres away from the city, and brought the accused to the city. With him, was his associate Ravi Rai. Over 1,000 sovereigns and silver articles, looted from Srikanth’s house, were also brought back.”  Both Krishna and Ravi Rai, a native of Darjeeling, on being apprehended by the police, confessed to have plotted and murdered Srikanth and Anuradha. They led the police to the farmhouse and the pits they had dug to bury the bodies. The bodies were exhumed.  Further investigation disclosed a horror tale, one that began rather sedately nearly two decades ago.  Krishna’s father Padam Lal Sharma had lost his job in an amusement park 20 years ago, and Srikanth stepped in and gave Sharma’s family shelter at the farmhouse. Sharma and his four sons, Krishna among them, had worked as gardener and security guard of the farmhouse since then. Krishna also served as a part time-driver with an IIT professor, the police said, but stepped up every time Srikanth required him for tasks. From 2019, Krishna was appointed to look after Srikanth’s aged parents living at Dwaraka Colony.  As Krishna recounted the sequence of events to the police, the threads of a cold tale of pre-meditated murder for gain unravelled.  On the day of occurrence, after bringing Srikanth and Anuradha back home from the airport, Krishna on the sly opened the suitcase to check for valuables he could steal. Disappointed with that, Krishna and Ravi hit Srikanth on the head with the wooden handle of a shovel and stabbed him on the neck with a knife. This was on the ground floor. They then went over to the first floor where Anuradha fell to a similar attack.  Then, they washed off the blood that had splattered on the floor of the utility area on the ground floor and the first floor using disinfectant. They took a bunch of keys from Srikanth’s body and opened the locker. They looted the jewellery and silver articles that were kept in the locker and also used bed sheets to cover the bodies.  Then came the second part of the plot. They moved the bodies into the car, and also the loot. By dawn, they were on the way to the farmhouse on the ECR. There, they claimed they had placed the bodies in a sitting position in a pit dug a couple of days ago.  They then covered the pit with soil and placed boulders on top so as to keep away stray dogs from disturbing the area. Then they drove the car away, hoping to make it to Nepal, and safety, said the police. A senior officer said that during interrogation, Krishna said he wanted money and he had learnt that Srikanth had completed a real estate deal recently that made him richer by ₹40 crore. “My son is studying in Darjeeling and I needed the money for his education. I am 40 years old already, and have to work my entire life as a driver. I thought I should settle down once and for all,” Krishna told the police. The police later said Krishna was able to loot 1,000 sovereigns of gold and 60 kg of silver articles from the Mylapore bungalow. The accused believed that if they escaped to Nepal, they would never be caught.  The murder has created a sense of apprehension among elders living in the city all by themselves. Pennathur Subramaniam Prabakar, a long-time resident of Mylapore and correspondent of P.S. Senior Secondary School, says, “It has also made us question the basis of our support system — people who help us. Also, the lesson is that we should be careful while discussing financial matters when support staff are around. We need to store our valuables and jewellery in bank lockers, especially when we are away from home for long periods.”  Keeping to themselves, especially in upscale areas or buildings, may not be a great thing, says Edwin Babu, joint director programmes, Helpage, as this makes them more vulnerable. “There are local residents associations, or senior citizens forums that they can be part of so that the members check on each other periodically. Children who live abroad and have aged parents living by themselves in rural or urban areas should also make it a point to engage with their neighbours as well as relatives in the same city from time to time — there should be a reliable, safe network around them,” he adds. “Earlier, the policeman who used to visit our apartment, would sign a book — the senior citizens police point book — which would remain with the apartment. This ritual has been given a go-by for reasons best known to the authorities, and it would be helpful if it is brought back,” says V.S. Jayaraman, of the T.Nagar Residents Welfare Association. Mr. Jiwal explains the facilities available, “We are already running helplines for the elderly that cater to 10 to 12 people per day, on an average. Now we are planning to intensify the entire exercise with the introduction of WhatsApp numbers for three categories of people — elderly couples staying alone, single elderly persons staying alone and elderly folks staying with their children. This are numbers they can message if they want any assistance from the police like regular visit or volunteers from NGO for even small issues or medical assistance. They can register with us and we will help out depending on the need. Another service we are providing now, but is not used so much, is verification of antecedents of support staff. This year it is free, but from next year, it will be done on payment of a fee.”  Senior citizen helpline: 14567 Elders helpline: 1253  National emergency number: 112  Police control number: 100  (With inputs from S. Poorvaja)  Published - May 14, 2022 11:52 pm IST"
    },
    {
      "title": "Gang murders son of a panchayat president near Chennai",
      "content": " An unidentified gang murdered the son of a panchayat president near Sunguvarchathiram on August 5 night by throwing country-made bombs and killing him with knives.  A senior official of the Kancheepuram Police said Albert was the son of Kumudha Dominique, a Dravida Munnetra Kazhagam (DMK) leader and president of Echur village panchayat. On August 5 night, Albert was riding his two-wheeler in his locality when an unidentified gang of five persons threw a country-made bomb on him.  When Albert tried to escape, the gang chased and murdered him with deadly weapons. Albert having suffered knife injuries in the face and body, was killed on the spot. Albert was operating sewage tankers for some of the companies located in Sriperumbudur.  The Sunguvarchathiram police on being informed sent the body of Albert to Chengalpattu Government Hospital for post-mortem. The police have formed special police teams based on the direction of Kancheepuram Superintendent of Police Prabhakar to trace the culprits.   Published - August 06, 2023 11:43 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Murder of domestic help in Aminjikarai: Chennai Police arrest six persons",
      "content": "The Chennai city police on Sunday (November 3, 2024) said six persons, including two couples were arrested for the murder of a 16-year-old girl, who was engaged as a domestic help by a businessman’s family in Aminjikarai. She was physically tortured to death by the inmates of the house on the day of Deepavali alleging that she was not doing the work.  Police said that they received information from Sarbuddin, owner of the house located on the second floor of Eden Castle apartment in Metha Nagar, Aminjikarai, on Friday (November 1, 2024) about the suspicious death of the girl at the house owned by him.  Sarbuddin had rented out the house to Mohammed Nishad (35) and his family. Following the complaint, police recovered the body of the girl who was lying dead in the bathroom of the house under suspicious circumstances and the inmates of the house were missing from the house. Police began an investigation treating the death as suspicious and sent the body to Government Kilpauk Medical College Hospital for post-mortem.  On investigation, police identified that the girl was from Thanjavur. Her mother was not able to take care of the child at her native after the demise of her father. She was brought to the city by two persons to be engaged as the caretaker of a four-year-old child of Mohammed Nishad at the rented house in the apartment. She had been working since December 2023.  The preliminary report of post-mortem and investigation revealed that the girl’s body bore burn and injury marks indicating the physical cruelty meted out to her by the inmates of the house.  Police nabbed — Mohammed Nishad; his wife Nivetha alias Nasiya; their friends Lokesh and his wife Jayashakthi; Nishad’s sister Seema Begam (39) and Mageshwari (40); a domestic help of Lokesh — and interrogated them. “The investigation revealed that Mohammed Nishad, his wife and others had physically tortured the girl for the last three months as she was not able to do domestic chores properly,” the police said.  They attacked her on Deepavali day and it led to her death. Leaving her dead in the bathroom, they escaped from the house after locking it. One of them informed a lawyer who in turn alerted the house owner Sarbuddin and police.  After a lengthy interrogation, Aminjikarai police on Saturday night (November 2, 2024) arrested six persons — the two couples, Nishad’s sister Seema Begum and Lokesh’s domestic aid from Kovilambakkam — on charges of offences including murder. They were remanded to judicial custody.   Published - November 03, 2024 04:01 pm IST  Tamil Nadu / Chennai / murder / death "
    },
    {
      "title": "Beautician murdered by husband in Chennai",
      "content": "A 27-year-old beautician was murdered by her first husband in Medavakkam Koot Road junction on Saturday (January 11, 2025) night. The Medavakkam police have arrested the 42-year-old accused and are investigating.  A senior official of the Tambaram Police Commissionerate said K. Jyothi was married to R. Manikandan who was a resident of Triplicane and worked as a camera repair worker in 2009. The couple had three children. However due to differences of opinion Jyothi left Manikandan and started residing with her three sons in a rented house in Medavakkam. She was working in a beauty parlour in the same locality.  In this situation, she had a live-in relationship with Manikandan’s cousin Krishnamoorthy, police said. A few days ago, Manikandan contacted Jyothi on her cell phone and said he wanted to visit and see her children. Manikandan visited the children at Jyothi’s house and requested for rejoining, but Jyothi refused. Infuriated, Manikandan got into an argument, but Jyothi hit him and told him to get out of her house.  She narrated the incident to Krishnamurthy who contacted Manikandan on his cell phone and asked him to meet at the Medavakkam Koot Road junction. Manikandan came in his two-wheeler in an inebriated manner and on seeing both Krishnamurthy and Jyothi, he picked a knife kept hidden in his pocket and stabbed her. Krishnamurthy, who tried to stop him, was also stabbed. Jyothi who suffered blood injury died on the way to a nearby private hospital. Manikandan, who tried to escape after committing the crime, was caught by the public and handed over to the Medavakkam police.  The Medavakkam police sent the body to Chromepet Government Hospital for post-mortem and admitted Krishnamurthy in the Rajiv Gandhi Government General Hospital.  Published - January 12, 2025 03:42 pm IST"
    },
    {
      "title": "Woman’s body stuffed in suitcase, man arrested for murder in Chennai",
      "content": "The Thoraipakkam police have arrested a 22-year-old man for allegedly murdering a 35-year-old woman, whose body was found stuffed in a suitcase near a construction site in Chennai, Tamil Nadu, on Thursday (September 19, 2024).  A senior official of the City Police said the victim M. Vellaiyammal, alias Deepa, was a resident of Ponniamman Medu near Madhavaram in Chennai. She had gone missing two days ago, and her brother Veeramani had traced the location of her phone to Thoraipakkam in the city using a mobile application, the official said.  He rushed to Thoraipakkam and sought the help of a police patrol team on Wednesday (September 18, 2024) night, providing them with the details of his missing sister.  At around 6.30 a.m. on Thursday, a police patrol team came across a newly bought suitcase left unattended near a construction site at Kumaran Kudil Main Road, which branched off the Rajiv Gandhi Salai.  On closer examination, the team found blood stains on the suitcase. They then found the body of a woman in the suitcase, who was identified as Deepa.  During the investigation, the police officials found that the last call made on her phone was to M. Manikandan, a resident of Parthasarathy Nagar in Thoraipakkam.  Manikandan, who had befriended her through another person, had called Deepa over to his house. They later had a verbal altercation, after which he allegedly murdered her.  The Thoraipakkam police arrested Manikandan on Thursday. They sent Deepa’s body to the Government Royapettah Hospital for postmortem examination.   Published - September 19, 2024 04:04 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Chennai triple murder: man accused of sexually assaulting prime suspect, ends life",
      "content": " A 45-year-old man, on Tuesday ended his life, after the city police summoned him for an enquiry in connection with charges of sexual assault levelled against him by the prime accused in the Sowcarpet triple murder case .  The victim has been identified as Vijaykumar, 45, a nephew of Dileep Thalil Chand, a financier in Sowcarpet who was gunned down by a gang led by his daughter-in-law Jayamala on November 11. Police sources said Jayamala reportedly had accused her father-in-law Dileep Thalil Chand and his nephew Vijaykumar of sexually harassing her. The repeated harassment from them drove her to leave the home and later, she lived in Pune. As the family refused to meet her demands for compensation and filed a criminal case against her, she, accompanied by her two brothers and three more associates, shot Dileep Thalil Chand, his wife and his son at their house, police said.  Vijaykumar was summoned by a special team of police personnel to the Elephant Gate Station, where police have been investigating the triple murder case. On Tuesday morning, he ended his life at his apartment in R.K. Nagar. His body was recovered by police and further investigations are on.  On November 11 , Dileep Thalil Chand, 74, who ran a finance firm and his wife Pushpa Bhai, 68, and their son, Shithal Kumar, 42, natives of Rajasthan, were found dead in their house on Vinayaga Maestri Street in Sowcarpet. Police said they were shot at point blank range by the gang of suspects including a woman, who was their daughter-in-law, Jayamala. The family had an ongoing marital dispute with Jayamala who was from Pune. Jayamala had married Shithal Kumar, said to be of unsound mind, 10 years ago. The family had reportedly harassed Jayamala mentally and physically for a long time. After murdering them, the attackers escaped in two cars.  Two days later after travelling 800 km, a special team arrested three suspects -- Kalaish, 32, a brother of the prime accused Jayamala and associates -- Ravindranath Kher, 25, of Kolkata and Vijay Uttham Kamal, 28, of Pune in Solapur, Maharashtra. Kailash and another confessed to having shot the trio as Jayamala was continuously physically and mentally harassed by the members of the family. Last week, another special team which was searching for three more accused nabbed Jayamala, her brother Vikash and his associate Raju Shinde at a hideout near Agra. On Monday, police arrested Raju Dubey an ex-serviceman from Jaipur who allegedly supplied his licensed revolver and his car.  “Jayamala and others have been in judicial custody and will be taken into our custody. Further interrogations will be conducted soon,” said a senior police officer. (Those in distress may contact State’s health helpline 104 or Sneha’s suicide prevention helpline 044-24640050 for counselling)  Published - November 24, 2020 02:53 pm IST  Chennai "
    },
    {
      "title": "Masked man murders wedding hall owner in Chennai, injures other members of victim’s family",
      "content": "The Avadi City Police have launched a probe into the murder of a 65-year-old man who was the owner of a wedding hall in Annanur near Avadi.  According to police, an unidentified man wearing a mask, barged into the house of Madhavan 65, on the night of February 10, 2024, and attacked him using a knife. While he died on the spot, his wife, mother-in-law and daughter were critically injured when they attempted to fend off the attacker.  Three special teams of police have begun a search for the suspect, who is believed to have been behind other brutal attacks and murders over the past two days.  Police said Madhavan resided with his family on Thirukural Main Road, Sri Shakthi Nagar, Annanur. Madhavan retired as a mechanic from the Chennai Port Trust. He then ran a wedding hall, VSM Royal Mahal on the first floor of his house. After he became estranged with his first wife, he married Shyamala, 44. The couple had two daughters. Madhavan’s mother-in-law, Arumugammal, 75, was also staying with the family.  After the attack, the masked stranger made a quick escape through the back of the house. Arumugammal, who was bleeding, ran to the street and shouted for assistance. Neighbours alerted the police. On receipt of the information, police personnel from Thirumullaivoyal station reached the spot and sent the injured to the Government Kilpauk Medical College Hospital. The police also recovered the body of Madhavan and sent it to the hospital for a post-mortem.  Avadi Deputy Commissioner of Police Ayman Jamal, Assistant Commissioner of Police Anbalagan and other police officers conducted a preliminary investigation. A sniffer dog was pressed into service and forensics experts collected fingerprints and blood samples. Police also scrutinised the CCTV footage.  A senior police officer said, “We have certain clues and are working towards tracing the suspect.”   Published - February 12, 2024 12:53 pm IST  Chennai / crime / police / murder / investigation "
    },
    {
      "title": "24-year-old gaana singer murdered by girlfriend’s family near Chennai",
      "content": "A 24-year-old gaana singer was murdered, allegedly by the family members of a young woman with whom he was in relationship. The crime occurred in Perungalathur on Wednesday, January 31, 2024.  Police sources said the victim has been identified as Jeeva of Thiruvalluvar Street in Gundumedu village, Perungalathur. Jeeva used to sing at funerals. He belonged to a Scheduled Caste community. Jeeva had been in a relationship with a young woman from the same caste for the past two years. Her family however, did not approve of this and got her engaged to another man. Following this, Jeeva had gone to her house and picked up an argument with her family members, police said. On Thursday, village residents found Jeeva’s body near a graveyard in Gundumedu. His pet dog was also found dead, police said. An investigation revealed that the girl’s family attacked Jeeva with a machete and stones and killed him and his pet dog. The police have registered a case and are looking for those involved in the murder.  Published - February 02, 2024 11:38 am IST  Chennai / murder / police / crime, law and justice / Caste violence "
    },
    {
      "title": "Man murdered in group clash in Chennai, six arrested within six hours",
      "content": "The Avadi City Police have arrested six men who were allegedly involved in a clash that resulted in the murder of a 24-year-old young man.  Police said that at around 10.30 p.m. on Monday, June 17, 2024, K. Ganeshan, 24, A. Karthikeyan, 19, and Vinodh, 24, of Thiruverkadu visited the mother of one of their friend in New Anna Nagar, Thirumullaivoyal, as she was unwell.  Follwoing the visit, the young men were talking to each other near the house of another person, B. Sadhasivam. Since they were creating a noise, Sadhasivam came out from his house and shouted at them, telling them not to make a noise near his house. He also asked them to disperse from there, which resulted in a heated argument. The trio threatened him by brandishing knives and left in a two-wheeler.  Angered over this, Sadhasivam decided to retaliate and called his family members to his assistance. Sadhasivam, along with his six associates, chased the trio on bikes and surrounded them. Both groups clashed and in the fight, Ganeshan, 24, of Thiruverkadu, was murdered.  Upon receipt of information, the Thirumullaivoyal police went to the scene of the clash and retrieved Ganehan’s body. After conducting an investigation, the police arrested Sadhasivam, 31, B. Selvam, 40, B. Velu, 36, A. Balakrishnan, 65, B. Anbalagan, 37, and Britto alias Peter, 44, within six hours of the murder.  Karthikeyan, 19, who was an associate of the deceased was sent to a hospital for treatment. Vinodh had fled the scene after the murder. The police have registered a case and further investigation are underway.   Published - June 18, 2024 01:29 pm IST  Chennai / murder / police / crime "
    },
    {
      "title": "Unravelling the plot behind gruesome double-murder that shook Chennai",
      "content": "More than a year has passed, but the murder of the couple who had just returned home from the U.S. is gruesome enough to linger on in public memory.  Srikanth, 58, a chartered accountant, and his wife Anuradha, 53, returned home at Mylapore on May 7, 2022, after spending six months in the U.S. In November 2021, they went to visit their daughter Sunanda, a postdoctoral research fellow in California, and their son Shaswath, 25, a medical student. They stayed on to assist in the delivery of their daughter. On May 7, they flew back and sent a picture of themselves disembarking at the Chennai airport to Shaswath, intimating him that the driver was waiting to pick them up. Thereafter, the couple went silent.  At 8.30 a.m., when Shaswath called on his father’s phone, the driver, Padam Lal Krishna, picked it up and said he had stepped out to pick up breakfast and the couple were sleeping. When he called up again at 9.15 a.m., Krishna said he had come out to buy vegetables. At 10.15 a.m., Krishna claimed Srikanth had asked him to go to their farmhouse near Mamallapuram. Later, Krishna’s mobile phone was switched off. In the U.S., Srikanth’s daughter Sunanda grew suspicious as she found the CCTV at home disconnected and the phones of her parents switched off. At 10.45 a.m., Sunanda decided that she had waited enough. She called up the police control room in Chennai.  A mobile patrol was sent to the spot, and the police entered the home by force after there was no response. One of their relatives, a prosecution witness, later deposed at the trial court, “A suitcase was found in the hall and two boarding passes were on the dining table... The kitchen seemed to have been cleaned with a disinfectant. Sashwath asked us to check the locker, which was empty. Their silver-coloured car [Innova] was missing.”  The needle of suspicion pointed to Krishna, a Nepali national working as a driver-cum-assistant for the couple on and off for a couple of years and staying at their farmhouse at Soolerikadu near Nemilichery. Initially, the police suspected that the couple could have been kidnapped from the house and kept at their farmhouse. However, the investigation took a turn, with sleuths spotting blood stains in the house and a burnt mobile phone and a burnt cloth lying near freshly dug soil at the farmhouse.  The police asked all toll plazas to watch out for the Innova. The car was spotted, and with the help of FASTag messages, the police narrowed it down to Andhra Pradesh. With the help of the Andhra Pradesh police, the car was stopped at a toll plaza near Ongole. The police arrested Krishna and his associate Ravi, a native of Darjeeling. The duo confessed to having murdered the couple for money and buried the bodies at the farmhouse. The police also recovered over 1,000 sovereigns of gold jewellery and silver articles stolen from Srikanth’s house. Krishna said he had planned the crime after overhearing Srikanth say that a lot of cash had been kept at home. The case is under trial before the IV Additional Sessions Court, which is examining the prosecution witnesses. The High Court directed the trial court to complete the trial in four months. The accused persons are in prison.   Published - August 15, 2023 11:08 pm IST"
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    },
    {
      "title": "Three arrested for attempt to murder in Chennai",
      "content": "The Nungambakkam police arrested three persons for grievously injuring a 21-year-old resident of Pushpa Nagar on Wednesday.  The police said Kumar alias Kulla Kumar was a history-sheeter wanted in several criminal cases. Kumar was sitting with his friends at a tea stall on Tank Bund Road when a three-member gang arrived in an autorickshaw and picked a fight with him.  The gang leader, T. Dhanasekar alias Sambar, took out a knife and stabbed Kumar. The public rushed Kumar to a private hospital where he is undergoing treatment. Based on a complaint filed by Kumar’s brother, the Nungambakkam police registered a case. The police learnt during investigation that Kumar had assaulted Dhanasekar a few days ago. Dhanasekar’s brother had taken a loan from Kumar to buy an autorickshaw. As he had had not paid the dues, Kumar threatened to take away the vehicle.  The Nungambakkam police arrested three persons — Dhanasekar, Raja, and Parthiban — and seized two knives and an autorickshaw. The three arrested were produced before a judicial magistrate and sent to prison.   Published - August 17, 2022 07:13 pm IST  Chennai / crime "
    },
    {
      "title": "Five arrested for murder of ganja peddler in Chennai",
      "content": "The Basin Bridge Police on Saturday arrested five accused for allegedly murdering a 33-year-old man in Pulianthope who had criminal cases for two murders and ganja peddling.  The police identified the victim as Karthikeyan alias Shettu, 33, of Gandhi Nagar, Pulianthope. He had at least 10 criminal cases against him for offences, including two murders. On Friday night, he was chatting with his friends near a public toilet when a gang encircled him with knives and attacked him indiscriminately. He collapsed in a pool of blood and the accused escaped from the spot.  The police personnel from Basin Bridge rushed to the spot and sent the victim, who was battling for life, to the Government Stanley Hospital. He died on Saturday morning.  The police arrested five persons allegedly involved in the offence. Police said Karthikeyan was involved in murder of Ranjith in 2013 and Prem, brother of Ranjith, along with his associates murdered Karthikeyan to avenge his brother’s death. A senior police officer said five accused including Prem were arrested and remanded in judicial custody.   Published - October 01, 2022 07:34 pm IST  Chennai / crime / murder "
    },
    {
      "title": "Dispute over parking of  vehicles on street leads to murder of 23-year-old student in Chennai",
      "content": "The Chitlapakkam police on Monday, May 13, 2024, arrested three young men for allegedly hacking to death, a 23-year-old college student, when he was on his bike with his girlfriend on Sunday (May 12) evening. Police said the trio attacked him following a quarrel over parking vehicles near his house.  The victim has been identified as K. Udhayakumar alias Babloo, 23 of Thiruvalluvar Nagar, Ramakrishnapuram. He was an MBA student at a private college and also drove an autorickshaw on a part-time basis. On Sunday afternoon, he was riding his bike with his girlfriend riding pillion, on Sethunarayanan street, MMDA Nagar. A gang of three persons waylaid them and began an argument with him. His girlfriend left. As the heated exchange of words continued, Udhayakumar abandoned his bike and took to his heels. The assailants chased him and attacked him using knives, in a crowded area. The victim fell to the ground, badly injured.  Upon receipt of information, police personnel from the Chitlapakkam Police station went to the spot and rushed Udhayakumar to the Government Chromepet Hospital, and later, to a private hospital. .  However, Udhayakumar died at the hospital without responding to the treatment. A police complaint was lodged by his mother. Police on Monday arrested three suspects who have been identified as S. Naresh 24, an electrician of Mappedu, S. Krishna, 19 of Puthur Extension, and M. Santhakumar, 19, of Mappedu -- both college students -- on charges of murder.  Further investigations revealed that the deceased Udhayakumar and the accused Naresh were involved in a dispute over the parking of vehicles on a street, and the former had attacked the latter following the quarrel. In retaliation, Naresh, along with his two friends, attacked Udhayakumar, police said.   Published - May 13, 2024 05:29 pm IST  Chennai / police / crime / murder "
    },
    {
      "title": "‘Auto’ Shankar and a series of bizarre murders in Chennai\nPremium",
      "content": "No one realised the gravity of the crime until the police exhumed bodies at an under-construction house and its adjacent area, a narrow and long-winding pathway surrounded by a cluster of huts at Periyar Nagar off Thiruvanmiyur on July 7, 1988. One body after another came out, in a highly decomposed state, when the investigators dug up the soil. Periyar Nagar remained panic-stricken following the exhumation of the four bodies. and the police had a tough time in keeping at bay large crowds that had gathered on the scene. The victims were identified as Sampath, Mohan, Govindaraj, and Ravi, who was an autorickshaw driver. All of them were aged 25-30 and from Mandaveli. Weeks earlier, the brother of Sampath had lodged a complaint with the Abhiramapuram police that his brother had gone missing since May 29. Only after Sampath’s wife pleaded with Governor P.C. Alexander to trace her missing husband, did the police start the probe with an autorickshaw driver, Shekar, in whose vehicle the three victims travelled to a lodge on Lattice Bridge Road on May 29.  With vital clues given by the autorickshaw driver, the police on July 6 picked up Shankar, 33, of Periyar Nagar and his associates Babu and Jayavelu, who were said to be arrack-sellers and to have no criminal records. Shankar showed the spot where they had buried the bodies of three men five weeks ago and another one eight months ago. Then the cold-blooded murders committed by Shankar came to light.  The case took an alarming turn on July 15, with the police exhuming another body, this one of a young woman, from a hut. That the body had been buried in the hut came to light following the arrest of Mohan, 30, younger brother of Shankar. In the 1970s and 1980s, Periyar Nagar was a cluster of slums set in the midst of squalid surroundings. It was notorious for the sale of illicit liquor and flesh trade.  Shankar was born in 1955 at Kangeyanallur in Vellore district. His father was from Kerala and mother was from Vellore. When he was doing PUC, his father left his mother for Orissa. At a young age, he came to the city and settled down at Periyar Nagar. He started out as an assistant to a mason and became a painter. Shankar later started driving autorickshaws, transporting illicit arrack. Then he got the nickname ‘Auto’. Subsequently he started selling illicit arrack. He married Jagadeeswari. His brother-in-law Eldin alias Albert, Shivaji, Jayavelu, Raman alias Raja Raman, and Ravi were helping him in the illegal business. He entrusted the illicit arrack business to his brother Mohan and started running prostitution.  The police said Shankar would eliminate anybody who interfered with his criminal activities. According to the prosecution, six murdered persons had incurred his wrath and were beaten to death by Shankar and his associates. Shankar put up a shed on a poramboke land and was running a brothel.  In 1986, he developed intimacy with one Sumathi and married her. Jagadeeswari, the first wife, quarrelled with him over his second marriage. Two months later, he brought another girl, Vijaya, and she left him stealthily as he had tortured her physically. Subsequently, he had married two more girls, but they all left because of his ill-treatment.  From the money he made from prostitution, he constructed a house on Gandhi Road, Periyar Nagar, and celebrated the house-warming ceremony. Several politicians and police officers attended the ceremony.  The prosecution case was that Shankar was attracted to the beauty of one Lalitha, who was spotted in a cabaret. He brought her and set up a separate residence for her on Kalakshetra Road. She eloped with Sudalai, who was his close associate in prostitution. They ran away, taking ₹7,300 and a camera belonging to Shankar, who lodged a complaint with the police. He also searched for them in cities like Bangalore.  On his complaint, the police traced them at Pallavaram and brought them to Thiruvanmiyur. As she refused to live with Shankar, the police sent her to Bangalore, escorted by a constable. But Shankar took custody of her. Angered by her betrayal, Shankar strangled her on October 28, 1987. He took her golden anklets, studs, and necklace, which he had given her. He buried the body near a liquor godown. This was the first murder committed by Shankar and his gang.  Shankar took Sudalai in a car to an arrack shop on February 28, 1988. At his house, Shankar gave him brandy and smothered Sudalai to death and set fire to the body after dousing it in petrol. Later, he and his associates bundled the body in a bed-sheet, carried it in a car, and threw it in the backwaters below the Muttukadu bridge at 2 a.m. the next morning.  Ravi, an autorickshaw driver, repeatedly enquired with Shankar about the whereabouts of Lalitha and Sudalai and blackmailed him while they were consuming liquor. He demanded ₹2 lakh from Shankar, who along with his associates strangled him to death at 9 p.m. on March 14, 1988. With the help of a mason and a painter, they dug a pit near the bathroom of the house and buried the body.  Sampath, Mohan, and Govindaraj used to visit Taj Mahal Hotel, where sex-workers from Shankar’s brothel used to entertain customers, and create nuisance. At 4 p.m. on May 29, 1988, they were coming in an autorickshaw and saw one Anitha, near Shankar’s brothel. They caught hold of her and forced her to go with them. Shankar and his associates beat up the trio with casuarina sticks and wooden reapers. The trio were confined to a storeroom at Ranganathapuram. Later, they found two of them dead and the third one groaning. They murdered the third person brutally. They buried the three bodies in trenches dug for laying the foundation of a building.  Devendra Babu, alias Babu, an associate of Shankar, was arrested on July 6, 1988. Based on his confession, Shankar was arrested at midnight of July 7, 1988. The investigation was handled by the CB-CID from July 17. In all, 10 persons, including Shankar and his associates, were arrested and 16 police personnel, including a DSP, two sub-inspectors, and two inspectors, were suspended for being lax in the investigation into the disappearance of the deceased persons.  On December 26, 1988, the CB-CID filed a charge sheet in the court of the Judicial Second Class Magistrate, Saidapet, against Shankar and nine others for murdering six persons. They were charged under Sections 120-B (conspiracy). 147 (unlawful assembly), 148 (armed with deadly weapons) 364 (abduction), 302 (murder) and 201 (concealing evidence) IPC.  In August 1990, Shankar, and his associates Mohan, 28, and Selvaraj, 30, and two other accused persons escaped from the Madras Central Prison by scaling the wall with the connivance of prison employees. He befriended a woman who frequently visited her husband in the prison and ran away with her to Rourkela in Orissa. The daring escape sent shock waves in the city. Thirteen members of the jail staff, including the Superintendent of the Central Prison, were placed under suspension. Weeks later, a police team traced Shankar and Devi to a hut at Tangrapalli near Rourkela.  The police brought him back by scheduled flights after obtaining special permission from the Bureau of Civil Aviation. He was shifted to the Central Prison, Salem. The trial began on December 6, 1990, at the District Sessions Court at Chengalpattu. On May 31, 1991, judge N. Mohandas sentenced Gowri Shankar, alias ‘Auto’ Shankar, 33, Eldin, alias Albert, 30, and Shivaji, 30, to death. He awarded life imprisonment to Jayavelu, Raman, Ravi, Palani, and Paramasivam.  On April 5, 1994, the Supreme Court confirmed the death sentence and Shankar was hanged on April 27, 1995, at the Salem Central Prison.   Published - January 21, 2024 11:14 pm IST  society "
    },
    {
      "title": "Three history-sheeters shot in two police encounters near Chennai; two dead, one hospitalised",
      "content": "Two history-sheeters were gunned down by a special team of the Avadi City Police near Sholavaram in the early hours of Thursday. In a separate incident, another history-sheeter was injured after the Chengalpattu police shot at him when he reportedly tried to escape at Chithamur.  To get today’s top stories from the State in your inbox, subscribe to our Tamil Nadu Today newsletter Police sources said the deceased were identified as Muthu Saravanan, 27, of Edapalayam, and ‘Sunday’ Sathish, of Gnayiru near Red Hills. Both were involved in murders and attempts-to-murder in the city and suburbs. The police said Muthu Saravanan and Sathish were the main suspects in the murder of AIADMK functionary Parthiban by a gang at Red Hills on August 17 this year.  They had been at large since then. Four other accused persons had already been arrested. In the early hours of Thursday, a special team of police, led by Assistant Commissioner P. Jawahar, reached the spot following information that they were hiding at a dilapidated house at Marambedu Kandigai on Minjur-Vandalur Outer Ring Road in the Sholavaram police limits. When the team approached the duo, they opened fire. In retaliation and self-defence, the police returned the fire.  The two were critically injured and rushed to a government hospital where the doctors declared them dead on arrival, the police said. At the scene of occurrence that was cordoned off, there were remnants of the earlier face-off — a weapon, footwear and blood splattered on the ground. Avadi City Police Commissioner K. Shankar visited the scene and held an inquiry with the officers concerned.  Later talking to reporters. Mr. Shankar said, “A special team was formed to trace the two suspects. Muthu Saravanan and Sathish were hiding after they were involved in the murder of Parthiban. Following receipt of information about where the duo was holed up, the special team proceeded to arrest them. The police claimed that the suspects had two pistols and fired with them. Three police personnel were injured in the firing. In retaliation, the police opened fire at the suspects.., who were seriously injured.”   Tamil Nadu Director General of Police Shankar Jiwal and Avadi City Police Commissioner K. Shankar enquire about the health condition of the injured policeman at the Government Stanley Hospital in Chennai on October 12, 2023 | Photo Credit: Special Arrangement  “Our action against rowdies will be stringent. ...We will control rowdyism with an iron hand...,” Mr. Shankar said. The bodies of the deceased were sent to Government Stanley Hospital for post-mortem. A judicial magistrate inquiry was being held into the police firing. The three injured policemen — Krishnamurthy, Rajesh and Prabu — were taken to Government Stanley Hospital. DGP Shankar Jiwal, along with Mr. Shankar, visited them injured police personnel at the hospital.  Meanwhile, a video of the parents of Muthu Saravanan appealing to the Chief Minister and police officers to save their son, who they said had been picked up by the police, surfaced on social media on Wednesday night. The police said Muthu Saravanan had six murder cases pending against him, including the murder of Parthiban and of DMK functionary C. Selvam in February 2022 at Madipakkam; two attempts to murder; and eight cases of robbery. He was involved in extortion in Chennai city and suburbs. His close associate Sathish, 24, was involved in five murders, four attempts to murder and four robberies.  The Chengalpattu district police shot at a history-sheeter when he tried to escape from police custody at Chithamur in the early hours. The injured was identified as Thanika alias Thanikachalam, 36, of Periyapalayam, who had 17 criminal cases pending against him. The police were searching for him as he was wanted in a murder case at Chithamur. While he was taken in a vehicle to the Chithamur police station after being arrested at midnight, he attacked the police and tried to escape from the vehicle. Then, inspector Pugazh shot him at the knee and the hand. Thanikachalam was taken to Rajiv Gandhi Government General Hospital.   Published - October 12, 2023 09:31 am IST  Chennai / Tamil Nadu / police / crime "
    },
    {
      "title": "Systems are in place to prevent revenge murders of criminals, says Chennai Police Commissioner",
      "content": "Greater Chennai City Police Commissioner, Sandeep Rai Rathore, on Friday, said the city police had a system to prevent the murders of persons classified as rowdies.  Asked about steps taken to nab the suspects involved in the recent murder of a history sheeter in Pattinapakkam, Mr. Rathore, while speaking to mediapersons, said: “A few suspects in connection with the murder case were nabbed. We also have certain clues about the motive for the crime, which will not be disclosed now. Three special teams are working to nab those involved in the murder.. We will certainly arrest them and also take appropriate action against those involved in such crimes.”  Replying to a question on preventing the murders of rowdies due to enmity, Mr. Rathore said, “We have a system in place to prevent such murders. We have personnel who have conducted a drive against rowdy elements (DARE), and we also maintain history sheets. Senior police officers frequently visit various police stations and review the records of rowdies. Besides, we are consistently invoking the Goondas Act and security proceedings against criminal elements and also working consistently to ensure the conviction of suspects arrested in criminal cases.”  Earlier, Mr. Rathore participated in a mega public grievance redressal camp in Anna Nagar and heard the grievances of members of the public, after receiving their petitions.  This was part of a series of such camps conducted on Friday, at 12 police districts across Chennai, by the Greater Chennai City Police, wherein Additional Commissioners, Joint Commissioners and Deputy Commissioners received petitions from the public. The grievance redressal camps are being conduct following instructions from Chief Minister M.K.Stalin.  Mr. Rathore said this is second time the city police have conducted these mega camps. These are one-stop arrangements where police officers of all ranks sit at one place and redress grievances without any delay, he said.  At the mega public grievance redressal camp held on July 8, the officers received 887 grievance petitions, of which 661 petitions were disposed of, and action was taken by registering a first information report on 14 petitions.   Published - September 01, 2023 04:15 pm IST  Chennai / police / crime, law and justice / murder "
    },
    {
      "title": "Chennai auto driver overhears passenger’s confession of crime, takes murder accused to police station",
      "content": "An unemployed engineering graduate fatally stabbed his father after an argument at their house in Thillai Ganga Nagar, Nanganallur. Fleeing in an auto-rickshaw, he confessed the crime to his brother over the phone. The auto driver, overhearing this, took him straight to the police station. Meanwhile, the victim was rushed by his elder son to the hospital but was declared dead, leading to the arrest of the younger son.  The suspect has been identified as Aditya Narayanan, 28 who is a gold medalist in Production Engineering. He was jobless and staying with his parents at their house in Thillai Ganga Nagar, Nanganallur. The suspect had a frequent quarrel with his father - Muralidharan, 66, - demanding money for his personal expenses.  On Monday, Aditya Narayanan took an auto and proceeded to Anna Salai. While he was proceeding, he called his elder brother, Prasanna Venkatesh living separately from their house and informed him that he had a quarrel with his father and had beaten him. He also told him that his father was in an emergency situation and asked to send an ambulance. Hearing the conversation, the auto driver took him to Triplicane Police station.  In the meantime, his brother reached their home and found the door was locked by a bicycle lock. With the help of the neighbours, the door was opened after severing the lock chain and he found his father was lying unconscious with stab injury on his neck. They rushed him to a private hospital and later, he was sent to Government Hospital Chromepet where the doctors declared Muralidharan dead.  Adambakkam Police arrested Aditya Narayanan on charges of murder and remanded to judicial custody.   Published - March 05, 2025 12:59 am IST  Chennai / murder / unemployment "
    },
    {
      "title": "Two persons murdered in separate incidents in north Chennai",
      "content": "A 42-year-old man who had come to participate in the funeral of a history-sheeter Kumar, alias Karuppu Kumar, in Old Washermenpet, was murdered by the history-sheeter’s relative on the night of Saturday, April 22. The Korukkupet Police have filed a case and have arrested a man, Kamala Kannan, for the murder.  A senior official of the Chennai City Police said a 53-year-old history sheeter, Karuppu Kumar of Old Washermenpet was murdered by a gang on Friday near his home on Arani Rangan Street. The gang escaped from the scene. On Saturday a funeral was held for Karuppu Kumar in which B. Rajasekhar, a resident of Thiruvottiyur, participated. After the funeral, Rajasekhar had been drinking liquor with Kumar’s relative Kamala Kannan of the same locality in a nearby abandoned house. While they were drinking, a quarrel broke out, and Kamala Kannan hit Rajasekhar with a heavy stone and escaped from the place.  On Sunday morning when a smell emerged from the abandoned house, a few local residents and found Rajasekhar’s body. Based on this information, the Korukkupet police sent the body to the Government Stanley hospital for a post-mortem and within a few hours arrested the accused person, Kamala Kannan. He was produced before a judicial magistrate and sent to prison, the police official added.  In another incident a clash between two groups who were drinking liquor in Tiruchankuppam beach of Tiruvottiyur resulted in the murder of a 23-year-old person on Saturday night. The Tiruvottiyur police have filed a case and have formed special teams to nab the offenders.  A police official of Thiruvottiyur station said Sanjay of Vyasarpadi, along with his friends had come to drink at the beach. However another gang which was drinking liquor at the beach picked up a fight, and Sanjay was severely assaulted by the gang. The unidentified gang later escaped from the place. Friends of Sanjay, after alerting the Tiruvottiyur police rushed him to Government Stanley Hospital but died on the way.   Published - April 24, 2023 12:54 pm IST  Chennai / murder / police "
    },
    {
      "title": "Man murders father over property dispute in Chennai",
      "content": "The Rajamangalam Police have arrested 34-year-old man for murdering his father, on the night of Tuesday, March 19, 2024.  A senior official of the City Police said D. Madhusudhanan was a 68-year-old retired individual residing on Rajamangalam 6th street in Villivakkam, along with his son George Bush. George Bush being an alcoholic, used to routinely harass and abuse his father, demanding a share in the property and money. On Tuesday night, George Bush after consuming liquor came home and demanded that his father give him a share of the property and when Madhusudanan refused, he hit him with an iron rod and pushed him on a wall, against which a gas cylinder stood. Madhusudanan sustained injuries on his head and body, and collapsed, dying on the spot.  The Rajamangalam police, on being alerted about the incident, rushed to the spot and arrested the victim’s son. They later sent the body of the victim to the Government Kilpauk Medical College Hospital. A case has been registered and an investigation is underway.   Published - March 20, 2024 11:40 am IST  Chennai / crime / police / murder "
    },
    {
      "title": "Woman and daughter found murdered at home in Chennai",
      "content": "A 47-year-old woman and her 22-year-old daughter were found dead, with knife wounds, in their house in Maduravoyal on Thursday morning. Some gold jewellery was also missing from the bodies. The police, however, suspect a personal motive behind the murders and said the jewellery may have been stolen to mislead investigators. Other gold ornaments and cash kept in the safe, and other valuables, were intact. The police have narrowed down their search to a couple of unidentified men filmed by a CCTV camera installed in a house on the adjoining street. Vimala Devi and her daughter Pavithra were by themselves in their house on Nagendran Street in Karthikeyan Nagar of Maduravoyal when the murder took place, between 9.30 a.m. and 11 a.m. on Thursday. The house has a large gate eclipsing the main portion of the building from the busy stretch of Nagendran Street. Pavithra, an employee of a BPO in Kilpauk, had got back after night duty around 5 a.m. on Thursday. Sukumaran (25), the elder son of Vimala and her husband Samikannu, works at a BPO in Aminjikarai. He had left for work around 9.30 a.m. “I had just returned from the ration shop around 11 a.m. when I heard the loud cries of Samikannu. I ran into their house and found Vimala lying in a pool of blood near the refrigerator at the entrance of the kitchen,” said Mallika, a neighbour. Pavithra was found dead on the bedroom floor with stab injuries in the neck. Her five-sovereign gold chain was missing. Devi’s throat was slit and her 10-sovereign chain was missing, the police said. Samikannu runs Pavithra Hotel on Mettukuppam Main Road in Maduravoyal and Vimala often joined him there around 10 a.m. after seeing off their son to work. “On Thursday, Samikannu repeatedly called on the mobile phones of his wife and daughter. Since there was no response from either of them, he went home only to find them dead and the house ransacked,” said Vimala’s brother Kasinathan, who works as a call-taxi driver. S. Xavier Dhanaraj, deputy commissioner (Anna Nagar), who visited the crime scene, said, “There are no signs of a forced entry. So, the suspects were probably known to the victims,” he said. The footage from the neighbouring house that has two CCTV cameras mounted on its gate — one of which faces the road leading to Samikannu’s house — shows two men passing by Samikannu’s house, around the time of the murders. “The mobile phone records of the victims are being examined. Pavithra’s co-workers and the cab driver who dropped her after work are being questioned,” the police said.  Published - September 06, 2013 02:12 am IST  Chennai / murder "
    }
  ]
}