{
  "searchQuery": "thanjavur murders",
  "length": 100,
  "result": [
    {
      "title": "T.N. government school teacher murdered on campus in Thanjavur",
      "content": "A 26-year-old teacher was stabbed to death on Wednesday on the Mallipattinam Government Higher Secondary School campus in Thanjavur district allegedly by a man who wanted to marry her.  Ramani was declared dead on arrival at a hospital. The accused, Madhan, 30, was arrested by the Sethubhavachatram police and remanded in judicial custody. The victim and the accused were from Chinnamanai in the district.  The police said Madhan and his family members met Ramani’s kin a few days ago and expressed their desire to get the two married.  Ramani, however, turned down the proposal. Enraged by her rejection, Madhan went to the school and attacked her, inflicting a serious injury on the neck. The school authorities have submitted a report to the District Education Office on the murder.  They have pointed out that the incident took place at 10.10 a.m. near the teachers’ room. The accused had stabbed Ramani in the neck and stomach.  They also mentioned that the School Management Committee had appointed Ramani as a temporary graduate teacher in June this year to teach Tamil for teaching Tamil to students of Classes VI-IX.  Chief Minister M.K. Stalin on Wednesday announced ₹5 lakh to Ramani’s family. Condoling the death, he said: “She dedicated herself to teaching students in rural areas. Her death is an irreparable loss..”  School Education Minister Anbil Mahesh Poyyamozhi has condemned the murder. “Violence against teachers cannot be tolerated. Strict action will be taken against the attacker,” he posted on X (formerly Twitter). Later in the evening, Mr. Poyyamozhi and Minister for Higher Education Govi. Chezhiaan visited the school. Addressing mediapersons, Mr. Poyyamozhi said the school would remain shut till the weekend.  On Monday, psychological counselling would be given to students and the staff members. The school would be reopened after a report on the mental state of students and the employees is obtained, he added. The Ministers also called on the family members of the deceased.  The Tamil Nadu High and Higher Secondary School Headmasters Association has sought protection for government schoolteachers.  AIADMK general secretary Edappadi K. Palaniswami said the murder happened due to the DMK’s “failure” in maintaining law and order.  Former Chief Minister O. Panneerselvam and AMMK general secretary T.T.V. Dhinakaran held the State government responsible for the incident.  TMC (Moopanar) president G.K. Vasan urged the government to take steps to ensure the safety of students and teachers at its schools. TMC (Moopanar) president G.K. Vasan condemned the murder and urged the government to take steps to ensure the safety of students, teachers, and other employees at its schools.  Calling for a safe environment for students and teachers, Mr. Vasan said the details of those visiting schools should be collected and they should be allowed entry only after the authorities concerned granted permission.  Parents, teachers, and students are in shock over the murder of the teacher at the Mallipattinam Government High School. The School Education Department should allocate funds for appointing additional employees at schools and the government should focus more on law and order, he added.  Published - November 20, 2024 12:48 pm IST  murder / Tamil Nadu / crime "
    },
    {
      "title": "Woman living alone murdered in Thanjavur",
      "content": "A 60-year-old woman was found murdered in her house in Melapazhunchur village, under the Adhiramapattinam police station limits, in Thanjavur district on Thursday.  Police said the woman, R. Indrani, a widow was staying alone. Her son is employed in Singapore and daughter-in-law had left for her parent’s house to deliver her baby. Police said Indrani was breaking groundnut pods in her house when unidentified assailants entered and slashed her neck with a sharp weapon killing her on the spot. Valuables kept inside the house were found to be intact, said the police. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Local residents who found the woman dead alerted the police. Footage from CCTV installed near the house of the victim is being studied by the investigators in an effort to establish the identity of the assailants. The Adhiramapattinam Police have registered a case of murder.  Published - October 09, 2020 12:11 pm IST  Tamil Nadu "
    },
    {
      "title": "Murder case accused hacked to death in Thanjavur",
      "content": "Sriram, 22, of Kalimedu near Thanjavur was hacked to death by a gang on Monday night in Thanjavur. According to the police, Sriram was an accused in a murder case registered at the Vallam police station in 2022. He was working at a soft drinks parlour on the Medical College Road, Thanjavur. On Monday night, a group barged into the parlour and attacked him with weapons and fled the spot. Sriram died of injuries on the spot, the police said. The Medical College Police have registered a case and are investigating.   Published - July 08, 2024 09:42 pm IST  Tiruchi / murder "
    },
    {
      "title": "Armed gang murders advocate, relative in Thanjavur",
      "content": "An advocate P. Kamaraj, and his relative Sakthivel, both aged 45, were murdered by an armed gang in Kuppankulam village under the Nachiyarkoil police station limits in Thanjavur district on Monday night.  The gang, armed with sharp weapons, targeted Kamaraj and Sakthivel separately. Police said around 8.45 p.m., Kamaraj was returning home on a two-wheeler with his father Parthiban riding pillion, when the gang intercepted them near a school and hacked him to death on the spot, while sparing his aged father. The gang members thereafter went to the house of Kamaraj apparently with the intent to murder his elder brother Kaviraj. However, Kaviraj managed to escape. The gang members chased his relative, Sakthivel and hacked him to death on a farm land nearby.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Police sources said the murders were suspected to have been committed due to previous enmity between Kamaraj and his close relative Rajavelu, also an advocate, over a land dispute. Rajavelu is a State-level office bearer of the Bahujan Samaj Party. The Nachiyarkoil police have registered a case of murder and named Rajavelu, his son Anand, Rajasekhar, Sethumurugan and some others as accused in the killings. The sources said two persons, Anand and Kannan, surrendered before the police on Tuesday. Further investigations are on.   Published - October 20, 2020 01:01 pm IST  Tiruchi "
    },
    {
      "title": "Murder cases decline in Thanjavur district in 2023",
      "content": "The number of murder cases reported in Thanjavur district has reduced in 2023 as compared to the previous years due to continuous crime prevention measures.  The number of murder cases reported in Thanjavur district in 2023 was 51, which was 23% lower than the previous year. As many as 70 offenders had been detained under the Goondas Act and 263 history sheeters had been arrested and lodged in the prison.  Conviction had been obtained through courts for 33 persons involved in murders, including 11 history sheeters, in 2023. The number of murder cases had substantially come down in Pattukottai, Thanjavur Town and Kumbakonam sub-divisions in Thanjavur district, a police press release said.   Published - December 31, 2023 08:38 pm IST  Tiruchi / murder / crime "
    },
    {
      "title": "Activist wants SIT comprising other State police officers to probe Thanjavur caste killing",
      "content": "A Special Investigation Team (SIT) comprising police officers from other States should be constituted to probe the recent murder of a 19-year-old girl, P. Isvarya, allegedly by her parents in Thanjavur after she eloped with a youth, Naveen belonging to a Scheduled Caste, A. Kathir, executive director of Evidence, a Madurai-based organisation, said on Friday (January 12, 2024). According to him, there were discrepancies in the police investigation in the case. “Isvarya’s parents P. Perumal and Roja, after bringing her from Tiruppur where she and the 19-year-old Naveen got ‘married’ (legally void as the boy is not of marriageable age), hanged her from a tree,” he charged. Later, placing the body on a cot, they allegedly dragged it to a graveyard about one km away from their house and set fire to it on January 3. The crime came to light after five days, only after Naveen filed a police complaint. Further, he said, upon receiving a girl missing complaint from her parents, Tiruppur police found the couple near Veerapandi area in Tiruppur. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. “The police brought only Isvarya to the police station, leaving Naveen behind. Then, Isvarya was handed over to her parents, who took her to their village near Thanjavur,” he added. While there was a 2018 Supreme Court direction to State governments to follow 21 guidelines while dealing with inter-caste marriages, Tamil Nadu police followed none of them. “Knowing that there was an issue in the marriage, the police allowed the girl to be taken away by their parents. Secondly, Tiruppur police after handing over Isvarya to her parents should have informed Thanjavur police of the incident,” he said. Sensing the ominous situation, at least the Village Administrative Officer (VAO) should have checked on the girl in her village.  Mr. Kathir alleged that the police, to protect a few caste outfit members, who had a significant role in the murder, were framing only the parents. If not for the police’s lethargic attitude in handling the situation, the murder could have been averted, he said.  He said police protection should be given to the family of Naveen, who registered a police complaint to find the girl. “Since a few witnesses have given their statements, the evidence recorded should be taken under Section 164 (Recording confessions and statements) of the Cr.P.C. to protect them from being misinterpreted,” Mr. Kathir added. While the Central government had informed Parliament that three caste killings were recorded in Tamil Nadu from 2017 to 2021, Mr. Kathir said, the actual number was significantly undermined as he through his investigation found out 24 caste killings from 2021 to 2023. “Nine of them were recorded in the southern districts,” he added.  Published - January 12, 2024 06:53 pm IST"
    },
    {
      "title": "Double murder at housing board quarters in Thanjavur",
      "content": "A woman and a man, both government employees, were hacked to death allegedly by a gang at the Tamil Nadu Housing Board residential quarters on Tuesday. According to police, the incident took place at around 7 a.m., at the house in which the deceased, Vanitha, an office assistant at the District Collectorate, was residing. The other victim, Kanagaraj, also an office assistant in the Collectorate, was apparently staying in the house. Preliminary investigations revealed that Vanitha had taken a loan from her relative, Prakash and was yet to repay it fully. Prakash had already filed a complaint against her with the Thanjavur South Police stating that she had not repaid the loan amount in full. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. On Tuesday morning, Prakash and two others – a woman and a man -- came to the quarters where Vanitha was residing and picked up a quarrel with her and Kanagaraj. The trio then allegedly attacked Vanitha and Kanagaraj with lethal weapons, killing them on the spot. On seeing the bodies lying in a pool of blood, the children of Vanitha – a girl and two boys, raised an alarm. On hearing their screams, neighbours rushed in and later informed the police. Subsequently, the Thanjavur Medical College police arrived at the scene of the crime and took the bodies to the Thanjavur Medical College for post-mortem examinations. A case of murder has been registered and the police are on the look out for the culprits.  Get Outlook for Android  Published - November 26, 2019 12:06 pm IST  Tiruchi / Tamil Nadu / crime / murder / police "
    },
    {
      "title": "Murder case: four surrender",
      "content": "Four persons surrendered before the Sirkazhi Magistrate Court on Thursday in connection with the murder of an AIADMK cadre in Thanjavur. The police said Nanji P.Sekar, husband of Geetha Sekar, president of Nanjikottai village panchayat, was murdered by a four-member gang in front of a marriage hall at Nanjikottai in Thanjavur district due to previous enmity on Tuesday. Three special teams were formed to nab the culprits. Meanwhile, Balu (36) of Kulankarai near Thanjavur, Manikandan (25) of Thempur, Anandan (36) of Parangipettai and Kumar (34) of Meensurutti in Cuddalore district surrendered before the Magistrate Manimekalai at Sirkazhi in connection with the case. They were remanded in judicial custody.  Published - February 13, 2015 12:00 am IST"
    },
    {
      "title": "Businessman murdered in Thanjavur",
      "content": " A 48-year-old man who was running a transport business was murdered in neighbouring Thanjavur district on Sunday. Police identified the victim as Babu of Solanganallur in Tiruvarur district.  Babu was proceeding in a car with his son to Thanjavur to attend a house warming ceremony of an acquaintance when he was attacked along the Thanjavur by pass road at Gnanam Nagar on the outskirts of Thanjavur.  Police sources said a car intercepted Babu’s vehicle. Two members came out of the car armed with sharp weapons and hacked Babu to death and escaped in their vehicle. Babu was running a transport business in Karaikal Port transporting coal to cement factories, the police said. The Thanjavur Taluk police are investigating.  Published - June 09, 2024 10:22 pm IST"
    },
    {
      "title": "Two awarded double life sentence for murder",
      "content": "The Additional District Court I, Thanjavur, has awarded double life sentence with a fine on two persons who were found guilty of murdering a college student over a love affair in Thanjavur in 2013. According to police, the deceased, Manojkumar of Pudupattinam, Thanjavur, did not return home on December 28, 2013. Subsequently, his father, Sukumaran lodged a complaint with the Thanjavur Tahluk Police on December 30, 2013, stating that his son, pursuing a B. Tech course in a private university near Thanjavur was missing from December 28, 2013. While the police were pursuing the case, they received information that the body of a male person with injuries had been washed ashore in an irrigation channel on the outskirts of Thanjavur. The body was identified as Manojkumar by his family. On further investigation, the police ascertained that a love affair was the cause of the murder of Manojkumar as another person, Gopi of Muniyandavar Colony, Thanjavur, was also in love with a girl with whom the deceased had developed a relationship. Subsequently, the Thanjavur Tahluk Police arrested Gopi and his friend, Prasanth of Vilar Road, Thanjavur, who had reportedly assisted Gopi in committing the crime. The charge sheet was filed on April 1, 2015. After hearing the case, the Additional District Judge I, R.Sathia Thara awarded a double life sentence with a fine of ₹10,000 for section 302 of IPC and 4 years of imprisonment with fine of ₹2,000 for section 201 of IPC, on each of them on September 12, 2024. Gopi was involved in a total of 27 cases, including six murder and five attempt to murder cases, the police added.  Published - September 13, 2024 06:06 pm IST"
    },
    {
      "title": "Man accused of murdering daughter over her relationship with boy of another caste in Thanjavur district",
      "content": "In a suspected case of caste killing, a 19-year-old girl belonging to an intermediate caste was allegedly murdered by her father and a few of her relatives in Thanjavur district recently, after they learned that she was in love with a 19-year-old youth from the Adi Dravidar community.  Acting on a complaint from the youth, B. Naveen, of Poovalur in Pattukottai taluk, the Vattathikottai police booked a case under under Sections 302 (murder) and 201 (causing disappearance of evidence of offence) of the Indian Penal Code against the victim’s father Perumal, of Neivaviduthi, and some of his relatives. Perumal, along with some of his relatives, had allegedly cremated the body of his daughter Iswarya after murdering her on January 3.  According to the complainant, he and Iswarya, who both worked at a textile unit at Avarapalayam in Tiruppur district, were in love with each other. Mr. Naveen claimed he ‘married’ her (since he is underaged, the marriage is legally void) at a temple in Avarapalayam after he learned that her father was visiting Tiruppur with the intention of “separating them.” The couple later left for Veerapandi on January 1 and stayed in a rented house there.  Meanwhile, Perumal lodged a complaint with the Palladam police stating that his daughter had gone missing. The police had reportedly traced Iswarya and handed her over to Perumal on January 2. When Mr. Naveen returned to his native, he came to know from his friends that Iswarya had been murdered by her father and relatives. The police are on the lookout for Perumal and some of of his relatives.   Published - January 09, 2024 12:58 am IST"
    },
    {
      "title": "Double murder at housing board quarters in Thanjavur",
      "content": "A woman and a man, both government employees, were hacked to death allegedly by a gang at the Tamil Nadu Housing Board residential quarters on Tuesday. According to police, the incident took place at around 7 a.m., at the house in which the deceased, Vanitha, an office assistant at the District Collectorate, was residing. The other victim, Kanagaraj, also an office assistant in the Collectorate, was apparently staying in the house. Preliminary investigations revealed that Vanitha had taken a loan from her relative, Prakash and was yet to repay it fully. Prakash had already filed a complaint against her with the Thanjavur South Police stating that she had not repaid the loan amount in full. On Tuesday morning, Prakash and two others – a woman and a man -- came to the quarters where Vanitha was residing and picked up a quarrel with her and Kanagaraj. The trio then allegedly attacked Vanitha and Kanagaraj with lethal weapons, killing them on the spot. On seeing the bodies lying in a pool of blood, the children of Vanitha – a girl and two boys, raised an alarm. On hearing their screams, neighbours rushed in and later informed the police. Subsequently, the Thanjavur Medical College police arrived at the scene of the crime and took the bodies to the Thanjavur Medical College for post-mortem examinations. A case of murder has been registered and the police are on the look out for the culprits.  Get Outlook for Android  Published - November 26, 2019 12:06 pm IST  Tiruchi / Tamil Nadu / crime / murder / police "
    },
    {
      "title": "Two awarded double life sentence for murder",
      "content": "The Additional District Court I, Thanjavur, has awarded double life sentence with a fine on two persons who were found guilty of murdering a college student over a love affair in Thanjavur in 2013. According to police, the deceased, Manojkumar of Pudupattinam, Thanjavur, did not return home on December 28, 2013. Subsequently, his father, Sukumaran lodged a complaint with the Thanjavur Tahluk Police on December 30, 2013, stating that his son, pursuing a B. Tech course in a private university near Thanjavur was missing from December 28, 2013. While the police were pursuing the case, they received information that the body of a male person with injuries had been washed ashore in an irrigation channel on the outskirts of Thanjavur. The body was identified as Manojkumar by his family. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. On further investigation, the police ascertained that a love affair was the cause of the murder of Manojkumar as another person, Gopi of Muniyandavar Colony, Thanjavur, was also in love with a girl with whom the deceased had developed a relationship. Subsequently, the Thanjavur Tahluk Police arrested Gopi and his friend, Prasanth of Vilar Road, Thanjavur, who had reportedly assisted Gopi in committing the crime. The charge sheet was filed on April 1, 2015. After hearing the case, the Additional District Judge I, R.Sathia Thara awarded a double life sentence with a fine of ₹10,000 for section 302 of IPC and 4 years of imprisonment with fine of ₹2,000 for section 201 of IPC, on each of them on September 12, 2024. Gopi was involved in a total of 27 cases, including six murder and five attempt to murder cases, the police added.  Published - September 13, 2024 06:06 pm IST"
    },
    {
      "title": "Anti-social murdered in Thanjavur",
      "content": "TIRUCHI  A history sheeted rowdy was murdered by an armed gang at Ponthiripalaiyam under Thanjavur town west police station limits on Monday. The victim K. Viji alias Vijayan, 31, was involved in seven cases, including three murder cases. Police sources said Vijayan was walking alone in the morning when the armed gang which was apparently waiting attacked him with sharp weapons killing him on the spot and fled from the crime scene. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Previous enmity was the cause behind the murder, said the sources adding that three persons were detained later in the day in connection with the murder. The Thanjavur west police are investigating.  Published - October 28, 2019 08:29 pm IST"
    },
    {
      "title": "Two held for murder in Thanjavur",
      "content": "The Pandhanallur police in Thanjavur district have arrested a woman and her paramour for murdering the woman’s husband, Bharathi (38) of Old Street, Kizhamanthur near Thiruvidaimaruthur. According to police, the Pandhanallur police received a complaint from Selvamani of Kizhamanthur stating that his relative Bharathi of the same area was missing. When the police commenced their investigation, they were baffled by the contradicting statements from the missing person’s wife, Divya (27). Subsequently, Divya divulged that she and her lover, David (38) of R.J. Nagar, Kizhamanthur had murdered Bharathi at her home and interred the body in a watercourse at Pattam Cross Road near Thiruppanandhal last month. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Later, the body was exhumed and the Pandhanallur police arrested Divya and David.  Published - June 18, 2023 12:37 am IST"
    },
    {
      "title": "Man kills father in Thanjavur",
      "content": " A 24-year-old man allegedly murdered his father at their house at Ammankulam village in Thanjavur district in the early hours on Monday.  Thanjavur Taluk police arrested C. Chinnadurai on the charge of killing his father Chinnathambi. Police said Chinnathambi was an alcoholic and spent the money sent by Chinnadurai who was employed in Karur district.  A quarrel is said to have broken out between Chinnadurai and his father over the latter’s addiction to alcohol. Police said Chinnadurai allegedly threw a grinding stone roller on his father while he was asleep leading to his death. A case has been registered in this connection.   Published - December 12, 2022 07:14 pm IST"
    },
    {
      "title": "Murder case: four surrender",
      "content": "Four persons surrendered before the Sirkazhi Magistrate Court on Thursday in connection with the murder of an AIADMK cadre in Thanjavur. The police said Nanji P.Sekar, husband of Geetha Sekar, president of Nanjikottai village panchayat, was murdered by a four-member gang in front of a marriage hall at Nanjikottai in Thanjavur district due to previous enmity on Tuesday. Three special teams were formed to nab the culprits. Meanwhile, Balu (36) of Kulankarai near Thanjavur, Manikandan (25) of Thempur, Anandan (36) of Parangipettai and Kumar (34) of Meensurutti in Cuddalore district surrendered before the Magistrate Manimekalai at Sirkazhi in connection with the case. They were remanded in judicial custody.  Published - February 13, 2015 12:00 am IST"
    },
    {
      "title": "Five-year-old murder case detected in Thanjavur",
      "content": "A murder case that remained unsolved for more than five years in Thanjavur district was detected by a special police team formed recently. According to police, a special team was formed recently to detect the murder of a 35-year-old unknown male at Nariyakudi hamlet on the Thiruchitrambalam-Peravurani Road reported on July 13, 2019.  Upon receiving the information about the existence of a charred body of an unidentified person at Nariyakudi, the Thiruchitrambalam police registered a case under Section 302 of the Indian Penal Code and commenced the interrogation. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. During the interrogation, the Thiruchitrambalam police received information that about 100 goats reared by Mathiazhagan of Madathikadu hamlet, located at a distance of 5 km from Nariyakudi where the charred body was found, were stolen on July 8, 2019. However, the stolen goats were recovered by Mathiazhagan from Raja of Punalvasal located near Madathikadu within a few days. While handing over the goats to Mathiazhagan, Raja claimed that an unknown person who was goading the animals took to his heals on seeing Raja on July 8, 2019. As the information gathered during the preliminary investigation did not yield concrete evidence, the case was kept pending by the Thiruchitrambalam police. Recently, in July 2024, a special team was formed to detect the case and the team commenced its interrogation from Raja since the team suspected the veracity of his statements relating to the murder of the unknown person. As anticipated by the special team, Raja confessed that the deceased person was Arumugam of Pattukottai. Raja and Arumugam chalked out a plan to steal the goats reared by Mathiazhagan and implemented it. However, Mathiazhagan traced the stolen goats and regained them from Raja later. Two days after Raja handed over the possession of the goats to Mathiazhagan, Arumugam called on Raja. Suspecting that Arumugam would expose the truth, Raja murdered him and burnt the body using petrol. Raja was arrested on August 10 and remanded in judicial custody, police said.  Published - August 11, 2024 06:05 pm IST"
    },
    {
      "title": "Man arrested for murdering a patient and burying the body in his backyard after chopping it into pieces in Thanjavur district",
      "content": " A 47-year-old man was arrested on Sunday in Thanjavur district for allegedly murdering a 27-year-old man and chopped the body into pieces and buried them in the backyard of his house at Cholapuram village. The accused was identified as Keshavamurthy and has been lodged in the Tiruchi Central Prison.  Based on the reported confession of Keshavamurthy, the police exhumed the body parts on Sunday. A spot postmortem was done and the remains were handed over to the relatives of the victim identified as Ashok Raj of Manalmedu Maharajapuram village in Thanjavur district.  Keshavamurthy was staying alone at the village after being estranged from his two wives. He is said to have been offering Siddha treatment.  The police said the victim, Ashok Raj, who had been working in Chennai, returned home for Deepavali. He went missing from November 13 following which the Cholapuram police registered a missing person case on a complaint from his grandmother. It came to light during enquiries that Ashok Raj met Keshavamurthy apparently for treatment in his genitals. It is alleged that Keshavamurthy had indulged in homosexual activity with Ashok Raj apparently after the latter became unconscious after consuming some drugs.  Realising that Ashok Raj had died and fearing police action, Keshavamurthy had chopped the body into pieces and buried them behind his house. Some parts are suspected to have been thrown into a waterbody.  It came to light during inquiry that Keshavamuthy had allegedly committed the murder of a man identified as Mohamed Anas in a similar fashion in 2022. The Cholapuram police have registered a case under IPC Sections 302 (murder) and 201 (causing disappearance of evidence of offence).   Published - November 21, 2023 07:10 pm IST  Tiruchi / murder / crime "
    },
    {
      "title": "Murder case accused shot in leg in Thanjavur after he attacked Special Sub Inspector of Tiruvarur",
      "content": "A murder case accused Praveen was shot at on the leg by an Inspector of a special team after he allegedly attacked a Special Sub Inspector with a sharp weapon in his possession in Thanjavur district on Saturday night, March 11, 2023.  The incident occurred near a lighthouse at Manora close to Sethubavachatram when the special team of the Tiruvarur district police apprehended Praveen in connection with the murder of a notorious gangster Poovanur Rajkumar in Koradachery police station limits in Tiruvarur district on Friday.  Three special teams were constituted by the Tiruvarur district police to probe the murder of Rajkumar and apprehend six suspects on Saturday and produced them before the jurisdictional magistrate for remand, said the Superintendent of Police, Tiruvarur T.P. Suresh Kumar.  One of the special teams headed by Inspector Rajesh was on its way to Thanjavur district on information to apprehend Praveen, an absconding accused in the case.   The injured murder case accused Praveen who was shot at in his leg, receives treatment at the Government Hospital in Pattukottai in Thanjavur district on March 11, 2023. Photo: Special Arrangement  The team spotted Praveen near the lighthouse close to Sethubavachatram. Police sources said Special Sub Inspector Ilango caught Praveen when he allegedly attacked him with a sharp weapon in his possession.  Inspector Rajesh immediately pulled out his service pistol and shot at Praveen on his leg as an act of self defence, to save the Special Sub Inspector, said Mr. Suresh Kumar.  The injured Special Sub Inspector and Praveen were taken to the Government Hospital at Pattukottai. Praveen was subsequently shifted to the Thanjavur Medical College Hospital.  Mr. Suresh Kumar said there were previous cases against Praveen — one for assaulting a Special Sub Inspector in Tiruvarur district earlier and another in connection with robbery.   Published - March 12, 2023 01:28 pm IST"
    },
    {
      "title": "Madras High Court upholds life sentence imposed on man from Thanjavur district for killing boy",
      "content": "The Madurai Bench of the Madras High Court has upheld the life sentence imposed on a man by the First Additional District and Sessions Court, Thanjavur, for murdering an 11-year-old boy in 2017.  The court was hearing an appeal preferred by the convict, Viswanath, who was sentenced to life imprisonment for murdering the boy and to seven years’ imprisonment for causing disappearance of evidence. The victim, Kishore, was playing hide-and-seek with his friends in a playground near his house. He did not return home in the evening. His parents lodged a police complaint. Later, Viswanath surrendered and confessed to the crime. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. In his confession, Viswanath said he was smoking behind the compound wall of the playground when Kishore came and hid behind him. He asked the boy why he hid behind him when he himself was hiding there for smoking. Kishore allegedly abused him in foul language. Infuriated, Viswanath held the back of the boy’s neck and pressed it. The boy fainted. When he found the boy lifeless, Viswanath carried the body and buried it in a vacant plot adjacent to his house. Dismissing the appeal, a Division Bench of Justices P.N. Prakash and R. Hemalatha observed that the conviction and the sentence recorded by the trial court warranted no interference.  Published - July 15, 2022 09:23 pm IST"
    },
    {
      "title": "Two killed, six injured as cars collide in Thanjavur",
      "content": " Two persons died and six others were injured in a road accident involving two cars on Nilakottai Road in Thanjavur district on Sunday afternoon. Police gave the names of the deceased as Sanjay Gandhi, 40, and Sheikh Mohammed, 60. Sanjay Gandhi, who was driving the car, Sheikh Mohamed and three others were travelling to Ooranipuram from Thanjavur when the accident occurred. Their car collided head on with another car. Sanjay Gandhi and Sheikh Mohamed were killed on the spot. The injured were rushed to Thanjavur Medical College Hospital and a private hospital. The Tamil University police station are investigating the case.  Published - December 18, 2022 06:46 pm IST"
    },
    {
      "title": "NIA conducts searches at 15 locations in PMK functionary murder case",
      "content": "The National Investigation Agency (NIA) on Thursday conducted simultaneous searches on the premises of persons suspected to be associated with five absconding offenders in the PMK functionary V. Ramalingam murder case in Tiruchi, Thanjavur, Tiruvarur, Nagapattinam, Mayiladuthurai, and Karaikal districts.  Carried out by multiple teams of the NIA, which is probing the case, the searches at 15 locations led to the seizure of digital devices and documents connected to the case. Ramalingam was murdered on February 5, 2019, at Paku Vinayakam Thoppu in Thanjavur, allegedly by members and office-bearers of the Popular Front of India (PFI).  The accused conspired to kill Ramalingam as he had intervened in the forcible conversion of the underprivileged persons by a PFI team of Arivagam in Theni.  The investigation established that the violence was unleashed to strike fear among those who opposed the PFI, the NIA said in a release. The PFI has been declared an unlawful association under the Unlawful Activities (Prevention) Act by the Central government in September 2022.  The NIA had filed a charge sheet against 18 accused persons, including the five absconding persons, in August 2019 before the NIA Special Court in Chennai. The court declared the five absconding accused — Mohammed Ali Jinnah, Abdul Majith, Bhurkanudeen, Shahul Hameed, and Nafeel Hasan — as proclaimed offenders. The NIA has announced a reward of ₹5 lakh for information leading to their arrest, the release added.  Published - August 01, 2024 07:26 pm IST"
    },
    {
      "title": "Ramalingam murder case: NIA conducts searches at more than 10 places in Tiruchi, delta districts",
      "content": "National Investigation Agency (NIA) personnel carried out simultaneous searches at the residences of former members and functionaries of the banned Popular Front of India (PFI) in Tiruchi, Thanjavur, Tiruvarur, Nagapattinam and Mayiladuthurai districts on August 1, 2024.  The searches were said to be in connection with the murder of Pattali Makkal Katchi functionary V. Ramalingam at Thirubhuvanam in Thanjavur district in February 2019. The case is being probed by the NIA. Split into multiple teams, the NIA personnel conducted the searches at more than 10 places in the five districts. The searches were conducted at the residences of Amir Basha, former president of the PFI, at Kamaraj Nagar in Airport police station limits and at the residence of Mohamed Siddiq in Vazhavanthankottai in Tiruchi. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Police sources said searches were conducted at seven locations in Thanjavur district including Thirumangalakudi, Thirubhuvanam, Melacauvery near Kumbakonam, and Koranattu Karuppur. The searches in Tiruvarur district were conducted at Muthupettai and Kambur, Therazhandur and Vadakarai in Mayiladuthurai district, and at Thittachery in Nagapattinam district.  Ramalingam was murdered on the night of February 5, 2019, at Thirubhuvanam in Thanjavur district. The murder case which was initially registered by the Thiruvidaimarudhur police was subsequently taken over by the NIA. The NIA had in 2021 arrested Rahman Sadiq, an alleged key conspirator in the Ramalingam murder case, at Thanjavur. Members of the PFI were alleged to be involved in the sensational murder.   Published - August 01, 2024 10:46 am IST"
    },
    {
      "title": "Gangster murdered",
      "content": "A gangster was killed reportedly over personal enmity at Pattukkottai in Thanjavur district on Sunday night. The gangster S. Naina Mohammed (38) of Pookkollai area of Pattukkottai was riding a two-wheeler when a group of persons intercepted him and in the fracas pushed him down and smashed his head against a boulder killing Naina Mohammed on the spot before making good their escape. Upon information, police rushed to the spot, recovered the body and sent it to the Pattukkottai Government Hospital for post mortem. Further investigation is under way.  Published - July 19, 2016 12:00 am IST"
    },
    {
      "title": "Two held in connection with double murder",
      "content": "Tiruchi district rural police have arrested two youths from Thanjavur district on the charges of murdering two persons and dumping their bodies near Thuraiyur in Tiruchi district on Friday. The bodies of two men with stab injuries on their foreheads were found within a distance of five km from one another at water bodies. The police identified the deceased as K. Prabhu, 42, and E. Stalin, 44, both natives of Neduvakottai near Orathanadu in Thanjavur district. Two separate murder cases were registered at Thuraiyur and Jambunathapuram police stations. On Saturday, the police arrested S. Sivasuriya, 23, and K. Hariharan, 22, who also hails from the same place as the deceased.  Police sources said the accused had prior hostility with Prabhu over a relationship. At this juncture, the accused assaulted Prabhu and his friend Stalin using weapons and killed them at Thennamanadu in Thanjavur district. Later, they dumped their bodies at two different places near Thuraiyur.  Tiruchi District Superintendent of Police Sujit Kumar said the police were searching for one more person involved in the murders. Also, since the murder happened in the jurisdiction of Orathanadu police in Thanjavur district, steps would be taken to transfer the case to Orathanadu after completing the remand procedure of the arrested persons.  Published - May 06, 2023 07:33 pm IST"
    },
    {
      "title": "Youth murdered",
      "content": "The Thanjavur Taluk Police are investigating the cause of murder of a youth at Valamarkottai on Friday. According to police, the victim, Anand, 21, was attacked by a group of persons who were insisting him persistently to forego his affairs with a girl in the same area claiming that the girl was a sister to him by relation. An altercation ensued between the victim and the group led by Udhayakumar, 31, of Soorakottai on Friday morning over this issue at Valamarkottai during which Anand sustained injuries. He died at the Thanjavur Medical College Hospital on admission.  Published - April 22, 2022 07:45 pm IST"
    },
    {
      "title": "16-year-old domestic help found murdered at employer’s house in Chennai; police nabs six",
      "content": "A 16-year-old girl, who was engaged as a domestic aid by a businessman’s family was found dead at their house in Aminjikarai. After initial investigation, the police said it was a murder and that the girl had been tortured. Further investigation is on to establish who all are involved. The girl from Thanjavur was working at the rented house of Mohammed Nishad, 35, a businessman on Sadasivam Metha Street in Aminjikarai. She was under the care of her mother at her native after the demise of her father. She was brought to the city by two persons to be engaged in domestic work one and half years ago. On Friday, the house owner who came to know about the suspicious death alerted the police, who broke open the locked door of the house. The girl was found dead in the bathroom. The inmates of the house, including Mohammed Nishad, went missing. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Aminjikarai Police registered a case and began an investigation after sending the body to Government Kilpauk Medical College Hospital for post-mortem. After intensifying the investigation, police picked up six persons including Nishad, his wife Nivetha alias Nasiya, 30, another couple who are their friends and frequently visited the house, and two others - a woman and her brother who helped the family engage the girl as domestic aid. Police said the body of the girl bore burn and strangulation marks. They said that on Deepavali day, she was tortured and beaten up by one of the suspects. She went into the bathroom and was lying motionless despite the family members’ repeated calls. On learning that she was dead, they locked the house and fled without informing anyone. One of them contacted a lawyer who, in turn, alerted the police.  They were staying at friends’ house from where the police nabbed them. Police said their probe ruled out any sexual assault on the girl. The National Federation of Indian Women condemned the alleged killing of the girl. It alleged that the girl collapsed due to the beating despite doing domestic chores properly on Deepavali day. It also wanted the police to conduct a thorough probe and get suitable punishment for the culprits.  Published - November 03, 2024 12:27 am IST  Chennai / Tamil Nadu "
    },
    {
      "title": "Woman sexually assaulted and murdered at Thachankuruchi, man arrested",
      "content": "The Vallam police have arrested Karuppasamy, 30, of Thachankuruchi on charges of sexually assaulting and murdering a woman.  According to the police, Sharmila, 22, of Kosuvapatti, was staying at the house of her uncle Prabhu at Thachankuruchi after attending the funeral of her relative last week. On Friday evening, she picked a quarrel with her grandmother who was living with her uncle. She then called her uncle, who was attending a function at Nattani village, and expressed her wish to join him there.  Mr. Prabhu requested his friend, Karuppasamy, to bring Sharmila to Nattani on his motorcycle. As they did not turn up at Nattani even late at night, Mr. Prabhu and his relatives started searching for Sharmila and Karuppasamy whose mobile phones remained switched off. Around midnight, they found the body of Sharmila on the outskirts of the village and informed the Vallam police. The police sent the body for post-mortem and arrested Karuppasamy.   Published - November 18, 2023 08:59 pm IST  Tiruchi / sexual assault & rape / murder "
    },
    {
      "title": "Family, squabbles are biggest reasons for most murders in Tiruchi",
      "content": "Family disputes and petty squabbles are the motive behind most murders reported in the central zone, encompassing eight districts, this year. Thanjavur district topped the number of murder cases reported followed by Tiruchi and Nagapattinam districts. The number of murder cases was on the downswing this year in the zone as compared to last year. Encompassing Tiruchi, Thanjavur, Pudukottai, Ariyalur, Perambalur, Tiruvarur, Karur, and Nagapattinam districts, the central zone witnessed a total number of 219 murders and nine murder-for-gain cases till mid November this year. Last year, the figure was 262. The motives were varied and police are yet to ascertain the reason in some of the murder cases. The police have classified the motives behind murder under various categories which include murder for gain, family quarrel, petty quarrel, love affair or sexual motives, previous enmity, political rivalry, caste-related cases, drunken brawl, and others. According to police statistics, family quarrel was the cause behind 52 murders, while in 44 other cases the motive was petty quarrel. Previous enmity was the motive behind 34 other cases. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Love affair or sexual motives were behind 36 murders, while land or property disputes were the motives in 20 cases. There were nine murder-for-gain cases and in 14 others the reasons were “not known”. Thanjavur district was on top in respect of murders with the number of cases booked being 64. Tiruchi and Nagapattinam were second and third respectively with 37 and 33 cases. Although breakthroughs had been achieved in several murders, there were cases in which investigators were yet to make any headway. Two of them standout with one of them being the rape and murder of a Dalit girl at K.Pichampatty village in Karur district in June. Over four months have passed after the body of the girl was found inside a betel grove, but breakthrough still eludes investigators. Another murder case that is posing a challenge to the investigators is the murder of a woman Siddha doctor in Kollidam Tollgate area in Tiruchi district last month. The 56-year-old victim C.Juliet Mary, a widow, was found murdered in her house with the face completely covered with adhesive tapes. Though special teams were constituted to probe the case, investigators were yet to achieve a breakthrough.  Published - November 22, 2014 12:10 pm IST"
    },
    {
      "title": "Murder case accused murdered",
      "content": "Sathishkumar, 27, of Kamatchipuram near Reddypalayam was hacked to death by a gang in the vicinity of Thanjavur Medical College here on Tuesday. According to police, the deceased was arrested in connection with the murder of Manikandan of Reddypalayam in March 2021 and was out on bail. He went to the hospital on Tuesday to visit his friend, who was admitted for treatment to an injury suffered in a road accident. While he was at the hospital, friends of Manikandan came to the hospital and asked Sathishkumar to accompany them to have a cup of tea at a shop located on Medical College Road near the hospital. A few minutes later, Sathishkumar’s friends came to know that he was attacked by the gang with lethal weapons. Subsequently, they brought him inside the hospital where he was declared dead on arrival, police said.  Published - February 13, 2024 09:13 pm IST"
    },
    {
      "title": "HC acquits woman in murder-for-gain case",
      "content": "The Madurai Bench of the Madras High Court has acquitted a woman in a murder-for-gain case reported in Thanjavur district in 2016. The court observed that the case of the prosecution was infested with gaping holes. The court was hearing the appeal preferred by Selvi of Thanjavur district who had challenged the judgment of the Thanjavur Mahila Court that sentenced her to life imprisonment in 2020. The case of the prosecution is that on the day of the incident the appellant Selvi volunteered to take Kiliammal aged 85 years to the hospital.  It was said that the appellant had demanded gold jewellery from the elderly woman. When she refused to give the gold jewellery, the appellant is said to have attacked her with a wooden stick and caused her death. Later, the woman stole the gold jewellery and concealed the body. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. A Division Bench of Justices J. Nisha Banu and N. Anand Venkatesh observed that on an overall assessment of the manner in which the arrest and recovery had taken place in this case, it is unreliable and doubtful. The chain of circumstances gets snapped at various points. The recoveries that have been made were merely make believe ones and they do not inspire the confidence of the court. The court has absolutely no hesitation to come to the conclusion that the prosecution did not prove the case beyond reasonable doubts and the benefit of doubt must go to the accused, the judges said and acquitted the woman from all charges.  Published - November 01, 2022 09:46 pm IST"
    },
    {
      "title": "Girlfriend, seven others held for murder of youth",
      "content": "Vallam police have arrested a young woman and seven others in connection with the recent murder of her boyfriend Sakthivel, 23, of Thirumalaisamudhram near Thanjavur.  According to police, Sakthivel worked as a driver at a private milk products manufacturing company. He went missing on August 6. Subsequently, a ‘man missing’ complaint was lodged with the Vallam police by his brother Saravanan. Two days later, Ammapettai police passed on information to their Vallam counterparts that the body of an unidentified male was secured by them from a watercourse in their jurisdiction. On verification, it was ascertained that the deceased person was Sakthivel. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Further investigation revealed that Sakthivel and Devika, 20, daughter of Balaguru of Ayyasamipatti hamlet near Thirumalaisamudhram were in a relationship for some time against the wishes of both of families even though they belonged to the same caste. Police said reportedly aggrieved by the firm stand taken by Sakthivel that he would tie the nuptial knot with Devika only, the girl’s family hired henchmen from Madurai to murder Sakthivel with the help of Sathya of Sengipatti. The plan was executed at Balaguru’s coconut grove on August 6 and the body was dumped at the Grand Anicut Canal near Kuruvapatti by the gangsters. The Vallam police arrested Balaguru, his son Duraimurgan, Balaguru’s employee, Kathirvel, Sathya of Sengipatti, the henchmen, Girivasan, Santhoshkumar and Karthi of Madurai, and Devika since she was aware of the murder plan but preferred to remain quiet, and remanded them in judicial custody.  Published - August 15, 2023 08:03 pm IST"
    },
    {
      "title": "Police protection for Hindu outfits in Tiruchi, Thanjavur",
      "content": "Police protection has been provided to Hindu organisation offices in Tiruchi and the BJP office in Thanjavur in the wake of political murders reported in neighbouring Kerala in quick succession.  Police sources said protection had been provided to the Vishwa Hindu Parishad Office at Srirangam, Rashtriya Swayamsevak Sangh office at Woraiyur and Akhila Bharatiya Vidyarthi Parishad office in Fort police station limits. Protection had also been provided as a precautionary measure at the offices of the Popular Front of India and Social Democratic Party of India in Tiruchi.  The protection was being provided from Saturday in the wake of twin murders of a RSS worker and a SDPI member. Police personnel were maintaining a watch at these offices, the sources added.   Published - April 17, 2022 10:56 pm IST"
    },
    {
      "title": "Three held for murder of 15-year-old boy in Kumbakonam",
      "content": " A 15-year-old boy was murdered near Kumbakonam in Thanjavur district on Sunday (June 23, 2024). According to police, the boy hailed from Moopakovil in Kumbakonam and was reportedly in love with a girl living in the same area for the past few years. The girl suddenly broke off the relationship and found ‘new love’ with a 19-year-old boy, Poochi of Vazhinadappu.  She broke off that relationship too within three months and revived her old relationship with the minor boy. Irritated by her action, Poochi and his friends allegedly attempted to persuade him to stay away from the girl. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. On Sunday, Poochi and two of his friends allegedly took the boy to an agriculture field abutting the Melathukuruchi burial ground near Kumbakonam and attacked him with lethal weapons. Locals found his body the next day and alerted Melathukuruchi village administrative officer S. Elavarasan, who informed the police. The investigation led to the arrest of Poochi and his friends, Bharath, 20, of Melakottaiyur and a 17-year-old boy of Vazhinadappu, police said.  Published - June 25, 2024 05:25 pm IST"
    },
    {
      "title": "Relative of DMK MLA found murdered",
      "content": " A body of a 30-year-old man was found at a farm at Neikunnam village in Pandanallur police station limits in Thanjavur district early on Monday.   The man, who had deep cut injuries on his head, was identified as N. Kalaivanan of Neikunnam village. He was unmarried. Police sources said Kalaivanan left home on Sunday night to his farm but did not return. His body was found during a search. He was a close relative of Jayamkondam DMK MLA Ka.So.Ka. Kannan. The motive behind the murder and the culprits involved in the murder are being investigated by Pandanallur police.  Published - May 13, 2024 06:03 pm IST"
    },
    {
      "title": "IG meets families of murdered victims",
      "content": " Inspector General of Police-Central Zone V. Balakrishnan met the families of Scheduled Caste victims who were murdered due to previous enmity at Vadakku Vasal in Thanjavur district; Agarathirunallur in Tiruvarur district; and Pappakoil and Vedaranyam in Nagapattinam district on Friday.  Accompanied by the Superintendent of Police of the respective districts, Mr. Balakrishnan interacted with the families. He also met some children who had lost their parents due to COVID-19 in the three districts.  A police press release said he ascertained the requirements of the children for continuing their studies and their ambitions. The children were told about the opportunities available under the ‘Naan Mudhalvan’ scheme of the State government in identifying their latent skills and the guidance available for pursuing higher education. The children were told that the police department would extend all possible assistance in this regard.  The Superintendent of Police of the three districts were asked to create awareness among the children who had lost their parents due to COVID-19 and those of the murdered victims regarding the opportunities that were available in identifying their talents and pursuing their higher education.  Books and uniforms were distributed to the children to ensure that there was no interruption in their education. Relief materials were also distributed to the affected families. Mr. Balakrishnan inaugurated a library at the District Armed Reserve unit in Nagapattinam for police personnel and their families and a creche in Tiruvarur district to take care of children of women constables.  Published - March 20, 2022 07:44 pm IST"
    },
    {
      "title": "Thanjavur liquor deaths | T.N. police suspect cyanide may have been mixed to kill one of the victims",
      "content": "A day after two persons died due to suspected cyanide poisoning after consuming liquor at a licensed Tasmac bar in Thanjavur, police sources claimed it could have been a case of murder, targeting 36-year-old cab driver Vivek, one of the victims. While the source of the cyanide that was said to have been mixed with the liquor and the motive are under investigation, the sources said Vivek was the first to consume the “poison-laced” liquor. It is suspected that the other victim, Kuppusamy, 68, a daily wager in a fish market, drank the leftover liquor from the bottle used by Vivek. Key witness  A third person, to whom Vivek reportedly offered the liquor, did not consume it, and is now a key witness.  A forensic analysis of a sample of the leftover liquor confirmed the presence of cyanide, the sources said. The police said a preliminary inquiry revealed that Vivek was in a relationship with a woman. They are probing if she or anyone related to her had conspired to murder him. One strong possibility was that the cyanide may have been sourced from a goldsmith, as it is used in the process of making jewellery, according to the police.  A senior police officer said the authorities were investigating if a goldsmith or anyone associated with the jewellery manufacturing industry had visited the bar on Sunday morning. Since there was no CCTV camera in the bar, investigators were relying on eyewitnesses and sources. “That a goldsmith or someone associated with him could be involved is just one among many suspicions. We are not ruling out the possibility of a suicide,” a police officer said. Technical evidence Sources said there was no information that could connect the two victims. If it were to be a suicide, Vivek would not have offered a portion of the poisoned liquor to his friend, who survived, they said. A list of visitors to the bar on Sunday morning was being compiled, and special police teams would look for clues to determine if any of them was involved in the incident. The police were also perusing technical evidence, including surveillance camera footage in the locality, to achieve a breakthrough in the case, the sources added. (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104, Tele-MANAS 14416. and Sneha’s suicide prevention helpline 044-24640050)  Published - May 23, 2023 09:57 am IST  death / gangs & organised crime / Tamil Nadu / investigation / police "
    },
    {
      "title": "75-year-old Modi supporter dies after assault in Thanjavur",
      "content": " A 75-year old supporter of Prime Minister Narendra Modi died after he was allegedly attacked by a suspected supporter of the DMK-Congress alliance following a wordy duel near here, police said Sunday.  Police said they arrested Gopinath who got into an argument with the elderly man while the latter was seeking votes for the AIADMK-BJP alliance at Orathanadu late Saturday.  In a fit of rage, Gopinath attacked Govindarajan who was also a fan of AIADMK founder late M.G. Ramachandran.  The man collapsed and died on the spot, police said.  Gopinath was arrested Sunday and produced before court which remanded him to judicial custody, they added.  Police said Gopinath was stated to be a supporter of DMK-Congress alliance supporter.   Published - April 14, 2019 06:50 pm IST  murder "
    },
    {
      "title": "4 killed, 44 hurt in accident",
      "content": " Four persons were killed and 44 others injured when two buses collided at Pallavarayanpettai in Thanjavur district on Monday.  Among the dead were the drivers of the two ill-fated vehicles. The accident occurred when a private bus from Tiruvarur to Thanjavur and a TNSTC bus from Tiruchi to Nagapattinam were involved in a head on collision as the private bus driver tried to overtake a car. Upon information 108 ambulances from several spots as also Fire and Rescue Services personnel from Nidamangalam rushed to the spot and arranged for rescue and relief efforts. Driver of the private bus Raja (44) of Nidamangalam and a woman passenger in the bus were killed on the spot while the TNSTC bus driver Muruganandam (54) and a woman passenger travelling in that vehicle died on the way to the hospital. A total of 24 men, 19 women and a boy suffered injuries in the accident and were rushed to the Thanjavur Medical College Hospital where they were being treated.  Thanjavur Collector A. Annadurai visited the injured in the hospital and sought to know the details of the treatment being given to them. Ammapettai police have registered a case and are investigating.  Published - October 31, 2017 08:26 am IST"
    },
    {
      "title": "Man murders wife, two children",
      "content": " A 45-year-old man allegedly killed his wife and two minor sons at their house at Annapanpettai near Melattur in Thanjavur district in the late hours on Thursday.  The Melattur police arrested the accused C. Jayakumar, son of former Dravida Munnetra Kazhagam MLAs, on the charge of committing the triple murder. Jayakumar's father Chellappa and mother Yashodha were DMK MLAs of Valangaiman Assembly constituency in 1977 and 1989 respectively.  Police gave the names of the deceased as J. Anitha, 38, and her sons J. Dinesh, 9, and J. Tharunesh,7. Jayakumar's wife Anitha worked as a teacher in a private matriculation school at Thanjavur. The couple's sons were studying fourth and second standard.  Police said Jayakumar, who was looking after farming operations, and his wife had some domestic issues. Jayakumar, said to be an alcoholic, was allegedly drunk on Thursday night when a quarrel broke out between the couple.  The tiff accelerated and in a fit of rage Jayakumar allegedly attacked his wife with a spade on her head causing grievous injury. He is also said to have attacked his two minor sons with the same spade when they came to the rescue of their mother.  On hearing their alarms, local residents rushed to Jayakumar's house and shifted the injured woman and her sons to the hospital. Police said the two boys died on the way to the hospital, while Anitha succumbed to injuries at the Thanjavur Medical College Hospital on Friday morning. The Melattur police has registered a murder case on a complaint preferred by Anitha's brother Palanisamy.   Published - July 20, 2018 05:34 pm IST  crime "
    },
    {
      "title": "Murder of domestic help in Aminjikarai: Chennai Police arrest six persons",
      "content": "The Chennai city police on Sunday (November 3, 2024) said six persons, including two couples were arrested for the murder of a 16-year-old girl, who was engaged as a domestic help by a businessman’s family in Aminjikarai. She was physically tortured to death by the inmates of the house on the day of Deepavali alleging that she was not doing the work.  Police said that they received information from Sarbuddin, owner of the house located on the second floor of Eden Castle apartment in Metha Nagar, Aminjikarai, on Friday (November 1, 2024) about the suspicious death of the girl at the house owned by him.  Sarbuddin had rented out the house to Mohammed Nishad (35) and his family. Following the complaint, police recovered the body of the girl who was lying dead in the bathroom of the house under suspicious circumstances and the inmates of the house were missing from the house. Police began an investigation treating the death as suspicious and sent the body to Government Kilpauk Medical College Hospital for post-mortem.  On investigation, police identified that the girl was from Thanjavur. Her mother was not able to take care of the child at her native after the demise of her father. She was brought to the city by two persons to be engaged as the caretaker of a four-year-old child of Mohammed Nishad at the rented house in the apartment. She had been working since December 2023.  The preliminary report of post-mortem and investigation revealed that the girl’s body bore burn and injury marks indicating the physical cruelty meted out to her by the inmates of the house.  Police nabbed — Mohammed Nishad; his wife Nivetha alias Nasiya; their friends Lokesh and his wife Jayashakthi; Nishad’s sister Seema Begam (39) and Mageshwari (40); a domestic help of Lokesh — and interrogated them. “The investigation revealed that Mohammed Nishad, his wife and others had physically tortured the girl for the last three months as she was not able to do domestic chores properly,” the police said.  They attacked her on Deepavali day and it led to her death. Leaving her dead in the bathroom, they escaped from the house after locking it. One of them informed a lawyer who in turn alerted the house owner Sarbuddin and police.  After a lengthy interrogation, Aminjikarai police on Saturday night (November 2, 2024) arrested six persons — the two couples, Nishad’s sister Seema Begum and Lokesh’s domestic aid from Kovilambakkam — on charges of offences including murder. They were remanded to judicial custody.   Published - November 03, 2024 04:01 pm IST  Tamil Nadu / Chennai / murder / death "
    },
    {
      "title": "College girl found murdered",
      "content": "Police are on the lookout for a youth in connection with the mysterious death of a college girl whose corpse was recovered near Orathanad in Thanjavur district on Tuesday. K. Sakunthala Devi (19) was found dead near her house at Naduvikkottai after returning from college. It was found that she had been strangulated to death with her duppatta. Orathanad Deputy Superintendent of Police Sengamala Kannan and other police personnel visited the spot, seized the body and sent that to the Thanjavur Medical College for post mortem examination. Inquiries revealed that Sakunthala Devi had been moving friendly with a youth who was found missing since her death. Police have mounted a search for him. Further inquiries are under way.  Published - February 26, 2015 12:00 am IST"
    },
    {
      "title": "NIA searches PFI offices in Tiruchi, Thanjavur, Karaikal",
      "content": "Officers of the National Investigation Agency (NIA) conducted simultaneous searches at 20 locations in Thanjavur, Tiruchi and Karaikal on Thursday, in connection with the murder of PMK functionary V. Ramalingam in Thanjavur in February. Among the places searched were four offices of the Popular Front of India (PFI) and houses of the accused already arrested and those absconding.  The State police, which had registered a case, had arrested 10 accused. Six are absconding. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Split into teams, the NIA officials, armed with search warrants, carried out the operation with protection provided by the local police. Sources said the NIA conducted a search at the house of one Mohamed Hasan Quthoos at Karaikal and seized a hard disk, laptop and some books, besides unaccounted money. Quthoos was allegedly involved in the murder of Ramalingam. Thereafter, a search was conducted at the PFI district unit office at Karaikal town and it concluded by afternoon. NIA teams carried out similar searches at the PFI office in Thanjavur town for about 45 minutes. In Tiruchi city, another NIA team searched the premises of the PFI situated in Palakkarai.  The search went on for over eight hours. Gun totting police personnel were deployed in front of the PFI office in Tiruchi city while the NIA officers conducted the search. The searches at the PFI offices comes a day after an NIA team inquired the victim Ramalingam’s son Shyam Sundar at Thiruvidaimaruthur.  The searches led to the seizure of a number of digital devices, including 16 mobile phones, 21 SIM cards, laptops, hard discs, memory cards and CDs/DVDs. Besides, a sword, a sharp-edged knife and ₹2 lakh in cash were recovered from 3 different houses and about 100 incriminating documents were also seized, an NIA press release said. M. Mohamed Ibrahim, PFI Tiruchi district president, in a statement, alleged that the search was an attempt to tarnish the image of the organisation. The NIA had created an “extraordinary situation” by carrying out a search at the PFI office premises at Tiruchi, he said, and added that the organisation would take legal action against the search. PFI Tiruchi district secretary Mohamed Siddique told reporters that the NIA team had only conducted a search and no PFI member was questioned.  Published - May 03, 2019 12:57 am IST"
    },
    {
      "title": "DGP commends police for swift arrest in Velankanni murder case",
      "content": " Director General of Police (DGP), Tamil Nadu, Shankar Jiwal, has commended and rewarded police personnel for their swift and coordinated efforts in arresting the suspects involved in the Velankanni murder case. On March 8, near Velankanni Railway Station, Janarthanan ,22, a resident of Bengaluru, was murdered by two unidentified individuals who fled towards Thanjavur by train. Immediately after the incident, Nagapattinam District Special Branch Inspector Anandarajan relayed details, including descriptions of the suspects’ clothing, to Thanjavur District Special Branch Inspector Ramadas. On the instructions of Superintendent of Police, Thanjavur District, special teams launched a search operation at Thanjavur Railway Station. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. During the operation, two individuals attempting to flee through the rear exit were intercepted, interrogated, and confirmed as the suspects. They were handed over to Velankanni police. Thanks to the quick response and coordination, the suspects were apprehended within an hour.  In recognition of their exemplary service, Mr. Shankar Jiwal personally appreciated and rewarded the officers at a felicitation ceremony at the Chief Office in Chennai on Friday.  Published - March 14, 2025 07:23 pm IST"
    },
    {
      "title": "Five persons arrested for PMK functionary’s murder",
      "content": "Five persons were arrested on Thursday on the charge of murdering V. Ramalingam, 42, of Thirubhuvanam, a PMK functionary, on Tuesday night. The Thiruvidaimaruthur police arrested Nizam Ali, 33, Riswan, 23, and Sharbudheen, 60, of Thirubhuvanam, Azarudheen, 26, of Thiruvidaimaruthur and Mohammed Ryas, 27, of Kurichimalai.  They were booked under sections 302, 294b, 307, 341, 143, 147 and 149 of IPC based on a complaint lodged by Ramalingam’s son, Shyamsundar. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. When the accused were produced brought to the District Sessions Court at Thanjavur by the police citing a law and order problem, they were directed to the trial court at Kumbakonam.  Subsequently, the accused were taken to the Judicial Magistrate Court-I where their remand in judicial custody was ordered.  Thereafter, the accused were lodged at the Central Prison, Trichy, the police said. Meanwhile, BJP national secretary H. Raja, who called on the grieving family members of Ramalingam, demanded re-enactment of the anti-religious conversion law in Tamil Nadu.  Mr. Raja claimed that Ramalingam was hacked to death only because he had raised his voice against the attempts by the members of the Popular Front of India to convert Hindus into Islam. He accused the police of attempting to brush the truth under the carpet by inquiring others. Instead of tracing the car the assailants had used to commit the crime, the police impounded Ramalingam’s vehicle and his mobile phone, Mr. Raja also charged. In 2002, Chief Minister Jayalalithaa had enacted a law against forcible religious conversion.  However, the law was repealed by an ordinance two years later.  Published - February 08, 2019 01:19 am IST"
    },
    {
      "title": "Peravurani man murdered in Perambalur",
      "content": "A 42-year-old person of Mavadukurichi near Peravurani in Thanjavur district was murdered here on Saturday. The dead had been identified as A. Arivu alias Arivazhagan. He had deep cut injuries on his head. He was found dead in a pool of blood near a petrol bunk in the town. Sources said his brother owed money to P. Azhagiri (31) of Ammapalayam in Perambalur district. The dead had acted as a mediator in repaying the money to Azhagiri. Arivazhagan had allegedly failed to keep up his promise. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The Perambalur police that filed a case have arrested Azhagiri on the charge of murdering Arivazhagan.  Published - February 07, 2016 12:00 am IST"
    },
    {
      "title": "Charred body of murdered French National found",
      "content": " The charred body of a French tourist, who was murdered, was found in Thanjavur district on Sunday. Soon after recovering the remains of the tourist, identified as Pierre Bernard Robert Rene, 68, The police arrested C. Thirumurugan, 29, a resident of Aavikottai in connection with the crime that came to light after an abandoned suitcase was recovered on Saturday.  Upon opening the suitcase, the police found the French passport of the victim, Pierre Bernard Robert Rene, 68, a diary and ATM cards. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. As the diary contained the name of Thirumurugan, the police questioned him. Police sources said Pierre had come from Chennai to Tiruchi on August 3 and stayed in a lodge from where he was picked up by Thirumurugan. The two went to Pattukottai and Mannargudi in a car from Tiruchi and allegedly consumed liquor. A heated argument is said to have broken out between the two at the latter’s house at Aavikottai. Police suspect that the two were in a homosexual relationship.  A case has been registered against Thirumurugan. Police said Pierre collapsed after being allegedly pushed by Thirumurugan and became unconscious. Fearing that Pierre had died, Thirumurugan put his body in a wash area in his house in Aavikottai and set it on fire after pouring petrol. The charred body was wrapped in three gunny bags and dumped on the roadside at Moothakurichi village near Madukkur. Superintendent of Police, Thanjavur T. Senthil Kumar said the recovery of Pierre’s suitcase helped in cracking the crime. Thirumurugan reportedly revealed to the police the entire sequence of events. The body was sent to the Thanjavur Medical College Hospital for a post mortem. The Madukkur police detained Thirumurugan and conducted an detailed inquiry with him till Sunday night. A case under IPC section 302 (murder) 201 (Causing disappearance of evidence of offence) has been booked against him by the Madukkur police.  Published - August 13, 2018 01:10 am IST  murder "
    },
    {
      "title": "Insurance officer murdered",
      "content": "A 25-year-old Assistant Administrative Officer was murdered by his colony mate here on Wednesday. Police said that Jhony Kumar, son of Jagadish Chander of Bhiwanj district in Haryana and a qualified chartered accountant, joined the LIC Divisional Office here on December 29 last as an AAO. On Wednesday, his colony mate at Pillukaratheru here Senthil Kumar (45) had taken him out for a ride from his office during office hours. When Jhony Kumar did not return to duty, his colleagues went in search of him for getting the safety locker keys. Senthil Kumar rang up a friend of Jhony Kumar and confessed that he had murdered Jhony Kumar. Investigation is under way. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Published - January 21, 2016 12:00 am IST"
    },
    {
      "title": "Life term for wife, two others in murder case",
      "content": "The District and Sessions Court here sentenced to life thee persons for murdering a man two years back. District Judge (additional charge) Rajasekaran, who heard the case, found Ramya (31), wife of the murdered Chandrasekar of Seruvaviduthi near Pattukkottai in Thanjavur district, her paramour Nadimuthu (32) and his friend Y. Subash (23) of Karamabkudi in Pudukkottai district guilty of murdering Chandrasekar on September 10, 2012. The victim had asked his wife Ramya to distance herself from Nadimuthu which had reportedly enraged the offenders. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Chitrambalam police had registered a case and following inquiry it came to light that the three had committed the offence and had tried to erase evidence. Judge Rajasekaran sentenced Nadimuthu to triple life terms for conspiring, abducting and killing Chandrasekar, twin life terms to Subash for abducting and killing and twin life terms for Ramya for conspiring and killing her husband. The sentences were to run concurrently, he ordered.  Published - August 06, 2015 12:00 am IST"
    },
    {
      "title": "Two killed in blast at cracker unit",
      "content": "THANJAVUR Two persons were killed and another person was injured when a blast ripped through an illegal cracker manufacturing unit near here on Wednesday. The unit was engaged in the manufacture of country fire crackers meant for use during temple festivals and funeral processions. Police said Nagarajan (33) of Vilar near Thanjavur and Pichaiyan (52) of Raramuthirakottai near Ammapettai were employed in the illegal country cracker manufacturing unit owned by Ganapathy (48) of Cholan Nagar. The unit was functioning on the land belonging to Muthamilselvan at Raramuthirakottai. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. On Wednesday, suddenly some crackers went off when Muthamilselvan, Nagarajan and Pichaiyan were at the unit. While Nagarjan was killed on the spot, Pichaiyan died on way to hospital. Muthamilselvan has been admitted to Thanjavur Medical College Hospital with serious injuries. Ammapettai police registered a case. Kumbakonam Sub-Collector Pradeep Kumar, Papanasam Tahsildar Rani and DSP Selvaraj rushed to the spot and conducted inquiries. Inquiries revealed that the licence to operate the cracker manufacturing unit expired on January 31, 2016, and that the unit was functioning illegally. The owner of the unit, Ganapathy, was arrested and further investigations are on.  Published - May 31, 2017 09:11 pm IST"
    },
    {
      "title": "DIG suspends Police Inspector",
      "content": "The Deputy Inspector General of Police, Thanjavur Range, Ziaul Haque on Tuesday placed under suspension the woman Inspector of Police, Ayyampettai Police Station in Thanjavur District Police on charges of dereliction of duty. According to police, the suspended inspector, M. Ravimathi, received a complaint from Siva Manikandan, 28, of Pasupathikovil, a mini-bus driver, on December 6 night stating that a group of persons threatened him while he drove his vehicle to fill the fuel tank at a petrol bunk in Pasupathikovil area. Subsequently, Siva Manikandan was hacked to death on December 7 evening at Ayyampettai bus stand by a three-member gang. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Meanwhile, three persons surrendered at the Magisterial Court, Jayankondam in connection with the murder of Siva Manikandan.  However, the relatives of the deceased claimed that the brutal murder on December 7 could have been averted if the police had acted promptly on receiving the complaint of life threat from the deceased.  Published - December 10, 2024 07:13 pm IST"
    },
    {
      "title": "Two killed as slab collapses during renovation in Ayyampettai",
      "content": " Two construction workers died on Sunday when a slab collapsed during the renovation of an old house in Ayyampettai in Thanjavur district. The incident took place when B. Faizal ,52, was renovating his old house in the Railadi area of Ayyampettai. Five workers were hired for the work. On Friday evening, the workers were demolishing parts of the first floor when the slab gave way. G. Manikandan ,30, from Sakkarappalli, and K. Kumar, 23, from Ayyampettai, were trapped under the collapsed slab. Both were crushed by the falling debris. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Other workers raised an alarm, and locals rushed to rescue them, but their efforts were in vain. The Papanasam fire station was alerted, and firefighters arrived at the scene to rescue the trapped workers. Unfortunately, both were found dead.  The Ayyampettai police arrived at the site and sent the bodies for post-mortem examination at Thanjavur Medical College.  Manikandan is survived by his wife and two daughters, while Kumar was unmarried.  Published - December 01, 2024 09:08 pm IST"
    },
    {
      "title": "Thanjavur schoolgirl death: CBI team begins investigation at school",
      "content": "A team of sleuths from the Central Bureau of Investigation (CBI) arrived at Michalepatti village near Thirukattupalli in Thanjavur district, to interrogate the authorities of the school at which a 17-year-old girl student died by suicide last month. The investigation into the cause of death of the girl student was transferred to the CBI, following a Madras High Court (Madurai bench) plea for a CBI probe, by the parents of the deceased girl, who hailed from Vadugampalayam hamlet in Ariyalur district. Initially on January 16, the Thirukattupalli police booked a case under the Juvenile Justice Act and under the IPC sections - sections 75 (punishment for cruelty to child) and section 82 [1] (indulging in corporal punishment with the aim of disciplining a child) of the Juvenile Justice Act and section 305 (abetment of suicide of child or insane person) and section 511 (punishment for attempting to commit offences punishable with imprisonment for life or other imprisonments). The police arrested the 67-year-old hostel warden of the school. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Subsequently, after the death of the girl student on January 19, the case took a different turn with charges that the girl had been forced to end her life after attempts at forcible conversion by the school.  The team of CBI sleuths, led by the Tamil Nadu 1998 batch IPS officer, Vidya Jayant Kulkarni appointed as the Joint Director, CBI in November last year, arrived at Michalepatti on Monday afternoon and commenced their investigation by interrogating the school and hostel authorities and inspecting the school and hostel premises, police said.  Published - February 21, 2022 03:14 pm IST  Tamil Nadu "
    },
    {
      "title": "Woman arrested for killing daughter and throwing the body in a river",
      "content": "A 30-year-old woman V. Vijayalakshmi, a widow, was arrested on Sunday in Thanjavur on charges of killing her seven-year-old daughter and throwing the body in a river. Along with Vijayalakshmi, her distant relative R. Vetrivel (36) has also been arrested by the Thanjavur East Police on the same charges.  Police sources said after her husband's death, Vijayalakshmi - of Gandharavakottai in Pudukottai district - came to Thanjavur with her children Vidya (7) and Vignesh (4). The woman is alleged to have developed intimacy with Vetrivel who resided in Thanjavur. Vetrivel - an alcoholic - is said to have frequently visited Vijayalakshmi in her house. Sources said Vetrivel under the influence of alcohol visited Vijayalakshmi's house in the late hours on Saturday and allegedly made advances. However, Vijayalakshmi had avoided him purportedly because her daughter was awake. Irked over this, Vetrivel reportedly assaulted Vijayalakshmi. On hearing her mother’s scream, Vidya reportedly tried to intervene. She was allegedly assaulted by Vetrivel and pushed to the ground. The minor girl developed a seizure following the assault and was rushed to the hospital where she was declared brought dead. Vetrivel and Vijayalakshmi thereafter allegedly tried to bury the body in a burial ground but could not carry out the act as there was public movement. Later, they carried the body and threw it in a river. The entire crime came to light after a local resident alerted the police. Vijayalakshmi and Vetrivel reportedly confessed to their crime while being inquired. A search has been launched by fire fighters to retrieve the body of the girl.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Published - September 19, 2021 07:59 pm IST"
    },
    {
      "title": "55 years on, scars of the gruesome Keezhvenmani massacre run deep",
      "content": " G. Palanivel | Photo Credit: M. Srinath  The wound on the thigh of G. Palanivel, just above the knee, that required 14 stitches has healed. However, even after 55 years, the scar of the semi-circular cut made with a sickle constantly reminds him of the spine-chilling night of December 25, 1968. Mr. Palanivel, now 77, is the survivor of the gruesome massacre that took place in Keezhvenmani, a village then located in the composite Thanjavur district, in which 44 people – including 20 women and 19 children – were locked in a hut and burnt alive by landlords for rallying under the red flag and demanding a hike in wages. All victims were agricultural labourers.  “I managed to escape. But the henchmen of the landlord, Gopalakrishna Naidu, hacked my thigh with a sickle. I ran away, taking advantage of the pitch darkness, and hid in the paddy fields with some other workers,” recalled Mr. Palanivel, who was 22 then.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Next day, Mr. Palanivel was taken to hospital where the wound was closed with 14 stitches. “I also had six pellets in my body. They fired at me and the others with a gun meant for hunting egrets and other water birds. Though they were removed, the itch is still there,” said Mr. Palanivel, showing his ankle where the skin had turned rough because of allergy. Subsequently, he had spent six months and 19 days in the Thanjavur prison before being shifted to Tiruvarur.  Sitting beside Mr. Palanivel is T. Sethupathi, the younger brother of Ramaiah in whose hut the Scheduled Caste workers took refuge when they were surrounded by the landlord’s henchmen. The incident was made into a documentary, Ramaiahvin Kudisai (Ramaiah’s Hut), by Bharathi Krishnakumar. It is also the subject matter of Indira Parthasarathy’s award-winning novel Kuruthipunal.  Besides Ramaiah, his wife Papa, daughter Chandra, son Asaithampi and three-year-old child Vaskuki were charred to death.  U. Selvaraj, another survivor, lost his grandmother and aunt in the massacre. “The scene was strangely reminiscent of a cremation ground, not so much an ordinary crematorium where bodies seek their painless extinction but an eerie place where tender childhood, bashful youth and loving motherhood met their abrupt, cruel end in agony and despair,” wrote late Communist leader Mythily Sivaraman, the first outsider to enter Keezhvenmani, now part of the Nagapattinam district.  The shifting sands of Tamil Nadu’s politics were more pronounced in the composite Thanjavur region where Communists and the Dravidian movement gained ground. The paddy fields in the composite Thanjavur district were owned by a few landlord families. They meted out whipping and forceful drinking of cow dung mixed in water to workers who resisted their diktats. While the landlords remained largely with the Congress, the agriculture labourers, mobilised by the Communist leaders, including B. Srinivasa Rao, Manali Kandasami, Kathamuthu, G. Veeraiyan, K.R. Gnanasambandam, and Amirthalingam, raised a banner of protest and demanded higher wages.  Ms. Sivaraman had noted that Thanjavur had the highest proportion of landless labourers – for every 10 cultivators, there were nine labourers in 1961.  The 1971 Census found that 41% of the rural population comprised landless labourers, while the State average was 29%. Thanjavur also had the highest percentage of Harijans among the landless. The landlords ruled the roost.“Tea stalls used to keep aluminum cups for the Dalits.... My brother was already cultivating the land of the local landlord and insisted that I take care of his cattle instead of going to school...I had no option,” recalled Mr. Palanivel.  It was the Communist movement that changed the fortunes of the Dalit farm workers in the region. But both the party and the workers had to pay a heavy price. “All that the workers demanded was just half-padi (measure) paddy more than what they were receiving as wages. But the landlords insisted that the Communist party flag be removed first and they join the Paddy Producers’ Association. The Dalit peasants, however, rejected the landlords’ demand,” recalled CPI(M) Politburo member G. Ramakrishnan.  Gopalakrishna Naidu, founder of the Nagapattinam Taluk Paddy Producers Association, representing the landlords, would send workers from outside for harvest whenever local agricultural labourers demanded higher wages and refused to work for the rates fixed by landlords. A series of confrontations and a few murders over the years culminated in the massacre at Keezhvenmani since the workers were under pressure to join the Paddy Producers’ Association.  On the day when the massacre happened, two peasant leaders – Muthusamy and Munian – were beaten up and locked in a house. The peasants went as a team and released them and it resulted in the killing of Pakkirisamy, an agent of the landlord. The retaliation started in the night.  “The landlords’ frustration, and inability to reconcile themselves to the Harijans’ new-found identity found expression on December 25, 1968, in Keezhvenmani,” says Ms. Sivaraman, whose writings were published as a book, Haunted by Fire, Essays on Caste, Class, Exploration and Emancipation.  Though the Sessions Court awarded them 10 years’ imprisonment, the High Court acquitted Gopalakrishna Naidu and others on the ground that those who committed the arson were unaware that 42 persons were inside the hut. Naidu was subsequently killed by members of Left parties.  Mr. Ramakrishnan said the massacre forced the government to appoint the Ganapathia Pillai Commission, which recommended enactment of Minimum Wages Act and it was implemented. It also recommended house pattas for Dalit peasants. As many as 1,80,000 families had benefited.  A memorial for the victims was set up in 1970 and the Communist parties continue to retain their ground though the Dravidian parties and their emergence as ruling parties continue to pose a challenge to them.  “Today, caste discrimination has come down drastically. We maintain a cordial relationship with the families of other communities and attend marriages and other functions. This is not possible [in places] where the Communist parties are not strong,” says Mr. Palanivel.  Published - December 21, 2023 09:44 pm IST"
    },
    {
      "title": "Accused in double-murder case surrenders",
      "content": "A day after a middle-aged woman and her 24-year-old daughter were found murdered in their house at Periyamilaguparai here, the latter's husband Ulaganathan, the suspect, surrendered before a court in Kumbakonam in Thanjavur district on Friday. The Sessions Court police named Ulaganathan as accused in the double-murder case. Police sources said Ulaganathan, who surrendered before the court, was lodged in the sub-jail in Thanjavur. He is alleged to have murdered his mother-in-law Kalaiselvi, 47, and wife Pavithra and left the house with his infant daughter, after locking the door from the outside. Ulaganathan was married to Pavithra in 2015.   Published - September 25, 2020 09:51 pm IST"
    },
    {
      "title": "Jacto-Geo members stage protest in Madurai condemning murder of teacher",
      "content": "Members of the Joint Action Council of Tamil Nadu Teachers’ Organisations - Government Employees’ Organisations (Jacto-Geo) on Thursday staged a demonstration at Madurai Collectorate condemning the murder of a 26-year-old government school teacher, Ramani, on school premises in Thanjavur district. The Jacto-Geo members urged the State government to provide a job to one family member of the deceased. They said the compensation amount of ₹5 lakh announced by the Chief Minister was not adequate, and demanded an appropriate compensation. District secretary K. Neethiraja complained that watchmen were not posted at government schools. He said watchmen should be appointed in all schools for both morning and night shifts considering the safety of the teachers and the students. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. He said anti-social elements were taking advantage of the lack of watchmen in schools and using the school buildings for consumption of alcohol, etc. In order to curb this practice, CCTV cameras should be installed in schools and police should regularly monitor the schools. Stringent action should be taken against the violators, he said. The Jacto-Geo members also demanded that vacancies in the posts of teachers and sanitary workers should be filled as expeditiously as possible.  Published - November 21, 2024 11:23 pm IST"
    },
    {
      "title": "PMK man’s murder | NIA conducts searches at 21 locations in Tamil Nadu",
      "content": "The National Investigation Agency (NIA) on Sunday “raided” the houses of five proclaimed offenders and suspects at 21 locations in Tamil Nadu in connection with the murder of PMK functionary Ramalingam in Thanjavur in February 2019.  Among the locations searched was the house of ‘Nellai’ Mubarak, State president of the Social Democratic Party of India (SDPI). The others under the scanner included the absconding accused, Mohammed Ali Jinna, Abdul Majith, Bhurkhanudeen, Shahul Hameed and Nafeel Hassan, all members of the banned Popular Front of India (PFI). The NIA also announced a reward of ₹5 lakh each to anyone providing information leading to the arrest of any of the five absconders. “Several digital devices and documents” were seized during the searches in Thanjavur, Madurai, Tirunelveli, Tiruppur, Villupuram, Tiruchi, Pudukkottai, Coimbatore and Mayiladuthurai.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The accused in what has been dubbed by the NIA as the “PFI conspiracy case” have been charged with conspiring and killing Ramalingam in an extremely violent “jihadi manner” as he objected to the “forcible conversion” of underprivileged persons by a Dawah team/proselytisation team dispatched from Arivagam, Theni (now attached as the proceeds of terrorism under Section 25 of the Unlawful Activities (Prevention) Act, 1967).  The agency said in a release that according to investigations, the violence was instigated to instil fear in PFI opponents and drive a wedge between the communities by inciting communal hatred and violence. The prosecution of the others arrested in the case is under way before the NIA Special Court in Chennai.  Mr. Mubarak told reporters that the NIA team seized his mobile phone. He alleged that the Union government was threatening the minority communities under one pretext or the other. The SDPI would face the case legally, he said, claiming that the action was similar to the one taken by the Enforcement Directorate against the political opponents of the ruling party at the Centre.  In Tiruchi, the house of Afsal, formerly with the PFI, was searched. In Mayiladuthurai district, the house of Nishar Ahmed on Pattakkal Street at Therizhandhur in Kuthalam taluk was searched. In Thanjavur, the agency searched the house of Bakruddin at Natarajapuram South in the medical college police station limits. Searches were conducted at the houses of Abdul Majid in Kumbakonam, Mohammed Farook at Rajagiri and Mohammed Ali Jinnah at Thirubuvanam.  In Tiruppur, the premises of B. Mubarak Basha, of the PFI, at G.K. Garden in Velampalayam was searched. The NIA sleuths also landed at the house of M.Y. Abbas on H.M.P.R. Street at Kottaimedu in Coimbatore.  Sources said Abbas was questioned to ascertain if he had any contact with the five absconding persons. Abbas was in charge of the Kurichi and Aathupalam areas of the PFI and a close associate of A.S. Ismail, national executive committee member of the PFI, who was arrested by the NIA last year. The NIA sleuths also summoned and questioned him at their office.  In Tirunelveli, a four-member NIA team searched Mr. Mubarak’s house at Melapalayam from 5.50 a.m. to 9.30 a.m. A large number of SDPI workers assembled in front of Mr. Mubarak’s house and raised slogans demanding “justice for the minority communities”. A large number of policemen were deployed in the area. Searches were also conducted at the house of Mohammed Rafiq, a former functionary of the PFI, at Usilankulam.  Manithaneya Makkal Katchi president M.H. Jawahirullah condemned the searches at Mr. Mubarak’s house. He alleged that the move was aimed at diverting attention from the Manipur crisis.   Published - July 23, 2023 09:04 am IST  Tamil Nadu / investigation / Tiruchi "
    },
    {
      "title": "Seven arrested for watchman’s murder",
      "content": "Seen persons including a youth who is appearing for the ongoing Plus Two exams have been taken into custody in connection with the murder of a watchman here on Friday. Police picked up S. Kiran Kumar (26) of Thiruvottriyur, Chennai, who upon interrogation revealed his participation in the attempted burglary of a jewellery shop at Kasukadai Street here early on Thursday in which a watchman Govindaraj (60) was killed. Interrogation revealed that his accomplices were staying with Ramesh and Mohan on the Nanjikkottai Road. A police team rounded up K. Syed (26) of Seppanavari, Thanjavur, Karthi (22), Mohan (35), Ramesh (26) of Thanjavur, another Ramesh (31) of Chennai, and Kutty alias Mohan (27) who were allegedly involved in the crime. Sources said that Govindaraj of Umayal Arkadu village was employed as a night watchman three months ago by a group of jewellers in the Kasukadai Street. In the early hours of Thursday, the culprits tried to break open the shutters of a jewellery shop when Govindaraj tried to prevent them. The assailants attacked him on the head and he dropped dead and the culprits dumped his body in a storm-water drain and carried on with their work on opening the shutters of a shop. Just then a police patrol team arrived on the spot. The gang fled but sustained pursuit by the alert police led to the arrest of Kiran Kumar and then the whole gang. Incidentally, Karthi was appearing for the Plus Two exams as a private candidate. Having appeared in three papers, Karthi got enmeshed in the crime and has been caught. Further investigations were under way.  Published - March 19, 2016 12:00 am IST"
    },
    {
      "title": "Two sentenced to life imprisonment for murder in Tiruppur",
      "content": " The Principal District and Sessions Court, Tiruppur, on Monday sentenced two persons to undergo life imprisonment for murder. District Public Prosecutor S. Kanagasabapathy said that on September 9, 2018, Kumaresan (50), a native of Thanjavur district, who was a truck driver, was found dead near Palangarai adjacent to the National Highways.  During investigation, the Avinashi police found that Kumaresan was in need of help because of a repair in his truck. He sought the help of Shankar (22), Deenadayalan (22), and a juvenile who came on two two-wheelers. Instead of helping, they kidnapped Kumaresan to Palangarai bypass and assaulted him for money. They attacked him with iron rods and he succumbed to the injuries. The accused took away cash and a mobile phone from him. The police arrested and remanded them. After the trial, on Monday, judge Swarnam J. Natarajan sentenced two of them to life imprisonment. The judge also imposed a fine of ₹4,000 on them. The trial for the juvenile was yet to begin, Mr. Kanagasabapathy added.  Published - October 31, 2022 07:52 pm IST"
    },
    {
      "title": "Ramalingam murder case: 11 in NIA custody",
      "content": "The National Investigation Agency (NIA), probing the murder of Pattali Makkal Katchi functionary Ramalingam of Tirubuvanam near Kumbakonam in Thanjavur district in February, has taken into custody the 11 accused arrested in connection with the killing.  The NIA filed a petition in a Special Court at Poonamalee in Chennai on Monday seeking custody of the accused. Police sources said the court allowed the NIA custody of the accused till June 3. The accused were brought to Thanjavur amid heavy police escort on Monday night.  The 11 accused include Mohamed Riaz, Mohamed Hassan Kuthoos, Mohamed Farooq, Mohamed Rizwan, Mohamed Taufiq, Mohamed Ibrahim, Tauhid Basha and Nizam Ali. The case was initially investigated by Thiruvidaimarudur police.  As part of its investigation, NIA split into teams and conducted simultaneous searches at the offices of the Popular Front of India in Tiruchi, Thanjavur and Karaikal and seized hard discs, memory cards, CDs and DVDs, besides mobile phones, early this month.   Published - May 28, 2019 10:12 pm IST  Tiruchi "
    },
    {
      "title": "Auditor murdered",
      "content": "Maheswaran (45), an auditor of Karanthattankudi here, was reportedly hacked to death by a group of persons on Tuesday. According to police, the deceased auditor was in his farmhouse when a group of people attacked him during night at his house. When his neighbours rushed in sensing commotion, they found him lying dead in a pool of blood. The gang had escaped by then.  Subsequently, the Thanjavur Town West police removed the body to the Thanjavur Medical College hospital for postmortem and are on the lookout for the culprits. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Published - May 11, 2022 05:18 pm IST"
    },
    {
      "title": "Teenager murdered, property stolen",
      "content": "A 17-year-old boy was murdered in his house at Melacauvery in Kumbakonam in Thanjavur district on Thursday with the killers taking away valuables. The grave offence took place when the victim S. Abdul Hameed was alone in his house situated at Jamia Nagar. The boy was studying Plus One in a private matriculation higher secondary school at Kumbakonam. Police sources said the culprits entered the house through the backdoor and gagged the boy. They slashed the teenager’s neck apparently with a sharp weapon causing deep cuts and took away valuables. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The boy’s father was working abroad and sister Noor Parveen had left for Tirunageswaram when the killers struck. Police sources said the murder was committed when the boy was alone in the house. The crime came to light when the victim’s sister returned home only to find the backdoor open and the boy murdered. On information, police personnel inspected the crime scene and conducted inquiries. Deputy Inspector-General of Police (Thanjavur Range) Senthil Kumar and Superintendent of Police N.M. Mylvahanan inspected the spot. The sources said the exact quantity of property reportedly taken away by the killers was ascertained. Fingerprint experts inspected the spot where a detective dog was brought to the spot to track the route taken by the killers. Special police teams had been constituted to apprehend the killers. The Swamimalai police are investigating.  Published - March 11, 2016 12:00 am IST"
    },
    {
      "title": "Accused in intercaste couple murder case arrested",
      "content": "The Cholapuram police arrested Sakthivel of Thulukkaveli and Ranjith of Devanancheri in connection with the murder of the inter-caste married couple Saranya and Mohan at Thulukkaveli on Monday. According to police, the accused, Sakthivel, brother of the slain nurse, Saranya, and her relative, Ranjith, were produced before the Magistrate, N.Sivapalani, District Munsif-cum-Judicial Magistrate, Thiruvidaimaruthur, on Monday and remanded in judicial custody till June 28. Meanwhile, members of various political parties and organisations staged a demonstration in front of the Government District Headquarters Hospital at Kumbakonam, where the postmortem of the bodies of the victims was done, demanding enactment of a law to prevent caste-inspired killings. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Communist Party of India (Marxist) district secretary, Chinnaiapandiyan, State president, Untouchability Eradication Front, Chellakannu, Viduthalai Chiruthaigal Katchi Zonal Secretary, Vivekanandan and Congress Party district president, Loganathan, accompanied by their respective party cadres participated in the demonstration. Terming the act of murdering people in the name of caste as an inhumane act, the demonstrators demanded solatium for Mohan’s family.  Published - June 14, 2022 06:58 pm IST"
    },
    {
      "title": "Strong railway, strong India. But do we care?",
      "content": "In the early hours of November 23 in 1956, a train accident at Ariyalur, a town not very far from Thanjavur, killed 142 people and injured 110. Lal Bahadur Shastri, Railway Minister at the time, took moral responsibility for the mishap and resigned. Jawaharlal Nehru, the Prime Minister, forwarded his resignation to the President. Sixty years later, on November 20 last year, a train accident near Kanpur killed nearly 150 people. And within 60 days, last Saturday, at least 40 passengers died when a train derailed in Andhra Pradesh. No one resigned, no heads rolled. Instead, fingers were pointed at Pakistan’s ISI and Maoists.  The truth is 60 years is long enough for those in power to grow a thick skin — and also for people to become insensitive to such tragedies. I mean, how does it matter to us if 100 or 150 die in a train accident somewhere in Kanpur or Odisha or wherever, as long as we were not travelling in the ill-fated train? Today, what matters to us is who said what — and not who did what.  Our world turns upside down if a has-been BJP leader called Vinay Katiyar says that his party boasts of prettier women than Priyanka Gandhi. We feel betrayed if Aamir Khan says that his wife thinks India has become unsafe for them to live. We find it funny when Rahul Gandhi announces at a public meeting that he, unlike Narendra Modi, wears a torn kurta. I can think of countless evenings when utterances by public and even not-so-public figures have made national headlines and sparked raging debates on social media. Almost no one spared a thought for the 150 lives lost near Kanpur. The news was forgotten the day after. How did the accident happen? How could such accidents be prevented? Most importantly: what exactly is the Government doing to ensure safety of rail passengers? Questions like these — which matter because they concern human lives, including ours — are rarely asked. Since we don’t ask, we don’t get the answers and life goes on — until another few dozen lives are lost. But CNN, in a detailed report, raised these questions after last Saturday’s accident in Andhra Pradesh. From the report, I got to know things that I should have known but didn’t: that India’s rail network runs 12,000 trains a day; that all the tracks, if joined into one single track, could circle the globe over one-and-a-half times; that 23 million passengers take the train daily, the equivalent of Australia’s population. It quoted former Railway Minister Dinesh Trivedi as saying that the Indian railway system needed a generation change. It quoted a White Paper in which current Railway Minister Suresh Prabhu wrote that Indian Railways had suffered from considerable under-investment during the last few years. The railway is one of the oldest and finest institutions of modern India: the 12,000 trains not only run, but run mostly on time, connecting the remotest corners of the country. Then why “considerable under-investment”? The apathy is evident from the fact that Indian Railways does not even have a brand ambassador, at a time when it has become fashionable for even Government departments to have a celebrity highlighting their work. All those whose hearts beat for the soldiers on the border should ask themselves: how do the soldiers get there in the first place? No, soldiers don’t fly Air India or Indigo: they take the train. Strong railway, strong India. Let’s see what the 2017 Budget has in store for it.   Published - January 27, 2017 03:41 pm IST  The Hindu MetroPlus / Writer's Block / society / people / railway "
    },
    {
      "title": "Former Minister S.N.M. Ubayadullah passes away",
      "content": " Former Minister and a senior leader of Dravida Munnetra Kazhagam S.N.M. Ubayadullah, 83, passed away in Thanjavur on February 19.  A four-time legislator, he won the Thanjavur Assembly constituency as DMK candidate in 1989, 1996, 2001, and 2006 elections. He also served as Minister for Commercial Taxes between 2006 and 2011 in the government led by former Chief Minister M. Karunanidhi. He was also the Thanjavur urban town secretary of the party from 1987 to 2014 and continued as the president of the DMK traders wing.  \"முன்னாள் அமைச்சர் திரு. எஸ்.என்.எம். உபயதுல்லா அவர்கள் மறைவுற்றார் என்ற செய்தி கேட்டு மிகவும் வருத்தமுற்றேன்.திரு. உபயதுல்லா அவர்களை இழந்து தவிக்கும் குடும்பத்தினர், உறவினர்களுக்கு எனது ஆழ்ந்த இரங்கல்\" என மாண்புமிகு முதலமைச்சர் @mkstalin அவர்கள் தெரிவித்துள்ளார். pic.twitter.com/fLPb6iXnxh On February 19, when he was getting ready to attend a family function, he fainted and was rushed to a private hospital in Thanjavur, where he passed away.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Condoling his death, Chief Minister M.K. Stalin, in a tweet, recalled Ubayadullah’s contribution to the growth of the party and his association with the senior leaders from the combined Thanjavur district.  Recently, the government had conferred Perarignar Anna Award for 2022 to Ubayadullah for his contributions to the Tamil language, literature, and social development.  Published - February 19, 2023 02:48 pm IST  death / Tamil Nadu "
    },
    {
      "title": "Aminjikarai minor girl death: CPI(M) demands judicial inquiry",
      "content": "Members of Communist Party of India (Marxist) (CPI(M)) on Tuesday staged a demonstration near the Aminjikarai police station in Chennai demanding a judicial probe into the murder of a 16-year-old girl from Thanjavur who was employed as a domestic help by a businessman’s family at a house in Aminjikarai.  G. Selva, Chennai Central District secretary, CPI(M), questioned why the School Education Department had not tracked the girl when she dropped out of school. He alleged that the number of minors from rural areas of Tamil Nadu and other States employed as bonded labourers in Chennai had increased over the past few years, and the State government had no record of it. “Though six persons had been arrested by the police in this case, we are not thoroughly satisfied with the investigation process. We want a judicial inquiry into the matter,” Mr. Selva said. He urged the State government to disburse compensation to the family members of the victim.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Published - November 06, 2024 12:48 am IST"
    },
    {
      "title": "Auditor murdered",
      "content": "Maheswaran (45), an auditor of Karanthattankudi here, was reportedly hacked to death by a group of persons on Tuesday. According to police, the deceased auditor was in his farmhouse when a group of people attacked him during night at his house. When his neighbours rushed in sensing commotion, they found him lying dead in a pool of blood. The gang had escaped by then.  Subsequently, the Thanjavur Town West police removed the body to the Thanjavur Medical College hospital for postmortem and are on the lookout for the culprits. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Published - May 11, 2022 05:18 pm IST"
    },
    {
      "title": "The day of reckoning",
      "content": " After a legal battle for more than a decade, it will be judgment day on Wednesday in the July 2004 Kumbakonam school fire that killed 94 students. The prolonged wait of the parents of the victims for justice is expected to end when the verdict is delivered by the Thanjavur District and Sessions Court.  The fire that broke out on July 16, 2004 in the noon meal centre of Sri Krishna Middle School ran to the first floor with a thatched roof where 200 students were housed. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Sri Krishna Aided Private School, Saraswathi Nursery and Primary School and the Sri Krishna Girls High School functioned in the same building. The incident shook the conscience of the State and raised serious questions about safety in schools. In the past 10 years, the case moved from one court to another. It was committed to the Thanjavur District and Sessions Court by the Kumbakonam Judicial Magistrate court where the final report was filed in June 2005. Subsequently, the case was transferred to the Fast Track Court at Thanjavur, and from there to the Essential Commodities Court. As there was no progress, it was re-transferred to the District and Sessions Court in 2009 when the government appointed a special public prosecutor. It gather pace after charges were framed against all 21 accused on September 10, 2012, with the trial starting a fortnight later. The witnesses were examined on a day-to-day basis. The prosecution submitted documents and statements of witnesses running to thousands of pages. Prabhakaran, headmaster of the Sri Krishna Girls High School, turned approver and was the first prosecution witness to be examined.  Among the accused include the school correspondent, ‘Pulavar’ Palanisamy; his wife Saraswathi; adopted daughter Santhalakshmi; the then Municipal Commissioner, Sathyamurthy; the then Town Planning Officer, K. Murugan; three school teachers; and a of Education Department officials.  The State government withdrew the case against C. Palanisamy, the then Chief Educational Officer, Thanjavur; S. Paramasivam, the then Kumbakonam Tahsildar; and A. Kannan, the then Director of Elementary Education. After lengthy arguments and examination of 230 prosecution witnesses, including the parents, and the students who survived the fire, the verdict is now eagerly awaited by all.  Published - July 30, 2014 09:51 am IST"
    },
    {
      "title": "Inter-caste couple murdered near Kumbakonam",
      "content": "An inter-caste couple, who had married five days ago in Chennai against the wishes of their families, was murdered by the woman’s brother and relative at Thulukkaveli, Cholapuram, near Kumbakonam, on Monday. According to police, the victims, Mohan, 31, hailing from Ponnur in Tiruvannamalai district, and Saranya, 22, of Thulukkaveli, a nursing graduate, had fallen in love while working at a private hospital in Chennai. While Mohan belonged to the Most Backward Community, Saranya belonged to the Scheduled Caste. Saranya’s family had refused to get her married to Mohan and insisted on finding a groom from their own community. Ignoring the opposition, the couple married in Chennai last week. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The police said upon learning of the wedding, Saranya’s brother, Sakthivel, 31, had pretended to reconcile with the couple and invited them to his house. The unsuspecting couple arrived at Thulukkaveli on Monday, and when they were about to enter the house, Sakthivel and one of his relatives, Ranjith of Devanancheri, allegedly attacked them with weapons, killing the couple on the spot. On being alerted by the locals, the Cholapuram police arrived at the spot and sent the bodies to the Government District Headquarters Hospital, Kumbakonam for a post-mortem. The police have registered a case and are on the lookout for Sakthivel and Ranjith.  Published - June 13, 2022 09:13 pm IST"
    },
    {
      "title": "Armed gang murders DMK man",
      "content": "Thanga. Manoharan (58), a DMK cadre, was hacked to death by an armed gang at Pattukottai on Sunday when he was riding a motorcycle. Police said the gang that was reportedly hiding nearby intercepted him at A.V. Kulam area and attacked him with deadly weapons. His face was completely smashed in the brutal attack. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Manoharan, who was the party’s town in-charge, was initially rushed to Pattukottai Government Hospital. He was declared brought dead when he was shifted to a private hospital in Thanjavur. The Pattukottai police are investigating.  Published - July 04, 2016 12:00 am IST"
    },
    {
      "title": "Policeman killed in scuffle; guard held",
      "content": "A Sub-Inspector of Police Panneerselvam was killed on the spot and five others were injured when a security guard at an Automated Teller Machine (ATM) of State Bank of India at Papanasam town near here opened fire from his rifle on Tuesday. The injured persons, Rajarajeswaran, Srinivasan, Somnath, Bharathidasan and Swaminathan, were admitted to a private hospital at Thanjavur. According to A. Amalraj, Deputy Inspector General of Police, Thanjavur range (in-charge), a scuffle took place between S. Rajendran of Mannargudi, the security guard, and some people who had come to take money from the ATM even as money was being loaded into the machine. The security guard suddenly opened fire and injured Bharathidasan who had come to the ATM to draw money. On seeing this, two other persons, Srinivasan and Swaminathan, came to the rescue of Bharathidasan and were shot at. Later, Rajendran opened fire at random injuring Somnath and Rajarajeswaran. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. A police team, led by Suresh, Inspector of police, Papanasam, and Pannerselvam, Sub-Inspector, rushed to the ATM. Rajendran, who had taken shelter inside the ATM, was overpowered by the policemen. Even as he was being taken to the police station, a group of angry people tried to attack the security guard, who attempted to snatch his rifle from Mr. Panneerselvam. In the ensuing struggle, Rajendran is said to have pulled the trigger. A bullet hit Pannerselvam in his chest and he died on the spot. Rajendran was whisked away to an undisclosed destination by the police. Karan Singha, Inspector General of police, Central Zone, Mr. Amalraj, A. K. Senthilvelan, Superintendent of Police, rushed to the spot. The body of Panneerselvam was brought to Thanjavur Medical College hospital for post-mortem. S. S. Palani Manickam, Union Minister of State for Finance, M.S. Shanmugham, Collector, paid their homage to the deceased. Tension prevailed in Papanasam following the incident and traders downed shutters. People gathered in large numbers before the police station, demanding that the security guard be handed over to them.  Published - May 11, 2010 07:46 pm IST  murder / Tiruchi "
    },
    {
      "title": "‘Differently abled yet to get monthly assistance’",
      "content": "The monthly assistance of ₹2,000 for differently abled persons in Tamil Nadu is yet to get credited to their respective bank accounts. According to the RTI Activists’ Team – Thanjavur District, the beneficiaries of the monthly assistance scheme implemented by the Department for the Welfare of Persons with Disabilities were yet to receive the monthly assistance of ₹2,000 from the month of July 2022. When this issue was brought to the notice of the district-level officials the latter expressed their inability by pointing out that they were yet to receive the official communication from the State Secretariate in this regard. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The association wrote a letter to Chief Minister M. K. Stalin, Chief Secretary V. Irai Anbu and the officials of the concerned department explaining the difficulties faced by the beneficiaries. Subsequently, a few days back senior officials from the Secretariat called up the association and informed them that the issue was being sorted out and the backlog amount would be credited along with the monthly assistance amount for this month in the bank accounts of the eligible beneficiaries soon, sources said.  Published - May 11, 2023 05:17 pm IST"
    },
    {
      "title": "Merchant murdered at Kumbakonam",
      "content": "THANJAVUR Ramanathan (63), an oil merchant in Kumbakonam, was reportedly killed by a gang at his house in Melacauvery area on Sunday night. According to police, the victim and his wife, Vijaya, were alone at the time when the gang gained entry into the house at around 8 p.m. on Sunday under the pretext of presenting a wedding invitation to him. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Once inside, the gang assaulted Ramanathan in front of his wife asking him to part with the cash and jewellery available in the house. When he refused, the gang threatened that his wife would be murdered if he fails to concede to their demand.  Ramanathan handed over cash and jewellery available in the house. But, before leaving the house, the gang killed him using lethal weapons, police said. The Kumbakonam east police have registered a case and are on the lookout of the gang, police said. Meanwhile, on Monday a section of traders in Kumbakonam downed their shutters demanding protection for traders and the arrest of the culprits.  Published - March 16, 2020 05:45 pm IST"
    },
    {
      "title": "Man held for murder in Coimbatore",
      "content": "The Ukkadam police have arrested a Thanjavur native on charges of murdering a man from Salem. The police said that Janarthanan (35), who had been doing odd jobs, was arrested for murdering S. Ranjan alias Kulanthaivel (43) of Nagiyampatti in Salem district. The police said the accused and the deceased had been sleeping in bus stands and on the platforms of shops in the city. The duo had a brawl on the night of August 4 at Ukkadam during which Janarthanan beat Ranjan with a PVC pipe repeatedly. An autorickshaw driver saw the assault and informed the Ukkadam police. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The police apprehended Janarthanan and shifted Ranjan to the Coimbatore Medical College Hospital. Ranjan died without responding to treatment on Sunday evening. “Janarthanan had been arrested for the assault and other offences. With the injured person died, we altered the case to a case of murder and recorded his arrest for the offence,” said a police officer. The accused was in judicial remand in Coimbatore Central Prison.  Published - August 15, 2022 07:11 pm IST  crime / Coimbatore / murder "
    },
    {
      "title": "Seven held in advocate murder case",
      "content": "The police have arrested seven persons, including two brothers, in connection with the murder of an advocate near Tiruvidaimarudur in Thanjavur district. Raja, of Melamaruthuvakudi and an advocate practising in the Madras High Court, was hacked to death by a gang at Sannapuram railway level crossing on April 3. Two others who travelled with Raja were also attacked. The Tiruvidaimarudur police registered a case and were investigating the killing of Raja, whose brother Stalin is the PMK State vice-president. Three special teams were formed to nab the culprits. The police teams picked up N. Gopi (24) of Keezha Thoondil Vinayakanpettai, J. Ramarajan of Udayaloor, A. Babu (27), A. Ramasamy (26) and A. Kumarasamy (29) of Thirumangalakudi, C. Moovendran (26) of Narasinganpettai and M. Prakash (28) of Tiruvidaimarudur. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. They were produced before the Judicial Magistrate, Kumbakonam, who remanded them in custody.  Published - April 08, 2015 12:00 am IST"
    },
    {
      "title": "History-sheeter killed in police encounter in Pudukottai district",
      "content": " A “history-sheeter”, Duraisamy alias ‘MGR Nagar’ Durai was allegedly killed in a police encounter at Vamban near Pudukottai on Thursday. The police said that, acting on an information that Durai was hiding in a eucalyptus grove with weapons, a team led by an Inspector rushed to apprehend him.  However, Durai allegedly attacked the police personnel, injuring a sub-inspector (SI). This necessitated the Inspector to open two rounds of fire in self defence. The SI sustained an injury on his right hand.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Durai was rushed to the Pudukottai Government Medical College Hospital, where he was declared brought dead. The SI was admitted to the Government Hospital in Alangudi.  Police sources said that Durai, a resident of MGR Nagar in Tiruchi City, had several murder and other criminal cases booked against him in different police stations in Tiruchi, Pudukottai, Thanjavur, Coimbatore, Theni and Madurai districts.  In one such grave case, reported in Pudukottai in December 2022 wherein a history-sheeter was killed by an armed gang after he appeared before a court, Durai was the prime accused.  He was under police surveillance and had associates in different districts, the police said. The Deputy Inspector General of Police, Tiruchi Range, M. Manohar; and Superintendent of Police, Pudukottai, Vandita Pandey; inspected the spot where the encounter happened, and conducted an inquiry.  Published - July 11, 2024 11:33 pm IST"
    },
    {
      "title": "Three, including 13-year-old girl killed, five injured after car turns turtle near Cuddalore",
      "content": "Three persons, including a 13-year-old girl, were killed and five others sustained injuries when a car they were travelling in, turned turtle near a petrol bunk near Ramanatham in Cuddalore district on Friday (May 10, 2024) night. Police identified the deceased as Nandana, 13 and Ammu, 30, both residents of Vallam village in Thanjavur and Praveen Kumar, 38, driver of the Innova car, hailing from Puducherry.  The accident occurred when the vehicle was proceeding from Tiruchi to Puducherry. The driver lost control of the vehicle and it went off the road and fell into a ditch. While Ammu and Nandana died on the spot, the driver died at the local government hospital, police said. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. All the five injured persons have been admitted to the Government General Hospital om Perambalur. The condition of a girl child is stated to be serious, police said. The Ramanatham Police have registered a case and investigation is on to ascertain the cause of accident.  Published - May 11, 2024 12:55 pm IST  Tamil Nadu / Puducherry / police / road accident "
    },
    {
      "title": "History-sheeter murdered by gang",
      "content": "A history-sheeter, S Muthukumar, 32, from Thidir Nagar in Ariyamangalam was murdered on Tuesday by a six-member gang opposite SIT College on Tiruchi-Thanjavur National Highway.  While Muthukumar was the son of Sekar, another history sheeter, his wife Kayalvizhi was a two-time councillor of Tiruchi Corporation. The murder is suspected to be a sequel to a long running violent feud between the families of Sekar and his brother Periyasamy. Both were murdered by rival groups. Several cases, including murder, was pending against Muthukumar and he was out on bail. On Tuesday, six persons who came on three motorbikes intercepted Muthukumar near Ariyamangam and attacked him with sharp weapons. He died on the spot.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Ariyamangalam police have filed a case and the accused is yet to be arrested. EOM/   Published - April 30, 2024 10:30 pm IST"
    },
    {
      "title": "Gender resource centres opened in three taluks of  Thanjavur district",
      "content": "Three gender resource centres, Vanavil Maiyams, have been established in Thiruvidaimarudhur, Thiruvonam, and Ammapettai takuks in Thanjavur district.  The centre will be a dedicated body for representing, advocating, and addressing issues relating to women, including domestic violence, and cases of women and child abuse, at the taluk level, Collector B. Priyanka Pankajam has said.  The centres will function at the taluk service centres at Thiruvidaimarudhur, Kavalipatti (in Thiruvonam taluk), and Ammapettai. Affected women and girl children can contact the centre managers to get support, she said.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The centre can be reached by dialling 9965855254 (Thiruvidaimarudhur); 6369849825 (Thiruvonam), and Ammapettai (8754990178), she said.   Published - September 06, 2024 07:26 pm IST  Tiruchi / social problems "
    },
    {
      "title": "Armed gang beheads murder case accused near Pattukottai",
      "content": "An armed gang on Wednesday beheaded a murder case accused and threw the severed head on the roadside near Pattukottai in Thanjavur district.  The victim, M. Prakash, 23, alias Prakash Kumar of M.N. Thottam in Pattukottai, was named as accused no. 5 in the murder of a history-sheeted rowdy, Thamba Karthi alias R. Karthi (24), at Nariyampalayam on August 13. Prakash and six others, arrested in connection with the murder, were out on conditional bail.  On Wednesday morning, police sources said, all seven accused were returning in a mini four-wheeler after signing at the Pattukottai police station, when a gang of around eight to 10 persons followed them on two-wheelers. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The gang members tried to intercept the four-wheeler, which, however, sped away.  But they continued their pursuit and lobbed country bombs at the vehicle and one of them exploded. Barring Prakash, the rest managed to escape at Aladikumulai Bypass Road.  The armed gang members caught hold of Prakash and beheaded him, the police said. They carried the severed head along with them for some distance, dumped it on the roadside and fled from the spot. The brutal murder was in retalitation to the killing of Thamba Karthi, the sources said.  Police suspect the hand of Mannaru alias Arunchandar, a relative of Thambi Karthi, and his associates in the murder. Pattukottai police has registered a case.   Published - October 25, 2018 08:26 am IST"
    },
    {
      "title": "Two sentenced to life imprisonment for murdering engineering college student in 2019",
      "content": "The Additional District Court (Fast Track Court), Kumbakonam, convicted and sentenced two persons to life imprisonment for murdering an engineering college student in 2019.  According to the prosecution, Ijaz Ahamed and Jalaludheen of Thirubhuvanam, had murdered Munthazeer of Avaniyapuram near Kumbakonam in January 2019 and were arrested by the Thiruvidaimaruthur police. The accused allegedly kidnapped the deceased and demanded ransom from Munthazeer’s family over phone on the night of January 4, 2019.  Munthazeer was found dead with a deep cut on his throat on the banks of Veeracholan River at Thirubhuvanam on January 5, 2019.  The Additional District Judge, J. Radhika, who heard the case, sentenced the two accused to life imprisonment. Another accused in the case, a juvenile, is facing trial at the court dealing with the cases pertaining to juveniles at Thanjavur, sources said.   Published - March 21, 2024 08:36 pm IST  Tiruchi / murder "
    },
    {
      "title": "Five sentenced to life imprisonment",
      "content": "The Additional District Court (Fast Track Court), Kumbakonam, has awarded life sentences for five persons found guilty of murdering a person who had reportedly helped a couple to get married overlooking the opposition to their marriage in 2017. According to police, Pavunraj of Ambedkar Nagar, Sakkottai near Kumbakonam in Nachiyarkovil Police Station limits lodged a complaint in January 2017 stating that his son, Sundarapandi helped a couple in the same area to tie the nuptial knot overlooking the opposition for their marriage.  Enraged by this, the woman’s father, Anbazhagan and his sons, Anbunidhi, Arivunidhi, Arulnidhi and Azhagunithi, picked up a quarrel with Pavunraj and Sundarapandi on January 12, 2017, and attacked them with lethal weapons resulting in the death of Soundarapandi. Subsequently, a case under Sections 147, 148, 342, 294(b), 323 and 302 of the IPC, was booked and Anbazhagan and his sons were arrested by the Nachiyarkovil Police. The charge sheet in this case was filed in March 2017 and after hearing the arguments, the Additional District Judge, J.Radhika, Additional District Court (FTC), Kumbakonam, awarded life sentences for all the five arrested persons on Monday.  Published - July 17, 2023 08:01 pm IST"
    },
    {
      "title": "PMK functionary Ramalingam murder case: NIA raids premises of Muslim outfits in Tamil Nadu",
      "content": " Officers of the National Investigation Agency (NIA) on Thursday conducted simultaneous searches at the Popular Front of India (PFI) district unit offices at Thanjavur, Tiruchi, and Karaikal on Thursday, in connection with the murder of PMK functionary V. Ramalingam in Thanjavur in February.   Split into teams, the NIA officials carried out the operation armed with search warrants and with protection provided by the local police. Sources said the NIA conducted a search at the house of a person by name Mohamed Hasan Quthoos at Karaikal and seized a hard disk, laptop and books besides some unaccounted money. Quthoos it is alleged, was involved in the murder of Ramalingam.   This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  V. Ramalingam  Thereafter, a search was conducted at the PFI district unit office at Karaikal town. This concluded in the afternoon. NIA teams carried out similar searches at the PFI office at Thanjavur town for about 45 minutes. In Tiruchi city, another NIA team searched the premises of the PFI situated at Palakkarai. Although the NIA team had landed at the spot at around 8 a.m., the PFI office was closed and opened thereafter by its office bearers. Armed protection was given by the City Police team to enable the NIA officers carry out their operation. The NIA team conducted enquiries with an office bearer of the PFI as part of the operation which lasted over six hours. Ramalingam, 45, was murdered by a gang on the night of February 5 at Thirubhuvanam. Thiruvidaimaruthur police, who registered a case, arrested 10 persons in connection with the incident and seized a car allegedly used by the assailants. The PMK functionary was intercepted by a car-borne gang on Muslim Street at Thirubhuvanam around midnight and was attacked with lethal weapons resulting in deep cut injuries. Subsequently, he was rushed to the Government District Headquarters Hospital, Kumbakonam, from where he was referred to the Government Medical College Hospital, Thanjavur. He was declared dead on arrival at the GMCH.  Published - May 02, 2019 06:09 pm IST  murder / investigation "
    },
    {
      "title": "Gangster &lsquo;Kurangu&rsquo; Senthil killed in an encounter near Tiruchi",
      "content": "A notorious gangster R. Senthil alias ‘Kurangu’ Senthil (27) was killed in an encounter with the police near Tiruverambur in the city’s outskirts in the early hours on Friday. A close associate of gangster ‘Manalmedu’ Shanker who was killed in an encounter in Pudukottai district a couple of years ago, Senthil was allegedly involved in murder, attempt to murder and robbery cases registered against him in various places in the State. A B.E. drop out, Senthil was one of the accused in the murder of DMK’s Tiruvarur district secretary Poondi Kalaiselvan at Koradachery in 2007. This is the fifth encounter death in the Central Zone in the last three years. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Senthil, who had been absconding for more than a year, and one ‘Kora’ Natarajan had planned to eliminate the present DMK district secretary of Tiruvarur Poondi Kalaivanan, the brother of Kalaiselvan, and Ammapettai union DMK secretary Thiaga Suresh, the Inspector General of Police, Enforcement and IG (in-charge) of Central Zone J.K. Tripathy told the media here on Friday. The Thanjavur police received inputs about the plan to eliminate Kalaivanan and Thiaga Suresh, an accused involved in a double murder case registered in Nachiarkoil police station in Thanjavur district in 2008, upon interrogating one Viji alias Swaminathan in connection with a case on October 1, he said. Based on the information, the Inspector of Ammapettai police station S. Karthikeyan and Head Constable Sridharan went in search of Senthil and ‘Kora’ Natarajan. The police personnel on spotting Senthil riding a motorcycle near Tiruverambur bridge in the early hours tried to intercept him. The IG said Senthil took the Vengur road with the police personnel chasing the former in a jeep and finally intercepted him. Senthil lobbed a country bomb at the police party as they tried to nab him. The country pistol and two cartridges fell from his possession as Senthil lobbed another country bomb at the police personnel, he said. Subsequently, Senthil attacked Inspector Karthikeyan on his left shoulder with an aruval when the latter tried to apprehend him. He also tried to attack the Head Constable when the Inspector, after sounding a warning, opened two rounds of fire from his service pistol in self defence at Senthil who fell down. The Inspector and the Constable took Senthil to the Annal Gandhi Memorial Government Hospital in the city where he succumbed, the IG said. The Tiruverambur police has registered a case under Explosives Act on a complaint from Inspector Karthikeyan.  Published - October 02, 2009 02:18 pm IST  murder / gangs & organised crime / death "
    },
    {
      "title": "Six held for DMK member’s murder",
      "content": "The police have arrested six persons, including the Ammapet Town Panchayat vice-chairman, in connection with the murder of a DMK local leader ostensibly over commercial and political motives. The former DMK unit secretary Manikandan (45) of Ezhuthupattarai Street, Ammapet, near here was done to death by a gang on Thursday night and the body was dumped by the roadside near Koilvenni. Ammapet police, who recovered the body, invested the case and came to the conclusion about the involvement of Ammapet Town Panchayat vice-chairman Thyaga Ramesh (48), with who Manikandan had political and commercial clash of interests. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Investigation revealed the involvement of Ramesh's friends in the murder  Published - May 10, 2015 12:00 am IST"
    },
    {
      "title": "Four arrested for murder near Coimbatore",
      "content": " The Kovilpalayam police have arrested four persons in connection with the murder of a 42-year-old man at Kalapatti on Thursday night. P. Marimuthu (57) of Kurumbapalayam, L. Maldurai (47), and S. Santhosh Kumar (24) of Kalapatti, and G. Rajkumar (21) of Thanjavur were arrested for murdering D. Vadivel (42) of Madampatti. According to the police, Vadivel, a sculptor by occupation, was found dead behind a restaurant at Kalapatti on Friday morning. After being alerted by the public, Kalapatti village administrative officer Kumarasamy visited the spot and lodged a complaint with the Kovilpalayam police. The police shifted the body to the Coimbatore Medical College Hospital for post-mortem and a case was registered for suspicious death. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. During investigation, the police found out that Marimuthu and Rajkumar, both employees of the restaurant, consumed alcohol with Maldurai and Santhosh Kumar in a shady corner behind the restaurant on Thursday night. As Vadivel came to the spot, the four men questioned him for coming to the backside of the restaurant. The men, under the influence of alcohol, had a fight with Vadivel and he was beaten to death. The police arrested the four persons on Saturday and they were remanded in judicial custody. House maid accused of stealing jewellery, cash The Ramanathapuram police are on the lookout for a housemaid, who is accused of having stolen jewellery, cash and watches, totally worth ₹11 lakh, from a house. The police said that the alleged theft happened at the house of Sridevi Aravindhan at Krishnasamy Nagar on post office road, near Ramanathapuram. The woman had complained that jewellery, four expensive watches, and ₹2 lakh went missing between May 17 and 20. The police were on the lookout for housemaid Tamilselvi (45).  Published - May 28, 2023 07:07 pm IST  Coimbatore / crime / police "
    },
    {
      "title": "Four arrested in watchman murder case",
      "content": "THANJAVUR Four persons have been arrested in connection with the murder of the watchman at a company in Ammapettai Police Station limit last week. Jayabal (74) of Thanjavur was a night-watchman at a plastic goods manufacturing unit on the outskirts of Thanjavur was found dead in the vicinity of the company in the morning hours on July 19. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Special police teams were formed to trace the culprits as the victim’s head was found smashed with a stone. Subsequently, the special team members with the help of video footage of the closed-circuit television network cameras installed at the company and surrounding areas traced the murderers – Senthilkumar of Valamarkottai, Kumar of Vandikara Street, Vijayakumar of Narthankudikadu and Jagadeesan of Karaimeendarkottai – on Sunday. The accused confessed that they had committed the crime after the victim refused to allow them to consume alcohol near the company, police said.  Published - July 26, 2021 08:02 pm IST"
    },
    {
      "title": "Kuruvai cultivation picking up in Thanjavur",
      "content": "Kuruvai cultivation is picking up in Thanjavur district. With canal water reaching the upper reaches, farmers are involved in activities like raising nurseries, transplanting saplings and applying basal fertilisers. According to Balasubramanian, Joint Director of Agriculture, the plan is to raise kuruvai on 42,500 hectares in Thanjavur district this year. Of this, transplantation has been completed on 6,909 hectares. In this transplanted area, crop on 3177 hectares has been raised under System of Rice Intensification method. Crop on 3832 hectares has been transplanted under conventional method. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. With respect to nursery, seedlings have been raised on 124 hectares under SRI method. This can be used for transplanting them on 12,400 hectares. Under conventional method, seedlings have been raised on 913 hectares. This can be used for transplanting them on 9130 hectares. Seedlings raised on one hectare under SRI method can be used for transplanting them on hundred hectares while seedlings raised on one hectare under conventional method can be used for transplanting them on ten hectares, Mr. Balasubramaniam said. “We hope to cover the targeted area of 42,500 hectares in Thanjavur district this year,” he said. Meanwhile, Public Works Department is introducing turn system of water release into the Cauvery and the Vennar from June 30. From June 30 to July 6, the turn is for the Vennar and during this period, 7,500 cusecs will be released into the Vennar. The Cauvery will get only 1500 cusecs during this period. Turn for Cauvery starts on July 6 evening and for the next six days, the Cauvery will get 7,500 cusecs of water and the Vennar 1,500 cusecs. However, there is no turn for Grand Anicut canal and it will get 2,000 cusecs. Kollidam will get 1500 cusecs.  Published - June 29, 2011 12:55 am IST  Tamil Nadu "
    },
    {
      "title": "Monkeys trapped",
      "content": "Officials of the Forest Department have trapped 20 monkeys that were found roaming around in Thanjavur town. The move comes two days after Thanjavur West Police received a complaint that an infant was killed by the animals in West Rampart area.  Cages were placed at about half-a-dozen places along the moat in Thanjavur Corporation limits to capture the monkeys. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  A couple residing in the area had alleged that one of their eight-day-old twin daughters was killed after monkeys took the infant from their house and threw it in the moat. The trapped monkeys would be released in Pachamalai area in Tiruchi district, the Forest officials added.  Published - February 15, 2021 09:14 pm IST"
    },
    {
      "title": "Man arrested in woman murder case",
      "content": "Police here have arrested a 36-year-old person on charges of murdering a housewife near here. A. Vijaya Arockiadoss of New Fathima Nagar Fourth Street here was picked up for allegedly murdering Radhika (26), wife of a private firm employee Madhanagopal and who was residing nearby a couple of days ago. Radhika was found dead with stab wounds on her body while four sovereign gold jewellery in her person was found missing. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Thanjavur taluk police had formed a special team to track down the assailant. Meanwhile, police investigating the case came to know of a security camera at a nearby house and used that to identify a person donning a cap entering Radhika’s house. Based on the images obtained the police intensified their search and zeroed in on Vijaya Arockiadoss who escaped to Tirupur after the murder. A police team nabbed him there and brought him to Thanjavur.  Published - October 29, 2015 12:00 am IST"
    },
    {
      "title": "Thanjavur Corporation sets up monsoon control room",
      "content": "Thanjavur Corporation has set up a monsoon control room to receive calls for assistance from the public. Disclosing this to reporters here on Friday, Mayor S .Ramanathan has said that affected people could dial toll-free number 1800 425 1100 or call 75980 16621 or the landline number (04362) 231021 for assistance from the civic body.  Stating that the civic body machinery had been put on high alert, the Mayor said urban primary health centres had been kept ready to handle any exigency. Besides, 51 rescue and protection committees headed by the ward councillors of the respective wards had been formed. All the 850 staff of the Corporation would be available to attend to grievances/rescue calls received from rain-affected people.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Earthmovers and saw machines, 10 each, hade been kept ready to clear trees that may fall during heavy rain and five oil motors were in a ready state to be pressed into service in case of any inundation in the civic body.  In case inundation of low-lying areas, the affected residents would be shifted to rescue centres., he said  Published - November 11, 2022 08:05 pm IST"
    },
    {
      "title": "Large turnout at Thanjavur Big Temple for ‘gho puja’",
      "content": "Hundreds of families in and around Thanjavur celebrated “mattu pongal” by participating in the ‘gho puja’ (worship of bovine) at the Sri Brihadeeswarar temple (popularly known as Big Temple) here on Tuesday. Elaborate arrangements have been made by the Thanjavur Palace Devasthanam, which administers the temple affairs under the supervision of the Hindu Religious and Charitable Endowment Department, where the names of the family heads who had expressed their wish to perform ‘gho puja’ on the occasion of “Mattu pongal” at the temple. Around 108 bovines were brought to the temple for this purpose. Earlier, the gigantic granite bull idol at the temple was decorated with flowers, fruits and sweets after the completion of special ‘abhishekam’ (anointment). This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Meanwhile, foreign tourists took part in the “Mattu pongal” at Vengaroyankudikadu where the cattle were given a bath at the hamlet tank and brought to the village temple with the beating of traditional musical instruments.  At Tiruvarur, ‘gho puja’ was held at the Sai Baba temple, Vasan Nagar where the bovines were decorated with garlands, sandal paste and others. They were fed with ‘sweet pongal’, jaggery and bananas. Subsequently, they were taken around in a procession around the temple and brought back to the ‘gho shala’, sources said.   Published - January 16, 2024 08:37 pm IST  Tiruchi / Pongal "
    },
    {
      "title": "Medical shop owner murdered",
      "content": "A group of assailants on Friday hacked to death a medical shop owner belonging to Tiruvermbur. The assailants waylaid Thiyaga Panchabakesan (42) when he was returning to Tiruverumbur from Thirukattupalli in Thanjavur district after closing his medical shop on Friday night. They attacked his brother Kanagaraj, who came to his rescue. They then fled in a car, a source said. While Panchabakesan died on the spot, Kanagaraj has been admitted to a hospital at Thirukattupalli. The reason for the murder was not known.  Published - June 28, 2015 12:00 am IST"
    },
    {
      "title": "NIA nabs key suspect in Ramalingam murder",
      "content": " The National Investigation Agency (NIA) on Monday arrested Rahman Sadiq, 41, alleged key conspirator in the Ramalingam murder case, in Thanjavur. The suspect, later declared a proclaimed offender, was wanted in the sensational murder of the Pattali Makkal Katchi functionary on the night of February 5, 2019, in Thirubhuvanam in the district. According to the NIA, Ramalingam was opposing the “Dawah” work of the Popular Front of India in Thanjavur district of which Sadiq was the administrator. The case was initially registered by the Thiruvidaimaruthur police on charges that a conspiracy was hatched to murder Ramalingam since he resisted the “Dawah” work of PFI activists, who were converting Hindus to Islam. The killing was aimed at creating terror in the minds of a particular section of people and trigger enmity between different communities, the agency contended.  After conspiring to eliminate Ramalingam, Sadiq and the other co-conspirators arranged weapons, vehicles and hideouts for executing the plan. He was instrumental in recruiting the assailants. After the murder, Sadiq was hiding in Tamil Nadu and Andhra Pradesh for the past two years before he was apprehended, the agency said in a press release. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The NIA had announced a reward of ₹5 lakh for information leading to the arrest of Sadiq.  Published - August 04, 2021 12:17 am IST  Tamil Nadu / murder "
    },
    {
      "title": "The Hindu Explains | Keezhvenmani: The first chronicle of violence against Dalits in independent India",
      "content": "December 25, 2018 marks the 50th anniversary of the Keezhavenmani massacre. In a wage struggle, 16 women, 23 children, and five men were charred to death on December 25, 1968 inside a hut in which they took refuge.  Keezhvenmani is a village in Nagapattinam district of Tamil Nadu. On December 25, 1968, 44 Dalits were locked in a hut in the village, which was then set fire to. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window.  Keezhvenmani was independent India’s first well-chronicled massacre of Dalits, and came to signify the suppression of a landless community raising its voice to seek something as basic as decent wages. Under the influence of the communist movement prevalent at that time in the eastern part of the then unified Thanjavur District (now Nagapttinam district), the rise of Dalits became a symbol of class and caste struggle.   The gruesome killings came as a jolt to Tamil Nadu which had just voted for the DMK, replacing the Congress, traditionally known as a party of the landed gentry . The Keezhvenmani incident also launched irreversible agrarian changes , spawning mass scale redistribution of temple and mutt lands in the region.   Keezhvenmani was the culmination of Dalits finding their nascent voice under the banner of the communist movement in the unified Thanjavur district.  A memorial with 44 pillars eternalising the memory of the 44 Dalits was inaugurated in 2014 by the Communist Party of India (Marixst). The memorial was built with contributions of ₹3 crore from members of the CITU .    From Indira Parthasarathy’s Kuruthipunal to Meena Kandasamy’s The Gypsy Goddess , Keezhvenmani has inspired several literary works.  Kuruthipunal (The River of Blood) was serialised in Kanaiyazhi — a literary magazine of repute — in 1970. The novel triggered widespread debates. While the CPI(M) protested against the novel, calling it an attempt to digress from the issue, and burnt copies, the CPI supported it. But the novel fetched Indira Parthasarathy the Sahitya Akademi Award.   “These days, they happen all over — atrocities against Dalits. And nobody seems shocked. Back then, we were really shocked. I somehow wanted to write on it — one because it was very close to where I used to live and grow, and two because I firmly believe writing is a social act. Any art work for that matter is,” Mr. Parthasarathy told The Hindu in January 2018. The novel was later made into a filmKan Sivanthaal Man Sivakkum .   Published - December 25, 2018 05:02 pm IST  The Hindu Explains / Tamil Nadu / dalits / labour / agriculture "
    },
    {
      "title": "Relative murders girl for rejecting marriage proposal",
      "content": "An 18-year-old girl was murdered in Tiruvarur district by her relative after she reportedly refused to marry him.  The accused, Boominathan alias P. Sivasankar, 28, allegedly threw a grinding stone on the victim, who stayed in her grandmother’s house at Pettai village in Muthupettai police station limits on Saturday night. The girl, who sustained grievous injuries, died on the way to hospital early on Sunday. The parents of the girl, a first-year diploma student, resided at Poovalur village near Pattukottai in Thanjavur district. They reportedly rejected the marriage proposal. An enraged Sivasankar allegedly threw the grinding stone on the girl when she was asleep in her grandmother’s house.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The grievously injured girl was rushed to Government Hospital at Pattukottai. She was subsequently referred to Thanjavur Medical College Hospital, but died on the way. Muthupettai police registered a case and arrested Sivasankaran.  Published - July 25, 2021 07:40 pm IST"
    },
    {
      "title": "Vallam DSP to probe electrocution deaths in Thanjavur",
      "content": "The death of 11 persons, including three juveniles, due to high-voltage electrocution during a chariot procession at Kalimedu village in Thanjavur district in the early hours of Wednesday will be probed by a Deputy Superintendent of Police, Vallam sub-division.  He would be assisted by five Inspectors of Police, the Inspector General of Police, Central Zone, V. Balakrishnan, told The Hindu.  IG Balakrishnan, who inspected the spot following the incident, said the chariot was proceeding on a black topped road at Kalimedu when the incident occurred at 3 a.m. Preliminary inquiries revealed that the chariot was taking a turn to return when it gravitated towards one side and came into contact with the high-tension wire resulting in electrocution and multiple deaths.  This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. The generator used to power the serial bulb decoration on the chariot and the chariot caught fire on the impact. The increase in the height of the road during black topping was cited as a reason for the accident. Mr. Balakrishnan said detailed investigation would throw light on the exact cause of the accident. Various aspects, including negligence on the part of the organisers, would be looked into during the course of the probe. The villagers had apparently informed the police orally about the religious procession.  A case under section 174 of the Code of Criminal Procedure (electrocution) had been registered at the Kallaperambur police station, Mr. Balakrishnan said.  Meanwhile, a senior Fire and Rescue Services Department officer said the Thanjavur headquarters fire station received the call at 3.14 a.m. and a fire tender was immediately rushed to the village. The vehicle reached the spot at 3.19 a.m. as the place was a few kilometres away.  The officer said fire was put out after the power supply was cut. The metal frame in which lighting was done on the chariot’s top is believed to have come into contact with the high tension wire resulting in electrocution. Those who suffered severe electric shock were thrown away, the officer further said. A fire tender has been kept as a standby at the spot.   Published - April 27, 2022 12:41 pm IST"
    },
    {
      "title": "Woman kills twodaughters, self",
      "content": " Distressed over domestic tussle with her husband, a woman took poison after poisoning her two daughters to death near here on Sunday. Police said Kalaiyarasi (35), wife of farmer Rajasekaran (40) of Pananthidal near Papanasam in Thanjavur district, was distraught. Following yet another bout of quarrel on Sunday, Kalaiyarasi had reportedly consumed poison after administering the same poison to her daughters Lasya (aged three-and-a-half years) and Lakshita (aged eight months). Kalaiyarasi died at Thanjavur Medical College Hospital on Sunday night, followed by Lasya who succumbed at Raja Mirasdar Government Hospital here around the same time. Infant Lakshita died at the same hospital on Monday. This is a modal window. Beginning of dialog window. Escape will cancel and close the window. End of dialog window. Kalaiyarasi’s father Karuppaiyan of Thirukarugavoor preferred a complaint with the Papanasam police who are investigating. (Assistance for overcoming suicidal thoughts is available on the State’s health helpline 104 and Sneha’s suicide prevention helpline 044 24640050)  Published - December 05, 2016 06:48 pm IST  crime / suicide "
    }
  ]
}